{
  "questIDHigh:4": 4019651812297622743,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": -1140536415636076538,
      "questIDLow:4": -5479647572889222662
    }
  },
  "questIDLow:4": -4693314276576942578,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "LogisticsPipes:item.itemModule",
        "Count:3": 1,
        "Damage:2": 600,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Заставьте эти машины работать",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Большинство рецептов изготавливаются на всевозможных машинах. Хотя ремесленная логистическая трубка работает, она может содержать только 1 рецепт на трубку.\n\nЭто не проблема для логистических верстаков, поскольку они могут хранить только один рецепт верстака, но назначать только один рецепт для одной машины расточительно.\n\nДля машин используйте шасси. Предпочтительно более высокий уровень. Шасси Mk1 с модулем крафта — это, по сути, просто логистическая труба крафта.\n\nВы не можете щелкать рецепты из NEI, поэтому вам придется перетаскивать рецепт из него. Не волнуйтесь, вы можете перетаскивать призрачные элементы из NEI в слоты модуля, чтобы настроить его.\n\nВы замечаете, что справа есть 3 серых слота. Они предназначены для труб спутниковой логистики. Мы поговорим об этом позже.\n\n§cПримечание: НЕ используйте выходную поверхность машины. Выходная сторона блокирует все взаимодействия, если только вы не ударите по ней отверткой.\n\nТакже НЕ используйте автоматический вывод, иначе машина выведет элемент в канал, и сеть будет рассматривать продукт как элемент, вставленный в систему, а не как элемент, запрошенный системой, и отправит его в свое хранилище. Все остальные лица, кроме обложки, работают.§r\n\nГалочка означает, что вы прочитали все и должны знать, как работает автоматизация машин с использованием LP. Наградой за этот квест является знание того, как автоматизировать рецепты машин GT."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
