{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2007
    }
  },
  "questIDLow:4": 2699,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15430,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Сыграй еще раз, Сэм",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Итак, если вы считаете, что один квантовый компьютер — это круто, как насчет двух? Вы можете объединить их, чтобы получить больше вычислительной мощности для своих исследований, подключив их с помощью оптических разъемов так же, как вы подключаетесь к исследовательской станции. Исходный КК должен иметь подчиненный для приема данных от второго.\n\nКонечно, это довольно дорого, поэтому есть другой вариант — просто расширить первый. Вы можете снести две последние колонны блоков, а затем использовать стопку из двух проекторов голограмм, чтобы увидеть, как можно построить стойку из 4 компьютеров. Однако для питания вам понадобится еще один люк UV или выше, если вы используете 4 стойки, поскольку для этого будет потребляться ток 5 А. Если хотите, вы можете сделать то же самое для стопки из 12 штук для 24 компьютерных стоек. Просто добавьте больше среднего фрагмента или позвольте большой стопке голограммных проекторов показать вам, как это делается.\n\nЕсли вы используете 3 стойки с 3 мэйнфреймами Crystalprocessor и 1 усовершенствованным теплоотводом в каждой, вам будет достаточно для контура UEV, и он также не будет перегреваться.\n\nТретий вариант для более высоких потребностей в вычислениях — это, наконец, вернуться назад и научиться устанавливать параметры полезным способом. Это дает вам более точный контроль над максимальным нагревом, которого достигает ваш QC, и максимально эффективно использует его.\n\n§4 Не забудьте дать всему теплу в ваших контрольных центрах рассеяться, прежде чем что-то менять."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
