{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2641
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2623
    }
  },
  "questIDLow:4": 3283,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 14003,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Космический лифт",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Космический лифт представляет собой модульную конструкцию. Его можно оснастить модулями космического лифта, которые затем смогут выполнять различные задачи.\n\nИзначально ваш космический лифт имеет 6 слотов для модулей, которые можно использовать. Позже вы можете увеличить это число до 12 с помощью двигателей Mk-II и Mk-III. Уровень двигателя также определяет уровень модуля, который вы можете использовать. Входы/выходы не распределяются между модулями, каждый модуль видит только свои собственные слоты ввода/вывода. Энергия подается только в центральную конструкцию космического лифта, а затем автоматически распределяется по всем модулям.\n\nПосле того, как модуль вставлен и снабжен нужным входом/выходом, его можно дополнительно настроить с помощью параметров.\n\nВ NEI вы можете увидеть, какие жидкости можно перекачивать с помощью космического насосного модуля. Для работы он потребляет ток 1А сверхвысокого напряжения. Тип газа и тип планеты являются параметрами.\n\nВ NEI также есть обзор всех руд, которые вы можете получить с помощью модуля космической добычи. Его необходимо снабдить дроном, который будет действовать как катализатор, набором входных элементов, компьютером и плазмой с гелием, висмутом или радоном. Плазма увеличит как время рецепта, так и количество бонусных стаков, которые вы получаете от рецепта. С помощью его параметров вы можете регулировать параллели, ускорение и расстояние. Если несколько рецептов имеют одинаковые входные данные и для расстояния установлено общее значение, модуль выберет случайный вариант, принимая во внимание веса рецептов.\n\nКосмический лифт также позволяет путешествовать на другие планеты. Однако это не вернет вас обратно, и документации нет. Так что лучше разберитесь сами, как это работает.\n\nМодуль майнинга также получил циклический режим. В статическом режиме он будет удерживать расстояние, а в циклическом режиме оно будет изменять свое расстояние после каждой проверки рецепта (и вы можете настроить его диапазон и размер шага)."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 14003,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
