{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2610
    }
  },
  "questIDLow:4": 2695,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:gtplusplus.blockspecialcasings.2",
        "Count:3": 1,
        "Damage:2": 2,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Серьезные обновления",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Итак, если вы подумали: «Эй, фиолетовый цвет не так уж и плох, почему бы не сделать зеленый?», то, прежде всего, вам может понадобиться профессиональная помощь. Во-вторых, вам нужно будет находиться в ZPM, чтобы изготовить нужные вам оболочки, и точка. Для компонентов вам понадобится ZPM ABS, так что возвращайтесь, как только сделаете ZPM Energy Hatch.\n\nВероятно, вы сможете разобраться с большей частью этого самостоятельно, но имейте в виду, что некоторые материалы необходимо создать из АБС, затвердеть, мацерировать, а затем использовать в другом рецепте АБС. Примерами здесь являются Hastelloy-N для соединения лафиума и рений для лауриума. Сам рений производится по нестандартной рецептуре ABS. Вам также понадобится диспрозий, для которого необходимо либо создать Редкоземельную землю (III), либо отправиться в Токсичные Эверглейдс. И либо Редкоземельный (II), либо Редкоземельный (III) для иттербия, если, опять же, вы не посетите Эверглейдс за ним. Вы также можете получить иттербий из альмандиновой руды, если хотите попробовать GT-измельчение и пенную флотацию.\n\nПолучайте удовольствие от этого!\n\n§3 Вам почти наверняка понадобится больше, но точное количество, как всегда, зависит от ваших люков и автобусов."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:gtplusplus.blockspecialcasings.2",
          "Count:3": 70,
          "Damage:2": 2,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
