{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 176
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 546
    }
  },
  "questIDLow:4": 2990,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings4",
        "Count:3": 1,
        "Damage:2": 2,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Мощность генератора",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Добро пожаловать в ЕВ! Если вы думали, что на предыдущем уровне произошел большой скачок в переработке нефти, вы правы, но теперь она снова подскочит вверх!\n\nЭтот уровень не открывает новые мультипроцессоры обработки, как это сделал HV, но дает лучшие, гораздо лучшие генераторы. Отныне ваши основные варианты генераторов почти всегда будут мультиблоками, если только вам не понадобится легкий в перемещении генератор для мультиблочного майнера или что-то подобное. Что касается вашего дизельного топлива, следующим шагом будет Большой двигатель внутреннего сгорания (LCE), и квест для него, как обычно, есть на вкладке «Мультиблочные цели». Однако это, помимо прочего, большие инвестиции в Титан, поэтому я надеюсь, что эта обработка уже автоматизирована.\n\nЕсли вы увеличите LCE, вы получите огромный прирост EU/t и эффективности. В то время как дизельный генератор высокого напряжения имел производительность 512 EU/т при эффективности 85%, этот дорогой мультигенератор выдает 6144 EU/т при эффективности 150%! Убедитесь, что у вас есть динамо-люк с буферизацией EV, который может справиться с этим выходом.\nСуществует эквивалентная турбина для газов, например, для нефтеперерабатывающего газа, которую вы можете использовать для питания вашей установки по переработке нефти. Ее дешевле построить, но ее производительность зависит от турбины, размещенной внутри нее, и вы не сможете приблизиться к ней. уровни LCE, если только вы не получите немного вольфрамовой стали и хорошего металла, такого как Shadow Metal."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
