{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 546
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 88
    }
  },
  "questIDLow:4": 2986,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings2",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Вот немного масла",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Добро пожаловать! Это квестовая линия, которая показывает путь через переработку нефти ко всем полезным предметам и жидкостям, которые можно из нее получить. Работа с этой черной жидкостью включает в себя множество шагов, от LV (низкого напряжения) до IV (безумного напряжения), а также выходов, полезных на этих уровнях и за его пределами.\n\nМасло полезно как для выработки энергии, так и для автоматизации многих химических веществ, важных для прогресса. По мере вашего прогресса вы сможете получать больше данных и получать их быстрее, а также обрабатывать их новыми способами, которые улучшают настройку, которую вы использовали раньше. Это не обязательный путь для развития в пакете, но он очень полезен, если вы решите ему следовать.\n\nЛучший способ начать работу с нефтью — извлечь ее с поверхности. Нефтяные струи видны без необходимости копать, и с ними можно взаимодействовать, используя насос, расположенный над ними, рядом с генератором, который подает ему некоторую мощность. На данный момент вы можете использовать немного масла для создания этой энергии."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
