{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 546
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1148
    }
  },
  "questIDLow:4": 2987,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:gtplusplus.blockspecialcasings.2",
        "Count:3": 1,
        "Damage:2": 1,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Нефтяная буровая установка",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "На уровне MV эффективность масла значительно повышается и становится фантастическим вариантом генерации энергии для тех, кто хочет отключить Steam, если они еще этого не сделали. Становится сложно использовать Steam в качестве единственного источника энергии на этом уровне, поэтому вам следует найти более надежный способ получения энергии.\n\nКонечно, вы, возможно, уже используете легкое топливо в качестве источника энергии, но сейчас у вас в голове может возникнуть другой вопрос: есть ли лучший способ получить нефть? Возможно, вам не хватило денег, а возможно, и нет. В любом случае, на этом уровне есть разблокированный мультиплеер, который может значительно облегчить автоматизацию подачи нефти на ваш ликеро-водочный завод. Этот мульти-инструмент — нефтяная буровая установка, которая может перекачивать нефть из-под коренной породы, но только если она есть в текущем куске, а это означает, что вам придется сканировать куски вокруг вас, чтобы найти ее.\n\nКвест на этот риг есть во вкладке Multiblock Goals. Иди и проверь это!"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
