{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2988
    }
  },
  "questIDLow:4": 3001,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "Thaumcraft:ItemResource",
        "Count:3": 1,
        "tag:10": {
          "ench:9": {
            "0:10": {
              "lvl:2": 1,
              "id:2": 35
            },
            "1:10": {
              "lvl:2": 1,
              "id:2": 21
            }
          }
        },
        "Damage:2": 18,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Использование всех дробей",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Получив большое количество всех фракций нефти, что с ними делать? Они будут скапливаться в резервуарах или выходных люках, а Дистилляционная башня будет продолжать работать, даже если не сможет что-то выдать; все, что не может быть выведено, будет просто аннулировано, и в ваших интересах избежать таких потерь. Что же делать тогда?\n\nПрежде всего, важно отметить, что почти все, что вы получаете от нефти, можно переработать в еще большее количество вещей. Целесообразен этот шаг или нет – это совсем другая история. Тем не менее, вы можете просмотреть NEI или электронную таблицу, чтобы решить, что вы хотите сделать и как вы хотите это сделать. Прелесть такой цепочки обработки в том, что она позволяет вам выбрать свой собственный путь и дает вам информацию, позволяющую узнать, как лучше всего его использовать.\n\nВо-вторых, нефть является основным источником побочных продуктов, многие из которых необходимы для создания различных важных материалов. Однако это не единственный способ получить большинство из них, и вы, возможно, уже нашли другие источники, особенно если вы баловались цепочками бензола или биомассы. Какой путь вы выберете, зависит от вас.\n\nТеперь о четырех фракциях, которые вы получаете из обычного масла. До сих пор для производства электроэнергии требовалась переработка как легкого, так и тяжелого топлива, а нефтеперерабатывающий газ уже оказался хорошим источником этилена. Для чего их можно использовать, если вы сможете построить больше DT для переработки крекированных жидкостей? Грубо говоря, это следующие возможности:\n\nЛегкое топливо. Скорее всего, вы будете использовать большую часть или все это для производства дизельного топлива. Если у вас остались остатки, умеренный гидрокрекинг — хороший источник пропена, а легкий гидрокрекинг — лучший источник октана. Эти два параметра важны, но только для электромобилей, в частности для эпоксидной смолы и силовых агрегатов.\n\nТяжелое топливо: если работать только с обычным маслом, большая его часть также будет использована для производства дизельного топлива. Однако важно максимально автоматизировать его, поскольку его можно напрямую перегонять с получением трех фантастических побочных продуктов: толуола, фенола и бензола. Все они важны для прогресса, поэтому обязательно обратите внимание на этот рецепт. Толуол особенно полезен в HV, так как вам понадобится много ведер его при изготовлении первой ракеты, чтобы попасть в EV.\n\nНафта: вы можете перегонять ее в дистилляционной башне, но имейте в виду, что вам нужно построить башню максимальной высоты, чтобы охватить весь рецепт. Однако, если вы это сделаете, вы будете автоматизировать большую часть побочных продуктов нефти, а это означает, что стоит заняться этой задачей, когда вы освоитесь с производством большого количества нержавеющей стали; он также имеет хорошую теплоту сгорания, поэтому, если вам не нужны эти побочные продукты, лучше всего использовать их для получения энергии.\n\nНефтеперерабатывающий газ: Вы, вероятно, уже перегоняете его для получения этилена. Вы можете переключить этот рецепт на дистилляционную башню и установку для крекинга нефти (см. следующий квест), чтобы получить больше продукции и некоторые полезные побочные продукты."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1126,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30740,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30741,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30739,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30735,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 32,
          "Damage:2": 11306,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 2,
          "Damage:2": 130,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 6,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:item.CoinChemistII",
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
