{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 721
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 103
    }
  },
  "questIDLow:4": 1541,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:itemCropnalyzer",
        "Count:3": 1,
        "tag:10": {
          "uid:4": -73442049,
          "charge:6": 100000.0,
          "Items:9": {}
        },
        "Damage:2": 1,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Анализируйте свой урожай",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Cropnalyzer — это мощный инструмент, используемый для анализа мешков с семенами IC2. Зарядите его, поместив в машину среднего напряжения; рекомендуется также установить в него аккумулятор среднего напряжения, чтобы он оставался полным. Чтобы полностью проанализировать пакетик с семенами, вам придется четыре раза пропустить его через кроп-анализатор. Если урожай уже посажен, лучше проанализировать его портативным сканером, а не ломать просто для сканирования – у вас есть шанс потерять семя каждый раз, когда вы его ломаете.\n\nАнализатор урожая также имеет функцию под названием IC2 Crop Calculator, где вы можете найти сочетание результатов селекции любых культур. Чтобы получить доступ к калькулятору, нажмите боковую клавишу инвентаря IC2, удерживая кроп-анализатор. Вы можете выбрать любые доступные культуры и узнать, какие растения дают приличный процент результата. И нет, вы не можете сделать обратное, найдите для этого файл Crops.zip на Discord (хотя в нем нет микадии).\n\nВы можете выбрать до четырех культур для разведения вместе. Затем нажмите «обработать», и в нижней строке отобразятся возможные результаты скрещивания и их веса. Вы можете использовать кнопки и - для прокрутки строк культур. Вы также можете использовать кнопку в графическом интерфейсе для сортировки строк по уровню или весу. Вы можете инвертировать сортировку, нажав кнопку сортировки, удерживая клавишу Shift.\n\nПытаясь получить определенный урожай, вы обычно хотите максимизировать его процент. Сделайте это, скрестив 2–4 растения одного и того же растения (чем больше, тем быстрее). Скрещивание типов растений не дает никаких преимуществ, оно просто снижает процент шансов получить то, что вы хотите, вопреки тому, что вы думаете.\n\nДля получения более подробной информации воспользуйтесь руководством по культурам по адресу §1§n[url]https://tinyurl.com/GTNH-Crops[/url]§r.\n\nБольшое поле палочек дает хорошие шансы получить много ценных скрещиваний. Это потому, что это прилично высокий уровень (в основном они случайным образом мутируют в соседние уровни), и он действительно быстрый, так что вы можете быстро получить высокие характеристики, что вам, вероятно, следует сделать в первую очередь. Мутации случайны, трансформиум можно получить из стикрида, так что имейте это в виду. Вы, как правило, получаете похожие культуры, поэтому, если вам нужны металлы, приобретите, например, металлические культуры. Посетите вики или электронную таблицу (неактуальную), чтобы увидеть атрибуты, определяющие сходство."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 0,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "IC2:itemCropnalyzer",
          "Count:3": 1,
          "tag:10": {},
          "Damage:2": 32767,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IC2:itemCropSeed",
          "Count:3": 4,
          "tag:10": {
            "owner:8": "berriespp",
            "name:8": "Glowflower",
            "scan:4": 4,
            "growth:4": 1,
            "resistance:4": 1,
            "gain:4": 1
          },
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "IC2:blockCrop",
          "Count:3": 32,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:4": 3,
                "id:4": 35
              }
            }
          },
          "Damage:2": 51,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 30,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:item.CoinFarmer",
          "Count:3": 30,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "tag:10": {
            "GT.ItemCharge:4": 200000
          },
          "Damage:2": 32529,
          "OreDict:8": ""
        }
      }
    }
  }
}
