{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1794
    }
  },
  "questIDLow:4": 2769,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 345,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Еще больше статистики",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Есть еще семь статистических данных, о которых стоит беспокоиться.\n\n§7Удобрения§r, §9Вода§r и §4Weed-EX§r касаются того, сколько из них находится на стебле урожая, а не на самом урожае. Все они о том, сколько было применено и что от этого осталось.\n\n§2Питательные вещества§r, §1Влажность§r и §6Качество воздуха§r — все это связано с окружающей средой. На них также влияют характеристики удобрений и воды.\n\nПитательные вещества и влажность в основном соответствуют правильному биому, причем лучше всего подходят болота и тропические леса (жарко-влажные), но вы также можете получить некоторые дополнительные характеристики, настроив правильно.\n\n§2Питательные вещества§r:\n3 возможных свободных очка от грязи под блоком сельскохозяйственных угодий, 2 для растений, которым требуется определенный блок. Поэтому оптимально всегда следить за тем, чтобы нужный блок находился в самом низу столбца, потому что он проверяет цепочку, а не определенную высоту. Например: палочка -\u003e сельскохозяйственная земля -\u003e грязь -\u003e рудная глыба -\u003e грязь, будет зарегистрирована только 1 грязь, игнорируя ту, что под рудной глыбой.\n\n5-10 возможных очков от удобрения вашего урожая. Вы можете использовать удобрения для урожая, чтобы повысить его питательные свойства. Максимальный уровень удобрений составляет 199, что дает 10 питательных веществ, но может быть применено снова, только если урожай упадет ниже 100 очков удобрений. Таким образом, для культур с высокими показателями можно с уверенностью предположить и провести тесты для 100 баллов удобрений как заданной константы, в отличие от значений 199-\u003e 100. Вы можете вносить костную муку, удобрения IC2 и удобрения для лесного хозяйства вручную. Ручная лесная мультиферма и управляющая садом делают это автоматически при поступлении удобрений (мультферме также нужны удобрения для сбора урожая).\n\n§1Влажность§r:\n2 бесплатных очка за использование земли в качестве сельхозугодий, так как, когда сельхозугодья увлажняются водой (темнеют), они получают 2 очка влажности. Вот почему другие блоки для этого отстой, поскольку они не дают этого бонуса.\n\n10 возможных очков от увлажнения вашего урожая. Подобно внесению удобрений, воду можно вносить на урожай до 200 пунктов, что соответствует 10 пунктам влажности, хотя, в отличие от удобрений, ее значение не должно опускаться ниже 100, воду можно поливать снова и снова, поддерживая ее на постоянном уровне 200 пунктов. Вы можете вручную поливать урожай, используя гидратационные ячейки IC2, или позволить ручной мультиферме Forestry и специалисту по выращиванию культур сделать это автоматически. Однако мультиферме нужна вода и для сбора урожая.\n\n§6Качество воздуха§r:\n4 потенциально свободных точки из пустого пространства вокруг урожая. Кроп проверяет наличие пустых мест для расчета бонусных очков качества воздуха, дает до 4 баллов, по 1 баллу за каждые 2 пустых места. Однако он учитывает только полные блоки или палочки. Если вам нравится внешний вид, вам, вероятно, придется пожертвовать этим.\n\n4 бесплатных очка с высоты вашей фермы. Вы получаете 1 бесплатный балл за каждые 15 блоков, начиная с 79 иен.\n79 – 1 балл\n94 – 2 очка\n109 – 3 очка\n124 – 4 очка\n\n2 свободные точки из непрозрачных блоков над кадром. Вы можете разместить стекло сверху и не потеряете бонус, так как это прозрачный блок. Вы не можете использовать темное стекло, несколько слоев воды или газообразную тень, чтобы обойти это, если ваш урожай любит темноту. Если только вы не позволите ему расти только ночью, я думаю§..\n\n§aРасширяемость§r:\nВашему урожаю потребуется определенный уровень NHA, постарайтесь достичь или превзойти его, иначе урожай либо не вырастет, либо даже погибнет (исчезнет). Каждый урожай индивидуален, и более высокие уровни (и характеристики) требуют большего. Однако, как правило, его легко встретить, если вы находитесь в хорошем биоме.\n\nВыращиваемость определяется разницей между тем, что нужно культуре с точки зрения NHA, и тем, что она на самом деле имеет. Если у вас есть больше, чем вам нужно, оно растет быстрее. Вот почему вам не нужен максимальный показатель сопротивления, поскольку более высокие характеристики замедлят его."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
