{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 721
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2415
    }
  },
  "questIDLow:4": 2729,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 12501,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Генетическая модификация ваших растений",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Для этого необходимы 3 машины. Вам также понадобятся ведра мощности и столько же (буквально) UUM.\n\nВсе три могут работать только с культурами до определенного уровня, определяемого уровнем созданной вами машины и культурой, с которой вы работаете. По сути, это (уровень урожая 2)/2, округленное в большую сторону. Таким образом, машина LV может работать с культурами Т1, а машина MV — с культурами Т3.\n\nВо-первых, это экстрактор генов культур:\nВо время работы ему потребуется имеющийся мешок с семенами урожая, пустая сфера §2Data§r (см. квесты EV) и §61A§r. Используйте схему, чтобы определить, какую характеристику скопировать в сферу данных. Вам, вероятно, понадобится либо 23-31-0, либо 31-31-0 для максимальной скорости и производительности, поскольку вы не будете использовать их для размножения. Не забудьте принять надлежащие меры предосторожности, если вам больше 23 лет, поскольку они будут пытаться пропалывать все вокруг себя. Здесь имеется значительное количество урожая, поэтому вам, вероятно, понадобится тонна сфер, если только вы не захотите использовать их повторно. §4Не забудьте сохранить резервную копию сферы данных или мешка с семенами!§r\n\nВо-вторых, это синтезатор урожая:\nВо время работы требуется §24 сферы данных§r, по одной для каждого типа из CGE, §51000L UUM на каждый уровень урожая/2§r (это не округляется) и §616A§r во время работы. Он создаст новый мешок с семенами урожая с желаемыми характеристиками.\n\nИ наконец, репликатор урожая:\nВо время работы требуется существующий мешок с семенами, §51000L за каждый уровень урожая UUM§r и §66A§r. После завершения он возвращает вам два одинаковых мешочка с семенами, дублируя его. Это требует вдвое больше UUM, но меньше мощности, стоит ли оно того, решать вам."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
