{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2729
    }
  },
  "questIDLow:4": 2770,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "thaumcraftneiplugin:Aspect",
        "Count:3": 1,
        "tag:10": {
          "Aspects:9": {
            "0:10": {
              "amount:3": 2,
              "key:8": "messis"
            }
          }
        },
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Мин-макс. урожай",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Разводите стикрид примерно до 31.20.10, затем создавайте с его помощью другие культуры, они наследуют характеристики. Скрещивание с теми, кого вы попали на пути к повышению их характеристик, тоже хорошо.\n\nРазбейте лагерь в биоме типа болота/джунглей около Y130 или используйте методы изменения биома, чтобы создать его. Это намного быстрее при выращивании сельскохозяйственных культур, а не просто выращивании их ради дропов.\n\nВсегда используйте мультифермы. Вы можете использовать их вместе с комбайнами, если у вас очень быстрый урожай. Или просто используйте больше ферм. Или добавить больше коробок передач.\n\nТемное стекло хорошо подходит для ягод брусники.\n\nЧтобы избежать прополки, перемещайте шахматную доску вверх и вниз на своей мультиферме. Возможно, это выглядит глупо, но никаких сорняков, Гр 23-\u003e31 и 2 AQ!\n\nИспользуйте фертилию, чтобы создать больше удобрений.\n\nВы можете заменить фермы мобов сельскохозяйственными культурами, если вас не волнуют другие дропы. Однако из инферналов выпадают особые вещи.\n\nИспользуйте WA в режиме TE, чтобы ускорить сбор урожая, если вам это нужно. В основном полезен для разведения, выращивания и получения исконного ягодного урожая.\n\nПо мере повышения уровня вы можете создавать 31/31/0 урожаев с помощью машин и UUM. Хотя решать вам, стоит ли оно того.\n\nЕсли вам нужно что-то более высокое, чем материалы уровня EV, займитесь пчелами."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
