{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3098
    }
  },
  "questIDLow:4": 3103,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "Railcraft:machine.alpha",
        "Count:3": 1,
        "Damage:2": 12,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Усовершенствованная коксовая печь",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Ваша потребность в энергии увеличилась в четыре раза по сравнению с предыдущим уровнем, и вполне вероятно, что вы не получаете древесный уголь достаточно быстро. Вместо того, чтобы добавлять еще больше коксовых печей, почему бы не построить их обновленную версию?\n\nПредостережение: с этого момента вы не будете производить креозот вместе с углем. Это обеспечивает приличную мощность соответствующих генераторов, и вы, возможно, уже использовали ее для производства смазки. Несмотря на это, вы все равно можете получить креозот при обработке на следующих этапах этой цепочки заданий, так что вы все равно сможете получить его, если он вам понадобится. Разобравшись с этим, давайте перейдем к усовершенствованной коксовой печи (ACO).\n\nКак это сделано? ACO требует гораздо больше шагов, чем обычные коксовые печи, шаги, сосредоточенные на материалах Пустоты, приготовленных в EBF, а затем охлажденных. Охлаждающая часть обычно является работой вакуумной морозильной камеры, как вы увидите позже, но вы пока не можете ее построить; из-за этого вам придется использовать охлаждающую жидкость IC2 для отделки кирпичей, используемых в ACO. После того, как вы создали все необходимые для этого блоки, вы можете соединить их и запустить, чтобы увидеть, что отличается от предыдущего.\n\nСкорость этого нового — 1 древесный уголь в секунду, что эквивалентно 90 коксовым печам. Ценой этого является потеря креозота, а также то, что для работы ему требуется топливо, поэтому на этом этапе теряется примерно 1/16 вашего древесного угля. К счастью, вы можете автоматизировать это с помощью каналов элементов, а каналы EnderIO делают это еще проще. Входная древесина, входной уголь, выходной древесный уголь.\n\nСделайте один из этих мультиов, чтобы продолжить. Имейте в виду, что вам может понадобиться больше!"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "Railcraft:machine.alpha",
          "Count:3": 34,
          "Damage:2": 12,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "Railcraft:cube",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 2,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:2": 3,
                "id:2": 35
              }
            }
          },
          "Damage:2": 5,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:item.CoinSmithI",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
