{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3096
    }
  },
  "questIDLow:4": 3093,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 30674,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Углерод, Химически",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Как вообще все эти органические вещества производят энергию? Сожжешь, вот как! Тепло от этого горения нагревает воду до пара, и это может заставить паровую турбину вращаться, генерируя энергию вращения, которую можно напрямую преобразовать в электричество с помощью вращающихся магнитных полей. Довольно аккуратно, правда? Древесина/древесный уголь являются горючим материалом, а атмосфера обеспечивает кислород, необходимый для поддержания огня. С помощью химии и магии GTNH мы можем использовать эти принципы для генерации энергии альтернативным способом.\n\nЭто действительно волшебство. Окись углерода (CO) является допустимым топливом для газовых турбин, и его можно производить из древесного угля и кислорода. У CO больше энергии, чем у угля, использованного для его производства, но дополнительный кислород сделает этот шаг нецелесообразным, если вы получите его путем электролиза воды или центрифугирования воздуха, поскольку ЕС, необходимый для этих ремесел, сделает этот процесс неэффективным. Однако есть более эффективный способ автоматизировать производство кислорода, но для этого вам понадобятся культуры.\n\nВаша цель — сахар, так как при его электролизе будет вырабатываться кислород почти в 1000 ЕС на ведро. Каждое ведро CO производит 24 000 EU, изготовленное из одного древесного угля, который производит примерно 16 000 EU в Steam и стоит 560 EU за корабль. Весь процесс дает около 6000 ЕС бесплатной энергии на уголь, что в целом составляет около 30% дополнительной мощности!\n\nЧтобы автоматически получать сахар из сельскохозяйственных культур, вам нужна сахарная свекла. Сахарный тростник делает то же самое, но с более высокими затратами на получение сахара в ЕС. Есть и другие возможные способы, но пока просто возьмите много сахара."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "minecraft:sugar",
          "Count:3": 256,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "IC2:itemCellEmpty",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:item.CoinChemist",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
