{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3110
    }
  },
  "questIDLow:4": 3111,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "Railcraft:fluid.creosote.cell",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Работа Креозота",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Ваш старый приятель Креозотовое масло снова в игре! Правильно, вы снова можете получить его автоматически при переработке древесного угля, как вы это делали с первыми коксовыми печами, и то, что вы можете с ним делать, примерно то же самое. Двумя основными целями, которые он выполняет, являются выработка электроэнергии и смазка, которую вы захотите использовать в режущих станках, а также потребуется в некоторых более поздних мультиблоках, таких как большой двигатель внутреннего сгорания и многоблочный шахтер. Используя пивоварню, вы можете добавить немного красного камня, чтобы быстро превратить это масло в смазку и держать ее на складе для любой машины или корабля, которые в ней нуждаются.\n\nАльтернативно, вы можете получить от этого немного дополнительной мощности. Стоимость топлива на ведро намного ниже, чем у большой тройки, но у него все же есть интересное применение. Когда полужидкостные генераторы были сломаны и креозот в них нельзя было использовать, существовали установки с использованием двух котлов LP Railcraft максимального размера, чтобы превратить сумму, которую вы получаете от одного DT, в ЕС, необходимую для его запуска, что делало этот шаг совершенно бесплатным. с точки зрения власти. Были некоторые мелкие детали, такие как необходимость того, чтобы все паровые турбины были низковольтными для экономии топлива, но с самого начала было бы проще использовать полужидкостные генераторы. В любом случае, если хотите, вы можете, по крайней мере, исключить стоимость ЕС из DT из уравнения."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "Railcraft:fluid.creosote.cell",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": "cellCreosote"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 32,
          "Damage:2": 30724,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 6,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "dreamcraft:item.CoinChemistII",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
