{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3095
    }
  },
  "questIDLow:4": 3096,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "Railcraft:machine.alpha",
        "Count:3": 1,
        "Damage:2": 7,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Быстрый уголь",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Даже если у вас больше дров, это не сильно решит ваши проблемы с электричеством. Использование его непосредственно в качестве топлива не принесет вам много пользы в дальнейшем, а превращение его в древесный уголь будет очень важным. Вы уже построили коксовую печь, а может быть, и более одной, но на производство одного древесного угля каждой из них уходит 90 секунд, а это ужасающая скорость. К сожалению, на этом уровне нет более быстрого варианта, поэтому вам придется построить больше таких печей. Сколько именно?\n\nЕсть много разных целей, которые вы, возможно, захотите достичь, но хорошим показателем ваших потребностей в электроэнергии является установка с 24 коксовыми печами. Это количество будет производить как древесный уголь, так и креозотовое масло со скоростью, которая позволит использовать два железнодорожных котла LP (низкого давления) максимального размера, один твердый и один жидкий, с квестом для тех, кто придет сразу после этого. Если вы автоматизируете всю эту установку, она будет производить около 2 ампер среднего напряжения, что эквивалентно 8 амперам низкого напряжения. Это достаточная мощность для этого уровня и достаточная для перехода на следующий уровень.\n\nПосле постройки коксовых печей вам нужно будет их автоматизировать. Есть несколько способов сделать это, но один из самых дешевых — использовать трубы для предметов, например, сделанные из олова, с модулем конвейера в ящике для дров, чтобы положить дрова в печи, а затем один бункер ниже. каждую печь в несколько труб для предметов, чтобы собрать древесный уголь. Креозот извлечь немного сложнее, но вы можете сделать это с помощью кранов Tinkers, расположенных сбоку от каждой коксовой печи, и деревянной трубы для жидкости прямо под краном. Вам нужно будет продолжать активировать их с помощью красного камня, а это значит, что вам также понадобятся часы из красного камня (для этой цели есть блок под названием Redstone Clock из Extra Utilities)."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "Railcraft:machine.alpha",
          "Count:3": 624,
          "Damage:2": 7,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 3,
          "Damage:2": 4,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "IC2:itemCellEmpty",
          "Count:3": 32,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "dreamcraft:item.CoinSmithI",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
