{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3110
    }
  },
  "questIDLow:4": 3114,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 30675,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Дальнейшая перегонка древесного угля",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Дистилляционная башня, которую вы недавно разблокировали, может принести гораздо больше результатов, чем то, что вы делали до сих пор. Если вы посмотрите на NEI, вы можете увидеть, что есть и другие жидкости, связанные с углем, рецепты которых есть в этом мульти, и сейчас самое время поработать с ними: делать все это в одноблочных ликеро-водочных заводах было бы очень расточительно.\n\nСамая важная часть получения этих жидкостей — это пиролизная печь. Если вы его еще не сделали, настоятельно рекомендуется сделать хотя бы один. Вы можете модернизировать как энергетический люк, так и катушки, используемые в нем, чтобы поддерживать его скорость со всем остальным, нет необходимости строить более одного. Помимо выполнения функции коксовой печи - превращения древесины в древесный уголь, она дает возможность выбора, какую из нескольких жидкостей она также выводит во время обработки. Большинство вариантов потенциально полезны, но при полной установке бензола предпочтение отдается побочным продуктам древесного угля, поскольку они, по сути, представляют собой законченный продукт.\n\nВНИМАНИЕ: Данная установка технически является высоковольтной, но она достаточно дорогая. Хорошо, если вы сначала перейдете на EV, прежде чем создавать это. Для прогресса в ВГ это никоим образом не требуется.\n\nПри использовании побочных продуктов древесного угля полная настройка включает в себя преобразование их в древесную смолу, древесный уксус и древесный газ, а затем преобразование всех этих продуктов в соответствующие продукты. Имея по одной башне для каждой, вы получите установку с четырьмя DT, которая в целом очень дорогая с точки зрения нержавеющей стали, но с огромной экономией по сравнению с изготовлением четырех отдельных башен. Однако имейте в виду, что не все они будут иметь одинаковую высоту. Кроме того, древесный газ не так ценен, как два других (хотя это достойный источник этилена), поэтому также хорошей идеей будет сделать 2 из 4 DT-процессов и сжечь древесный газ, чтобы получить ту небольшую мощность, которую он может обеспечить. И последнее замечание: башни действительно обрабатывают данные медленно. Если хотите, добавьте винокурни, чтобы получить конкретную продукцию."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30675,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 3,
          "Damage:2": 1126,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockcasings4",
          "Count:3": 90,
          "Damage:2": 1,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 32,
          "Damage:2": 11306,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 3,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:2": 3,
                "id:2": 35
              }
            }
          },
          "Damage:2": 6,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "dreamcraft:item.CoinTechnicianII",
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "dreamcraft:item.CoinChemistII",
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
