{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3097
    }
  },
  "questIDLow:4": 3117,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "minecraft:coal",
        "Count:3": 1,
        "Damage:2": 1,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Бензола пока нет",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Предполагается, что на этой странице книги квестов объясняется линия бензоловых генераторов, но вы, возможно, заметили, что вы еще не произвели бензол. Это потому, что путь к рецепту получения его из древесного угля имеет рецепт MV, и вы не можете просто перейти прямо к MV с небольшим количеством пара, который вы использовали в бронзовом веке.\n\nНа этой странице есть и другие пути использования возобновляемых источников энергии. У них схожие источники или один и тот же источник, но разные линии обработки, и все это выглядит как ветвь дерева с множеством разных путей, по которым вы можете пойти. Путь угарного газа является одним из примеров этого, и в будущем их будет еще много.\n\nНезависимо от того, какой путь вы выбрали для получения энергии от древесного угля, теперь вы можете комфортно поддерживать EBF и получать энергию более эффективно. На следующем уровне рекомендуется отказаться от пара, потому что вам нужно будет транспортировать слишком много его для производства хорошего количества энергии среднего напряжения. К счастью, пар вам вообще не понадобится!"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "Damage:2": 32650,
          "OreDict:8": ""
        }
      }
    }
  }
}
