{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3098
    }
  },
  "questIDLow:4": 3104,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 1159,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Пиролизная печь",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Для правильной работы некоторых установок действительно требуется место на вашей базе. Вы могли подумать об этом, когда закончили автоматизацию коксовой печи, но на этом уровне также есть вариант, который учитывает потребность в скорости, будучи просто гигантским мультиблоком: пиролизная печь.\n\nПо сути, это оригинальный крупномасштабный деревообрабатывающий станок GregTech. Это массивная конструкция, вероятно, больше, чем любой другой мультиплекс, который вы строили раньше, но в ней используются простые материалы, такие как бронза и сталь. Если вы можете просто кидать их стопками в контроллер, вы можете собрать этого монстра вместе и насладиться альтернативой усовершенствованной коксовой печи, которая имеет некоторые дополнительные преимущества. В отличие от любой другой печи, эта работает от ЕС, поэтому вам нужно направить сюда энергию для обработки древесины, которую вы в нее подаете.\n\nЧем ценен поджигатель? Вместе с углем он вырабатывает жидкость, которую вы можете перерабатывать для получения дополнительной энергии и/или побочных продуктов. Посмотрите NEI, чтобы увидеть все доступные вам альтернативы. Этот мультимодуль обычно может выдавать несколько разных жидкостей, но только по одному, в зависимости от схемы внутри него. На данный момент вам следует выбрать древесную смолу, ту же жидкость, которую вы извлекаете из древесного угля. Вы получаете небольшой постоянный бонус за постройку поджигателя, что действительно приятно.\n\nТем не менее, Pyro использует катушки аналогично EBF, и эти катушки влияют на время, необходимое для каждого рецепта: если вы используете медно-никелевые катушки, время рецепта на самом деле в 2 раза больше, чем говорит NEI! Это может быть слишком медленно для ваших нужд, поэтому обязательно проверьте, сколько древесного угля вы получаете отсюда. Змеевики Kanthal доступны в исполнении MV, в которых вместо вакуумной морозильной камеры используется охлаждающая жидкость IC2.\n\nВы также можете усилить свой поджигатель, предоставив азот. В NEI для этого есть отдельные рецепты."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1159,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:gt.blockcasingsNH",
          "Count:3": 60,
          "Damage:2": 2,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 2,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:2": 3,
                "id:2": 35
              }
            }
          },
          "Damage:2": 5,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 2,
          "Damage:2": 32641,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "dreamcraft:item.CoinChemistI",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
