{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 88
    }
  },
  "questIDLow:4": 3092,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "minecraft:sapling",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Возобновляемая энергия",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Несмотря на обнаружение нефтяных фонтанов в дикой природе, вы, возможно, подумали о расширении источника энергии, который вы использовали, чтобы достичь эпохи электричества. Пар был вашей энергией, а горючие предметы — вашим источником этой энергии, причем древесина и древесный уголь были наиболее вероятными кандидатами для автоматизации ваших первых шагов по выработке энергии. Однако сам по себе Steam — не лучший вариант для всех уровней прогресса, поэтому возникает вопрос: что еще может сделать это дерево? Именно это и объяснит эта цепочка квестов.\n\nКаждый уровень, которого вы достигнете, будет бросать вам вызов все большими потребностями в энергии. При каждом повышении уровень энергопотребления не только умножается на 4 (32 EU/t для низкого напряжения, 128 для среднего напряжения, 512 для высокого напряжения и т. д.), но также и необходимый рост ваших установок, с большим количеством шагов, и каждый из них становится более сложный. Чтобы поддерживать все это, вам может понадобиться полностью автоматизированный, бесконечный источник энергии и химикатов, чтобы справиться с развитием этой стаи. Чтобы добиться этого, вам наверняка помогут выполнение квестов в этой главе.\n\nИ последнее замечание: выходная мощность такого полностью возобновляемого источника энергии не так эффективна, как нефть, которая является ценой, которую приходится платить за возобновляемость. Вам понадобится более мощная машина для достижения той же производительности EU/t, но это все равно очень жизнеспособно и того стоит, если вы готовы пойти на этот компромисс. С другой стороны, постройка этих конструкций из дерева даст вам несколько интересных химикатов, которые можно будет использовать в более поздних поделках, химикатов, которые нефть не может создать напрямую. Вы можете выбрать один или другой путь или просто следовать обоими путями одновременно, если вам интересно. Тебе решать."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "minecraft:sapling",
          "Count:3": 4,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
