{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 160
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3141
    }
  },
  "questIDLow:4": 3109,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "BiomesOPlenty:colorizedSaplings",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Саженец Силы",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Древесина составляла большую часть вашего производства электроэнергии, и вы, возможно, даже использовали другие растения или рыбу для получения нефти. Даже если это правда, от ваших деревьев постоянно остается продукт, который все это время оставался неиспользованным: саженцы! Независимо от того, какое дерево вы решили автоматизировать, вы наверняка накапливаете саженцы, соответствующие этому дереву, поскольку с ними мало что можно сделать. Однако на этом этапе вы можете настроить достойную настройку биомассы.\n\nЧтобы уточнить, биомасса — это просто жидкость, сделанная из растительного сырья. Это не обязательно должны быть саженцы, но, скорее всего, у вас их много. Кроме того, существует несколько типов биомассы, один из них называется ферментированной биомассой, который очень похож, но отличается, и рекомендуемый вам путь, поскольку он требует меньше шагов, чем альтернативы, и приводит вас к рецепту DT. просто хорошо.\n\nПосле того, как эта технологическая линия будет завершена, у вас будет автоматизировано множество новых химикатов, которых вы не получите только из древесной смолы. Однако если вы уже обрабатываете древесный уксус, у вас будет несколько повторных результатов. Тем не менее, если вы завершите эту линию, вы получите этанол, метанол и аммиак, которые значительно упрощают процесс производства дизельного топлива с повышенным цетановым числом. Все эти линии взаимодействуют друг с другом, и вы сможете получать все большую прибыль, если автоматизируете несколько одновременно!\n\nА пока сосредоточьтесь на сборке машин, необходимых для перехода от саженцев к ферментированной биомассе. Для этого маршрута вам понадобится компрессор, пульверизатор и пиролизная печь."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 243,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 303,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1159,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
