{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 784
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1894
    },
    "2:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1740
    }
  },
  "questIDLow:4": 1654,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 32730,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "§6§lАвтоматическое включение/выключение питания",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Если у вас есть котел GT или большой двигатель внутреннего сгорания с длительным временем запуска, вы можете захотеть автоматизировать его включение/выключение для экономии топлива, поскольку дополнительная мощность или пар просто будут потеряны. Кроме того, чем больше ваш буфер Steam/EU, тем меньше времени ваши генераторы будут тратить на нагрев, что делает их более эффективными.\n\nДля этого используйте крышку контроллера машины на контроллере. Вы можете разместить его сверху, снизу или по бокам рядом с кожухом — кожухи будут передавать сигнал красного камня. Вы можете использовать паяльник и тонкую припойную проволоку, чтобы установить сильный выход красного камня блока контроллера. Если установлено значение «Сильный», он может проходить через кожух, но не через люки, шины или другие блоки. Используйте его с детектором активности, если вы хотите получать сигнал от контроллера, а не включать/выключать его с его помощью. §r\n\nС крышкой контроллера машины вы можете использовать красный камень для включения и выключения машины. Это удобно, если вы не хотите постоянно использовать мягкий молоток для отключения машины.\n \nЛучший способ сделать это — использовать защелку RS. Один вход включит машину, а другой выключит машину. Используйте компаратор, прикрепленный к клапану, для измерения уровня пара в многоблочном железном или стальном резервуаре. Инвертируйте сигнал, чтобы включить котел при низком уровне пара. Когда сигнал уровня пара высокий, выключите котел. Используйте след из красного камня, чтобы снизить уровень сигнала. Из-за прогрева котла/турбины постарайтесь установить мощность включения на уровне 30 процентов мощности, а мощность выключения примерно на 90 процентов.\n\nПровод из красного сплава будет удерживать сигнал красного камня на большем расстоянии, чем обычный красный камень, в то время как каналы из красного камня будут работать бесконечно. Вы также можете использовать усиленный красный кристалл, чтобы улучшить силу сигнала на большом расстоянии, повторяя при необходимости.\n\nВы можете использовать крышку детектора энергии в обычном режиме хранения электроэнергии (включая батареи) для контроля мощности в буфере батареи и использовать ее для включения/выключения генераторов аналогичным образом. Измените режим с помощью отвертки. Если вы используете плотный красный кристалл, он будет пропускать сигнал только на определенном уровне, что идеально подходит для автоматизации подобных вещей.\n\nОднако вы можете использовать MCC не только в генераторах, вы можете использовать их в любом мультиблоке и большинстве одиночных блоков. Это полезно для предотвращения высыпания материалов. В отличие от мультимодулей GT, которые останавливаются, если они заполнены, мультиплексы без GT аннулируют предметы или жидкости и продолжают работать, потенциально уничтожая огромное количество материалов. Вы захотите использовать их в сочетании с крышками для обнаружения жидкости или предметов на выходном люке или шине.\n\nВидеоверсию можно посмотреть в этом видео: [url]§9§nhttps://www.youtube.com/watch?v\u003djPfnifJEO64§r[/url]"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "Damage:2": 32730,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ProjRed|Integration:projectred.integration.gate",
          "Count:3": 1,
          "Damage:2": 12,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "ProjRed|Integration:projectred.integration.gate",
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "minecraft:redstone",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "ProjRed|Transmission:projectred.transmission.wire",
          "Count:3": 8,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 2,
          "Damage:2": 32734,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 2,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:4": 3,
                "id:4": 35
              }
            }
          },
          "Damage:2": 4,
          "OreDict:8": ""
        }
      }
    }
  }
}
