{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 88
    }
  },
  "questIDLow:4": 2831,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.02",
        "Count:3": 1,
        "Damage:2": 32470,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Сокрытие",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Этот квест проходит по всем обложкам, на случай, если вы забыли или они не были упомянуты. Если у них есть собственный квест, посмотрите на него для получения дополнительной информации. Вы можете разместить их практически на любом блоке GT, трубе, машине, резервуаре и т. д. Хотя это не учитывает, будет ли это работать правильно или будет полезно. Shift-Right-Click откроет графический интерфейс для многих из них. Для чехлов, размер которых можно регулировать, щелкнув отверткой по левой стороне, вы опуститесь вниз, а правую — вверх. Все чехлы защищают от дождя с той стороны, к которой они прикреплены. Обычно крышки можно регулировать с помощью отвертки, независимо от того, есть ли у них графический интерфейс или нет. Если забыли, их можно снять ломом.\n\n§lКрышки, относящиеся к жидкостям:§r\nНасос: перекачивает жидкости со скоростью, указанной в подсказке.\n\nРегулятор жидкости: регулирует скорость прохождения жидкости через него, а также ее перекачку. Может работать х/с или х/т.\n\nПаровой клапан: больше двигается, но предназначен только для пара. Переходит только на IV. Не работает в SH Steam.\n\nПереполнение: удаляет все, что превышает указанное количество в резервуаре.\n\nДетектор жидкости: излучает сигнал красного камня (RS) в зависимости от скорости заполнения жидкости в резервуаре, в котором он находится. По умолчанию пусто\u003d15, полно\u003d0. Используйте инвертированный режим для переключения. Полезно на танках и люках.\n\nEnder Fluid Link: версия с крышкой резервуаров Ender для жидкости TP вокруг. Однако не подключается к танкам Эндера.\n\nСливной модуль: защищает от дождя с этой стороны и при возможности наполняет резервуар дождевой водой. Бесполезный.\n\nЖидкостный фильтр: фильтрует жидкость, проходящую через него. Щелкните ячейку, чтобы установить ее.\n\nЗатвор: блокирует предметы/жидкости, когда активен. Используйте его с контроллером машины и RS. Визуально не отключается/блокируется. Вы размещаете его между трубами и ставите МК на эту же трубу.\n\n§lОбложки, связанные с предметами:§r\nКонвейер: отправляет предметы. Используйте канал элемента в режиме импорта или на блоке/машине GT.\n\nРука робота: отправляет данные из определенного слота машины, на которой он установлен (внутренний), в другой определенный слот в блоке рядом с ним (смежным). Продолжайте перебирать цифры, пока не поймете правильно, кажется, что они меняются для каждой машины. Если выходной слот заполнен, вывод не будет выполнен. Должен быть действительный блок со слотами для отправки, иначе настройки не сохранятся.\n\nДетектор предметов: будет излучать RS в зависимости от скорости заполнения предмета в блоке, в котором он находится. По умолчанию пустой\u003d0, полный\u003d15. Обнаруживает по заполненным слотам, поэтому не работает с супер/квантовыми сундуками. Наверное, лучше для автобусов.\n\nФильтр предметов: это незавершенная работа, которая еще не завершена. Не стесняйтесь внести свой вклад.\n\n§lОбложки, относящиеся к ЕС:§r\nДетектор энергии: излучает RS в зависимости от скорости заполнения ЕС бэтбаффа/танка, на котором он установлен. По умолчанию пустой\u003d0, полный\u003d15. Обязательно включите в него батарейки. По какой-то причине также может обнаружить пар.\n\nОбновление Power Pass: прочитайте подсказку, затем спросите Барта, как это работает, он не стал никому рассказывать. Он, вероятно, просто скажет вам, что код — лучшая документация, как и ребята из Tectech. Возможно, на самом деле работа еще не закончена.\n\nTesla Coil/Tesla Coil Rich Edition: используйте с башней Tesla для беспроводной отправки сообщений в ЕС или чего-то еще.\n\n§lДругие каверы:§r\nДетектор игроков: Обнаруживает игроков. Около 10 блоков. §4В настоящее время владелец/другой инвертируется на не-каналах из-за той или иной ошибки.§r\n\nДетектор активности: обнаруживает ход выполнения рецепта или бездействие. 0%\u003d0 RS, ~95%\u003d14 по умолчанию. В режиме ожидания значение простоя равно 15, а при работе по умолчанию — 0.\n\nКонтроллер машины: включает/выключает машину на основе RS. Отключение устройства будет отключать его независимо от состояния RS. Безопасный режим работает только на МБ. Если у MB заканчивается питание, он обычно выключается, но MC снова включит его, продолжая аннулировать данные. Вместо этого он будет переведен в состояние отключения машины. Вы также получите уведомление. §4Безопасный режим в настоящее время не работает?§r\n\nТребуется обслуживание: излучает RS, если соответствует указанному условию. Ротор\u003dтурбина?\n\nПередатчик/приемник Redstone (вход/выход): Хорошо, эти вещи сбивают с толку, поэтому слушайте внимательно. Сначала установите частоту либо с помощью графического интерфейса, либо оригинальным способом: щелкнув правой кнопкой мыши по элементу. Пустая рука \u003d 0, остальные предметы \u003d их идентификатор предмета. Будьте осторожны, чтобы случайно не сбросить его на 0. Честно говоря, просто используйте графический интерфейс. Вы можете установить для него частный или нет, это то же самое, что и EnderStorage, поэтому вы не будете передавать RS через сервер. Состояние канала \u003d уровень RS.\n\nRT(O) устанавливает состояние канала на основе уровня красного камня, отправленного извне на определенную сторону. Вы можете TP RS от этого к RR(O).\nRT(I) устанавливает состояние канала на основе уровня красного камня, который будет излучаться самой машиной. §4Всегда отправляет 15, так что это бесполезно.§r\nRR(O) выводит уровень красного камня в зависимости от состояния канала. Вы можете перенести RS из RT(O) сюда.\nRR(I) контролирует, может ли машина работать в зависимости от состояния канала, точно так же, как это делает крышка контроллера машины. Если у него 0 RS, он остается выключенным. Хоть 1 и он включается. Вы посылаете сигнал из другого места с помощью RT(O).\nRR(I) также можно использовать в сочетании с другими оболочками, состояния которых говорят об условности.\n\nIC2 Теплоотводы: немного ускоряют работу машин? Также выглядит аккуратно. TODO: кто-нибудь, пожалуйста, посмотрите на код, чтобы увидеть, что он на самом деле делает.\n\nВерстак: добавляет верстак в блок, который вы можете использовать. В основном косметический.\n\nПланки/Пластины/Фольга: Блокирует ввод-вывод на этой стороне. Используйте отвертку, чтобы установить разрешенные типы материалов. По умолчанию блокирует все. Сначала установите выход на другую сторону, чтобы избежать изменения его настроек. Вероятно, вы случайно «используете» это хотя бы один раз.\n\nКомпьютерный монитор: добавляет визуальный вид. Только косметический чехол.\n\nОбъектив: косметический чехол."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metatool.01",
          "Count:3": 1,
          "tag:10": {
            "ench:9": {
              "0:10": {
                "lvl:2": 2,
                "id:2": 16
              }
            },
            "GT.ToolStats:10": {
              "PrimaryMaterial:8": "Steel",
              "MaxDamage:4": 51200,
              "SecondaryMaterial:8": "Steel"
            }
          },
          "Damage:2": 20,
          "OreDict:8": ""
        }
      }
    }
  }
}
