{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2005
    }
  },
  "questIDLow:4": 2683,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15420,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Настройка мультиблоков TecTech",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Многие мультимодули TecTech можно настроить путем настройки определенных внутренних чисел, называемых параметрами. Для этого вам больше не нужен отдельный блок, теперь вы можете настраивать их напрямую в графическом интерфейсе.\n\nЕсли в части параметров мультиинтерфейса есть подсвеченные разделы (см. квест TecTech Multiblocks), мульти можно настроить, иначе делать нечего.\n\nВ качестве примера мы будем использовать квантовый компьютер, поскольку он, вероятно, вам нужен именно для этого.\n\nСначала нам нужно понять именование параметров, например ID:0:1:I. Первое число представляет блок параметров. Для контроля качества используется только блок 0. Каждый такой блок может иметь до 4 используемых параметров, 2 входа и 2 выхода. Буква в конце указывает, является ли параметр входом или выходом с I или O, а число в середине отличает два параметра этого типа в блоке. Это либо 0, либо 1.\n\nВходные данные либо установлены, либо используются по умолчанию. Выходы дают информацию, которую машина отправляет вам, которая указывает на вещи. (например, тепло или вычисления)\n\n§3 Возможно, вы по-прежнему захотите использовать параметризатор в блочной форме, если хотите скопировать и вставить настройки."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
