{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2006
    }
  },
  "questIDLow:4": 2730,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15465,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Лазеры решают все",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Лазерные люки — это высококлассный способ передачи большого количества ампер мощности, настолько большой, что ее ток начинается с 32 А. Это идет 32/64/96/128/256 и продолжается оттуда. Они также настолько мощны, что их поддерживают лишь несколько машин, за исключением когда-либо §wonderful§r TecTech: LSC, MEBF, MVF. и ПСС. (Может быть добавлено в будущем!) Не забудьте раскрасить лазерные вакуумные трубки, а также люки источника и цели. Кроме того, Источник \u003d Выход, Цель \u003d Вход.\n\nЛазерные преобразователи в основном представляют собой: Лазерный источник (на машине) -\u003e Вакуумные трубки -\u003e LC -\u003e 5-кратный выходной сигнал, разделенный на Х усилителей, 32 для первого. Обязательно переведите его в режим приема. Или сделайте наоборот, если хотите подняться наверх. По сути, это трансформатор, который преобразует лазер в/из кабелей. Вы также можете использовать их для включения лазеров, если вы не возражаете против трехкратных потерь на выходе устройства (и не отправки всех усилителей) по сравнению с активным трансформатором (из-за потерь на каждом выходе). Просто не забудьте поставить между ними буфер батареи, если хотите, чтобы он работал.\n\n§3Вы можете использовать лазерные трубки малой мощности, если используете люк или конвертер малой мощности, но имейте в виду, что после окраски вам придется самостоятельно соединить их с помощью кусачек.\n\n§cБудьте осторожны при использовании люков с очень высокой силой тока, поскольку каждый лазерный люк имеет максимальную мощность 1 EU/s. потери пассивной мощности в амперах."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
