{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2005
    }
  },
  "questIDLow:4": 2682,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "structurelib:item.structurelib.frontRotationTool",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Мультиблоки TecTech",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Общая функциональность мультиблока TecTech\n\nСовместимость с несколькими амперными и лазерными люками - для облегчения распределения мощности.\n\nPower Pass — позволяет подключенным люкам динамо-машины получать мощность от контроллера и выводить ее, как это делает активный трансформатор (и именно поэтому контроллер всегда нуждается в ней в своем рецепте, если эта функция включена...). §4 Обязательно отключите Power Pass, если хотите редактировать свою машину и не хотите, чтобы она взорвалась! §r\n\nSafe Void — включение этого параметра перемещает всю ЭМ (Элементальную материю, не все машины используют это) из входных и выходных люков в переливные люки. Это позволяет легче разбирать машину.\n\nКонструируемый интерфейс — позволяет визуализировать структуру с помощью чертежей (есть API для реализации этого для любого блока, но почти ничего не делает).\n\nСлева направо — 1, затем по часовой стрелке для остальных в мультиинтерфейсах TT.\n\n1) Параметры. Это способ связи контроллера с игроком и люками параметров. Индикаторы указывают состояние, но более подробную информацию можно увидеть при наведении курсора мыши. Всплывающая подсказка содержит идентификатор в форме HatchID:ParameterNumber:Direction, текущего статуса, текущего значения и краткого описания.\n\n2) Статус неопределенности. Эти 9 блоков указывают статус неопределенности машины. Если индикаторы горят, для этой машины требуется преобразователь неопределенности. Красный \u003d Плохо, Зеленый \u003d Хорошо. Прежде чем использовать машину, вам нужно решить абсурдную головоломку.\n\nКнопки управления. Кнопки могут менять свое поведение и внешний вид в зависимости от машины, но обычно они работают следующим образом, начиная сверху:\n\n3) Power Pass — включает Power Pass.\n\n4) Safe Void — включает режим Safe Void.\n\n5) Выключатель питания — мягким молотком пальцем...\n\n6) Входной слот – стандартный функционал."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 1,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
