{
  "questIDHigh:4": 8434508527125743555,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1200,
      "type:1": 1
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2610
    }
  },
  "questIDLow:4": -7251205103661839761,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.02",
        "Count:3": 1,
        "Damage:2": 16397,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Турбо-плазменная турбина XL",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Поток плазмы заставляет вращаться турбины? Нет, это просто вода в пар в воду, все переработанное внутри, 12 раз. Посмотрите квест «Паровая турбина XL» выше, чтобы получить объяснение механики, общей для всех турбин.\n\nЭта турбина, в отличие от остальных, имеет очень важные отличия от обычной мульти, о которых нужно помнить. Учитывая, что мощность плазмы так легко повысить с помощью компактных реакторов, XL Plasma Turbines придется последовать этому примеру и довести показатели ЕС прогрессии до смехотворных показателей за счет одной-единственной плазмы. Однако этот XL теперь применяет штраф EU/t к своему производству, сравнивая топливную ценность обрабатываемой плазмы с материалом ротора, который находится внутри.\n\nСм. §1§n[url]https://i.imgur.com/vifsk0P.png[/url]§r для получения информации о различных комбинациях плазмы и материалов. Плазма Mk1 выделена зеленым цветом, Mk2 - желтым и Mk3 - красным. Нижние 3 представляют собой конечную плазму термоядерных цепей.\n\nФормула немного сложна, но вот несколько важных значений:\n\n-\u003e Гелиевая плазма получает огромный штраф в 86,1% даже с Infinity Catalyst, тогда как штраф Tin составляет всего 53,5%, что означает, что количество реакторов и XL с этим материалом в два раза превышает ожидаемое количество при использовании Tin Plasma;\n-\u003e Триниум меняет эти цифры на 92,4% и 74,5% соответственно;\n-\u003e Бесконечность дополнительно увеличивает штраф до 97,4% и 91,1%;\n-\u003e Пространство-время устанавливает эти значения на 98,3% и 94,4%.\n\nЭто означает, что на этапе UHV/UEV вы больше не сможете полагаться на эти две плазмы в своих XL. Для плазмы с 1 рецептом лучшим вариантом является америциевая плазма mk3, которая имеет незначительный штраф 0,8% при использовании Infinity. Если вам нужна более быстрая выработка энергии, ознакомьтесь с полной цепочкой термоядерного синтеза, которая заканчивается небесной вольфрамовой плазмой, которая не имеет штрафов в плазменной турбине XL и имеет общее количество EU/t по сравнению со старыми гелием. Проверьте вкладку GT, чтобы найти квесты, касающиеся цепочек слияния."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:gtplusplus.blockspecialcasings.1",
          "Count:3": 392,
          "Damage:2": 4,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "miscutils:gtplusplus.blockspecialcasings.1",
          "Count:3": 30,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 12,
          "Damage:2": 30010,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31074,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
