{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 0
    }
  },
  "questIDLow:4": 1500,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "UNLOCKED",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "questbook:ItemQuestBook",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§1§lЛучшие квесты?",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Better Questing имеет ряд полезных команд для книги квестов (QB). Для их использования у вас должны быть включены читы.\n\n/bq_admin загрузка по умолчанию§r\nИспользуйте эту команду для обновления вашего QB после обновления модпака. Он перезагружает базу данных квестов из файла. В вашем файле сохранения хранится версия QB, которая может отличаться от версии в файле.\n\n/bq_admin редактировать\nВключает редактирование квестов. Нажатие ПКМ на квесте откроет контекстное меню, чтобы поделиться им или скопировать его идентификатор.\n\n/bq_admin сбросить все \u003cPlayer\u003e§r\nСбрасывает все квесты. Используйте это, если хотите начать заново или редактируете QB. Вам также следует указать игрока, если это сервер, в противном случае вы можете пропустить эту часть.\n\n/bq_admin сброс \u003cID\u003e \u003cPlayer\u003e§r\nСбрасывает конкретный квест, определенный идентификатором квеста. Иногда может быть проще перейти в «Режим редактирования» \u003e «Инструмент дизайнера», чтобы указать, что нужно сбросить.\n\n/bq_admin Complete \u003cномер\u003e \u003cИгрок\u003e§r\nВыполняет определенный квест, аналогично приведенному выше. Вы все еще можете претендовать на награды. Используйте эту команду, если квест не выполнен, а затем сообщите об этом на GitHub§r, но проверьте, не сообщалось ли об этом уже.\n\n/bq_admin сохранение по умолчанию§r\nСохраняет изменения в QB после его редактирования.\n\nЕсли вы хотите синхронизировать квесты с кем-то из вашей группы, используйте это. Однако за это они не получат никакого вознаграждения.\n\n/bq_admin хардкор§r\nВключает хардкорный режим BQ3. Вы начинаете только с 3 жизнями, так что удачи. Дополнительные жизненные сердечки доступны на вкладке «Убить все вещи».\n\nПомимо квестов типа потребления, квест засчитывается всем членам группы, если один человек его завершил. Однако, если кто-то присоединился к вашей группе позже, вам необходимо сначала ввести его в курс дела либо через /bq_copyquests выше, либо вручную. В противном случае выполнение вашего квеста не будет для них засчитано, поскольку для них не выполнены требования этого квеста.\n\nЕсли в вашем одиночном мире не включены читы, перейдите на экран ESC, откройте локальную сеть и включите читы. Это делает невозможным приостановку до перезагрузки. Если у вас есть сервер, вы можете запускать команды в командной строке без «/». Вы также можете отредактировать файл level.dat и установить для параметраallowCommands значение 1, но перед этим обязательно сделайте резервную копию своего мира.\n\n§4Чтобы квесты сохранялись правильно, при запуске игры вы должны быть онлайн и войти в свою учетную запись Mojang. Извините, это ограничение Better Questing.§r"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "minecraft:writable_book",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
