{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 721
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1511
    }
  },
  "questIDLow:4": 2415,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "witchery:ingredient",
        "Count:3": 1,
        "Damage:2": 106,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Приносим биом вам",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Так что, возможно, вы не можете найти болото или тропический лес для своих сельскохозяйственных культур или пчел, или, может быть, они слишком далеко, и до них неудобно добираться, или, может быть, ваша база находится в более холодном климате, и вам придется иметь дело с постоянно вой лютоволков. Вместо того, чтобы собирать все свои вещи и переезжать куда-то еще, почему бы не попробовать сменить биом? В этом модпаке есть несколько способов сделать это:\n\nИспользуйте Чародейского Земного Реформатора из Witching Gadgets.\n-Требуются электрические цепи, вольфрамовая сталь, ракетный уровень III.\n-Также требуется Infusion, Void Metal (достаточное искривление), Energized Node для CV, много эссенции.\n-16 радиус блока\n-Можно изменить только несколько определенных биомов Vanilla или Thaumcraft.\n-Как-то медленно\n\nИспользуйте Ритуал трансформации Гайи из Магии крови.\n-Требуется Пустотный металл, Настой, Вольфрамовая сталь.\n-Требуется углубиться в БМ (и связанный с ним варп)\n-Требуется 1 000 000 LP, Мастер-сфера крови, Алтарь 4-го уровня и Пробужденный кристалл активации.\n-10 радиус блока, может быть точно указан с помощью кирпичей кровавого камня (любого типа)\n-Невозможно указать, какой биом вы получаете, вы можете только изменить температуру/влажность в диапазоне 0,0–2,0 и надеяться\n-Некоторые биомы могут быть невозможны из-за ограниченного диапазона и перекрытия.\n- Отрегулируйте температуру/влажность с помощью предметов на 8 постаментах вокруг главного ритуального камня.\n-Нужно перелогиниться, чтобы увидеть изменения\n-Очень мало документации или объяснений\n-Быстрый\n\nИспользуйте отвар смены времен года из Witchery.\n-Маленький радиус действия, зависит от уровня заварки (мощность, а не степень рассеивания)\n-Биом можно точно указать\n-Создано с использованием сложной специальной системы заваривания.\n-Можно добавлять разные ингредиенты, чтобы изменить вкус напитка.\n-В мин меняется один блок\n-Максимальный радиус около 3 блоков (круговой)\n-Мгновенный (как только вы его используете)\n\nИспользуйте Обряд смены времен года из Witchery.\n-Для винокурни требуется нержавеющая сталь, скипетр Великого дерева или лучше.\n-Тебе придется сделать кучу колдовских вещей.\n-Не сложно, если сделаешь это один раз.\n-Чрезвычайно большой радиус действия, радиус блока 16/32/48 (круговой).\n-Биом можно точно указать\n-Иногда происходит сбой в определенных фрагментах\n-Очень быстро\n\nЕсли вы хотите узнать, как использовать методы Ведьмака, перейдите на вкладку «Смотри по краям», чтобы продолжить.\n\n"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
