{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3218,
      "type:1": 1
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3240
    },
    "2:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2588,
      "type:1": 1
    }
  },
  "questIDLow:4": 3219,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings5",
        "Count:3": 1,
        "Damage:2": 13,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lОбновление вечной катушки",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "За пределами пространства-времени, за пределами реальности. Вы заглянули в то, чего никогда не существовало, и превратили в жидкость, а затем в твердое тело. Ситуация стабилизировалась, несмотря ни на что. Когда вы смотрите на него, вам кажется, что вы могли бы держать в своих руках всю вселенную.\n\nВ прошлом вы могли объединить почти все материалы в один посредством Вечной Сингулярности, бесконечно плотного образца Вселенной. Однако автоматизация этого в масштабах DTPF оказалась нелепой, что вообще остановило бы ваш прогресс, если бы не открытие Энергизированного Тессеракта. Чтобы физически проявить само пространство-время, вам сначала нужно было проявить четвертое пространственное измерение, и это и есть Тессеракт: четырехмерный куб.\n\nКубики! Почти все вокруг вас сделано из кубиков. Вы лишь мельком увидели реальность четырехмерного мира, но вы успешно использовали его для конденсации пространства-времени, которое можно произвольно сформовать в полную Вечную смесь - процесс, который, к сожалению, невозможно повернуть вспять. Излишне говорить, что живых цепей будет недостаточно для поддержания бесконечно плотного, бесконечно стабильного и многомерного материала.\n\nНа данный момент финальное обновление с 13501К. Это действительно сделает ваш DTPF сияющим!"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockcasings5",
          "Count:3": 16,
          "Damage:2": 13,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
