{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 213
    }
  },
  "questIDLow:4": 3142,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 12792,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lБолее быстрый урожай",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "§WДобро пожаловать на мою лекцию, сегодня мы говорим о §6§lэкстремальной промышленной теплице.\n§rЭто самая передовая и §l§nLAG FREE§r ферма, которая позволит вам производить необходимое количество чая.\nМашина стартует с §5EV§r, но для выращивания урожая IC2 вам понадобится мощность не ниже §dLuV§r.\nЧтобы увидеть структуру, поместите контроллер на землю и используйте для построения голограмму структуры.\nСтеклянный уровень ограничивает энергетический уровень до §3UV§r. Со стеклом §3UV§r вы можете иметь настолько высокий уровень энергопотребления, насколько захотите.\nНажмите кнопку Shift с помощью отвертки, чтобы изменить тип культуры (IC2/обычный), к сожалению, вы не можете обрабатывать обе культуры на одной машине.\nСуществует 3 режима управления посевами (изменяются с помощью отвертки):\n\n§lРежим настройки (вход):\n§rВ этом режиме вы можете сажать урожай в машину.\nПросто вставьте их во входную шину и включите машину мягким молотком.\nКроме того, вам необходимо вставить блок, необходимый для роста урожая IC2 (если есть)\nКогда автобус пуст, просто отключите его и измените режим.\nИмейте в виду, что количество слотов для ваших культур ограничено в зависимости от напряжения.\nПри обычном урожае вы начинаете с 1 слота, который умножается на 2 каждый уровень после §5EV§r, каждый слот может занять 64 урожая одного и того же типа.\nПри обрезке IC2 вы начинаете с 4 слотов, и это число умножается на 4 за каждый уровень после §dLuV§r, каждый слот может занять только 1 обрезку.\n\n§lРежим настройки (вывод):\n§rЭтот режим позволяет вам переместить теплицу или улучшить урожай.\nКогда машина работает в этом режиме, она выводит все посаженные культуры на выходную шину.\n\n§lНормальная работа:\n§rПри нормальных культурах это простой процесс. Базовое время обработки составляет 5 секунд, в конце операции все культуры выращиваются и выходные данные добавляются в выходную шину. Кроме того, время уменьшается с каждым уровнем после §5EV§r §o (время делится на количество уровней после §6HV§r§o, минимум 1 секунда. ВАУ) §r\n\nС другой стороны, обрезка IC2 не так проста. Они нормально моделируются, но ускоряются в 32 раза. Время процесса 5 секунд. Проверить ход процесса выращивания можно с помощью трикодера.\n\nЕсли вы хотите вырастить урожай еще быстрее, вы можете использовать удобрение (до §1400% больше капель§r!). Машина будет принимать удобрения из входных шин в начале операции и будет применяться только для этой операции. Каждое удобрение дает 200% на урожай в обычном режиме или 10% в режиме IC2. Бонус применяется равномерно к посевам. Примеры:\nОбычный режим, 3 семени пшеницы, 1 семя чая, вы вставляете 1 удобрение, вы получите 150% капель пшеницы и 50% капель чая.\nРежим IC2, 16 мешков с семенами дыни, вы вставляете 64 удобрения, вы получаете 40% капель.\n\nКроме того, всем вашим культурам для роста нужна вода. Каждая культура выпивает 1000 л за операцию. Например, если вы посадили 576 семян чая при напряжении §3UV§r, вам потребуется 576000 л в секунду.\n\n§lПоследние примечания:\n§rАнимацию нельзя отключить.\nЛампы можно переворачивать.\nГрязь надо вспахивать.\nЕсли у вас возникнут какие-либо проблемы или у вас есть какие-либо предложения, откройте вопрос на github и отправьте сообщение §l@kuba6000§r.\nЭтот МБ был создан для выращивания чая, потому что я этого хотел."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockcasings4",
          "Count:3": 76,
          "Damage:2": 1,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ProjRed|Illumination:projectred.illumination.lamp",
          "Count:3": 9,
          "Damage:2": 10,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "RandomThings:fertilizedDirt",
          "Count:3": 8,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12792,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinFarmerIII",
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "kubatech:kubaitems",
          "Count:3": 1,
          "tag:10": {
            "orig_meta:3": 3,
            "orig_id:8": "kubatech:kubaitems"
          },
          "Damage:2": 3,
          "OreDict:8": ""
        }
      }
    }
  }
}
