{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 35
    }
  },
  "questIDLow:4": 1146,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 5123,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§2§lТрубы в стиле GT6",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Хотите знать, почему новые трубы не всегда подключаются автоматически? Это было изменено, чтобы сделать трубы умнее. Теперь вы можете использовать гаечный ключ для соединения только тех труб, которые вам нужны. Вам больше не нужна пластина или фольга, чтобы предотвратить соединение труб. Трубы по-прежнему будут автоматически соединяться, если вы встроите одну в другую.\n\nТрубы, по которым передается что-либо горячее определенной температуры, например пар, нанесут урон игроку, прикасающемуся к ним. Возможно, вы захотите накрыть горячие трубы, чтобы не пораниться. Кроме того, если уровень тепла превышает теплоемкость трубы, она расплавится.\n\nНажатие ПКМ на трубе в центре «сетки» активирует или отключит соединение. Через него будет отмечен X, если соединение включено. Вы можете сделать то же самое с любым из 4 углов, чтобы отрегулировать противоположную сторону. Вы можете аналогичным образом соединить каждую из 4 сторон, щелкнув ближайший квадрат в сетке.\n\nТрубы имеют свободный встроенный затвор для уменьшения расплескивания. Shift-ПКМ с гаечным ключом на той стороне, которую вы хотите предотвратить ввод.\n\nТрубы пытаются передать половину своей пропускной способности дважды в секунду, то есть в сумме получается полная пропускная способность в секунду.\n\nБольшие или огромные трубы для жидкости могут быть резервуаром для хранения бедняков, вмещающим в себя большие объемы жидкости.\n\nДля выводов машин, включая котлы и резервуары для воды Railcraft, сделанные из сайдинга для резервуаров для воды, насосы не потребуются. В других резервуарах для перемещения жидкостей потребуются насосы или краны Tinker's Construct.\n\nВы также можете надеть на трубу покрытия, такие как дубовые доски или пластины GT. Обычно это предотвращает соединения в этом направлении, но вы можете использовать отвертку, чтобы разрешить соединения. Это позволяет создавать трубы, которые красиво проходят сквозь стены. Используйте лом, чтобы снять крышки."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 6,
          "Damage:2": 17300,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "allowCraftedFromStatistics:1": 0,
      "allowSmelt:1": 1,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "allowCraft:1": 1,
      "allowAnvil:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 5123,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:crafting"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IronChest:woodIronUpgrade",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 8,
          "Damage:2": 11300,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
