{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 93
    }
  },
  "questIDLow:4": 546,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "BuildCraft|Energy:blockOil",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§5§lЗдравствуйте, барон, как ваше черное золото сегодня?",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Во время ваших путешествий вы, возможно, видели огромные нефтяные фонтаны. Пришло время сделать насос и отправиться собирать это черное золото в резервуары. Нефть можно сжигать непосредственно в генераторе сгорания (возможно, для питания насоса на месте?) или перерабатывать для получения лучшего топлива и материалов для крафта.\n\nВозьмите с собой генератор или буферную батарею (разумеется, с полностью заряженными батареями) для питания насоса. Благодаря развитию технологий насос может автоматически выдавать максимальную производительность. Объединение нескольких насосов позволяет им работать быстрее. В этом случае масло необходимо удалить со дна штабеля с помощью крышки насоса или других средств, например, трубопровода.\n\nВ более высоких изливах содержится больше масла. Но для насоса низкого давления лучше использовать короткие изливы, если это возможно, поскольку у него недостаточно радиуса действия, чтобы полностью собрать более крупные изливы в горизонтальном диапазоне. Сохраните более высокие выпускные патрубки для насосов среднего или высокого напряжения.\n\nДля перекачки нефти необходимы шахтные трубы, так же, как и автошахтер. Когда он достигнет дна (или чего-то на пути), если жидкости для сбора не останется, он начнет втягивать трубы. То же самое, если отключить его мягким молотком. Вы также можете изменить диапазон с помощью отвертки, если есть причина сделать это, например, быстрее собирать лаву на ограниченной территории.\n\nЭто машины класса GT, поэтому не забудьте защитить их (и их источники энергии!) от дождя со всех сторон. И установите путевую точку с помощью JourneyMaps, чтобы не забыть, где вы ее поставили!\n\n§3Как только у вас закончится нефть на поверхности, вы захотите обратиться к:\n1) Руда нефтеносных песков, хотя она лучше подходит для производства тяжелой нефти.\n2) Приготовление масла из поленьев в пиролизной печи.\n4) Бактериальный чан (EV)\n5) Культуры\n6) Пчелы\n7) Подземная (ПНГ) нефть. Размеры обычно содержат несколько жидкостей, доступ к которым можно получить с помощью многоблочной версии насоса, доступной в исполнении MV."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1140,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "IC2:blockMiningPipe",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "BuildCraft|Factory:tankBlock",
          "Count:3": 4,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "minecraft:bucket",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
