{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3180
    }
  },
  "questIDLow:4": 3182,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 12791,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Высокотемпературный суперразмножитель",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Слышали ли вы о галечных реакторах? На стороне энергогенерации этой ветки есть квест на другой, Ториевый высокотемпературный реактор, но это другой мультиблок.\n\nОн называется высокотемпературным реактором с газовым охлаждением (HTGR), он использует топливные камешки и потребляет энергию. Однако на самом деле он не обеспечивает большой мощности и даже не соответствует EU/t другой версии, несмотря на то, что он намного дороже. Многоблочная структура в основном та же самая: огромный реактор размером примерно 12x12x12 блоков с 500 корпусами, изготовленными из европия. Однако то, что он не дает в силе, он компенсирует в разведении.\n\nДля неосведомленных это дорого. Галечные реакторы работают, наполняя реактор полностью галькой, и тогда реакция будет продолжаться, по сути, вечно. В этом случае у вас будет полностью автоматизированный источник почти бесконечного лютеция, плутония и других вещей, которые будут объяснены в следующих квестах, наряду с производством топлива и переработкой продукции. Это означает, что это дорогой мультиблок, но он помещен на уровень, на котором эти затраты действительно разумны, если есть необходимость в огромном, бесконечном размножении множества выходов.\n\nЕсли вы сомневаетесь в том, чтобы построить это, проверьте следующие квесты, чтобы узнать больше о топливе и результатах.\n\nПримечания:\n\nHTGR имеет внутренний буфер для топлива и требуется только одна входная шина (подойдет любая), а также только одна выходная шина (реактор автоматически сжимает каждые 64 сгоревших гранулы в один шар, поэтому вам нужно 6 слотов или больше, чтобы избежать проблем с мочеиспускание на полную мощность).\n\nРеактору для работы требуется только 72 тыс. камешков из 720 000, но работа на минимальной мощности означает, что вы не получите никаких бонусов, таких как сокращение времени приготовления и большее количество камешков, обрабатываемых за цикл.\n\nВо время работы этот мультимодуль потребляет ток 1 А LuV, независимо от того, сколько камешков находится внутри, но во время работы он также генерирует горячую охлаждающую жидкость. Если вы используете его для выработки электроэнергии, вы получите больше ЕС, чем потребляет реактор.\n\nВ этом реакторе производительность увеличивается с увеличением количества положенных в него камешков.\n\nНабрав HTGR в NEI, вы сможете увидеть все элементы, относящиеся к этому мультиблоку."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockcasings8",
          "Count:3": 531,
          "Damage:2": 5,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12791,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianIII",
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "kubatech:kubaitems",
          "Count:3": 1,
          "Damage:2": 7,
          "OreDict:8": ""
        }
      }
    }
  }
}
