{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 88
    }
  },
  "questIDLow:4": 2858,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:itemCellEmpty",
        "Count:3": 1,
        "Damage:2": 1,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§5§lЖидкий ввод-вывод машинного интерфейса",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Благодаря неустанной работе разработчиков теперь вы можете использовать ячейки для ввода-вывода жидкостей прямо из интерфейса машин GT. Просто нажмите на жидкость, удерживая ячейку или другой контейнер с жидкостью.\n\nМоменты, которые следует учитывать:\n1) Щелкните левой кнопкой мыши, чтобы попытаться заполнить/опорожнить все контейнеры с жидкостью, находящиеся под курсором.\n2) Щелкните правой кнопкой мыши, чтобы попытаться заполнить или опорожнить один контейнер с жидкостью, наведенный на курсор.\n3) Поддерживаются все контейнеры с жидкостью, которые можно использовать в стандартном резервуаре GT (например, супербаки или резервуары X напряжения), включая, помимо прочего: бутылки с водой, ванильные ведра, элементы ic2 (универсальные и обычные), мерные колбы, большие жидкостные ячейки, резервуары для жидкости под давлением и т. д.\n4) Может заполнять/забирать менее одной ячейки (1000 л или 144 л в расплавленном состоянии) жидкости, если контейнер для жидкости поддерживает это.\n5) Он не будет проверять, подходит ли эта жидкость для машины/рецепта, имейте это в виду.\n6) Не работает со спиртами Crops, не стесняйтесь кодировать совместимость для нас.\n7) Танки EIO необходимо сначала разместить и подобрать, прежде чем их можно будет использовать."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "IC2:itemCellEmpty",
          "Count:3": 8,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
