{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2123
    }
  },
  "questIDLow:4": 1115,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "minecraft:book",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Руководство Морона по лучшим деревьям",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Лесные деревья имеют множество признаков. Как только вы получите дерево с полезным атрибутом, вы сможете скрещивать этот атрибут с другими породами деревьев. Таким образом, вы сможете получить идеальное дерево, сочетающее в себе все нужные вам атрибуты, включая тип плода! вы также можете извлечь гены с помощью Gendustry, если умеете создавать машины.\n\n§4Пожалуйста, занимайтесь разведением деревьев в помещении или под землей, потому что бабочки вызывают задержку.§r\n\nИмейте в виду, что для квестов вам нужно будет выводить вид «чистый», а не гибрид. Вероятно, вам следует сохранить скрещивание до тех пор, пока вы не получите все хорошие.\n\nДля более быстрого размножения деревьев огородите свои деревья так, чтобы бабочки не могли убежать, и разводите пчел с лучшими характеристиками по площади и скорости опыления. Также есть рамки, если вы можете себе это позволить. Сито также может помочь, если вы хотите сделать это точнее, если вы можете сделать альвеарий. Вам нужны либо пчелы, либо бабочки, деревья не будут опылять друг друга. §р\n\nДеревья обладают следующими характеристиками:\n§eСаженцы/Плодородие§r: шанс получить саженец из уничтоженного листа. Хорошо подходит для переработки в биомассу или других целей. Бальза, Крыжовник и Свитгам – это то, что вам нужно.\n\nШанс выпадения аллелей\nСамый низкий 1%\nНиже 2,5%\nНизкая 3,5%\nВ среднем 5%\nВысокий 10%\n\n§cСозревание/Созревание§r: скорость роста саженца в дерево. Важно, если вы планируете сразу вырубать его на бревна. Золотая малина самая быстрая.\n\nАллель Время\nСамый медленный 10\nМедленнее 7\nМедленно 5\nВ среднем 4\nБыстро 3\nБыстрее 2\nСамый быстрый?\n\n§dHeight§r: контролирует высоту роста дерева. Гигантская секвойя — лучшая, хотя она может быть немного слишком большой.\n\nЗначение аллеля\nНаименьшие 25%\nМеньше 50%\nМалый 75%\nВ среднем 100%\nБольшой 125%\nБольше 150%\nКрупнейшие 175%\nГигантский БОЛЬШОЙ\n\n§bGirth§r: ширина вашего дерева. У более широких деревьев больше листьев и бревен, но для начала роста им также потребуется больше саженцев. Все саженцы должны быть одного вида и обхвата. Саженец в северо-западном углу определяет характеристики нового дерева, и именно здесь необходимо применять костную муку, чтобы дерево выросло. Гигантская Секвойя и здесь лучше всего.\n\nАллель/Размер\n2х2\n3х3\n4х4\n\nУрожайность: шансы получить плод из уничтоженного листа. Садовое яблоко и перец чили здесь лучшие.\n\nШанс выпадения аллелей\nСамый низкий 2,5%\nНижние 5%\nНизкая 10%\nВ среднем 20%\nВысокий 30%\nВыше    ?%\n\n§6Сочность§r: количество биомассы, которую саженец производит в лесном ферментере. Вы можете повысить производительность ферментера, используя мед или фруктовый сок. Blue Mahoe и Red Maple — лучшие. NEI не показывает рецепты анализируемых саженцев и, возможно, гибридов тоже в ферментере.§r\n\nАллель Лесная Биомасса\nСамые низкие 100 МБ\nНижние 200 МБ\nНизкий 300 МБ\nВ среднем 400 МБ\nВысокий 600 МБ\n\n§4Огнестойкость§r: применяется к древесине. Такое есть только у Побережья и Гигантской Секвойи.\n\n§7Эффект§r: не используется в деревьях, поэтому ни для одного из них установлено значение None.\n\nНиже приведена дополнительная информация о некоторых других параметрах:\n\n§2Рост§r: деревья Сипири имеют Тропический цвет вместо Света, их можно выращивать только в биоме с температурой 90%-190% и влажностью 90%-200%, и они могут расти только при температуре 120%-190% и 90%- 200% влажность. Всем остальным деревьям просто нужен свет, чтобы расти.\n\n§3Территория/Почва§r: все деревья имеют средний показатель, что бы это ни значило. Вероятно, что-то связанное с приведенным ниже, что никогда не использовалось.\n\n§eТолерирует§r: можно ли его сажать на песок или нет. Такое есть только у пустынной акации и баобаба Грандидье. Характеристика — Равнины или Равнины, Пустыня.\n\n§5Опоры§r: какие плоды теоретически могут быть. Определяется видом. Дерево может производить только плоды из семейств, перечисленных под этим признаком, независимо от того, что указано под признаком «Фрукты». В моде Extra Trees есть несколько деревьев, которые поддерживают все 4 типа, но ни одно из самого Forestry.\n\n§aFruit§r: определяет, какие фрукты или орехи он производит. Каждый фрукт/орех имеет разные преимущества:\nСлива и алыча производят только 100 л фруктового сока, но имеют 60% шанс произвести мульчу в экстракторе или соковыжималке.\nПапайя производит 600 л фруктового сока, но имеет только 10% шанс произвести мульчу.\nКокосы производят 300 литров масла из семян, но имеют только 25% шанс произвести мульчу.\nИспользуйте лесную мультиферму, чтобы вам не приходилось ломать блок листьев, чтобы получить фрукты/орехи. Установите режим «Ручной сад» и сначала разместите все.\n\n§bСемейство§r: сообщает, к какому семейству фруктов относится признак «Фрукты»: семечковые, чернослив, орехи или джунгли."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "minecraft:writable_book",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
