{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 77
    }
  },
  "questIDLow:4": 1853,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "minecraft:book",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lРуководство Морона по эффективному EBFing",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Добро пожаловать в новейшее руководство для идиотов «Эффективное EBFing»! В этом руководстве описаны распространенные проблемы, возникающие при использовании доменной электропечи GregTech 1000.\n\nНастраивать\nПри настройке EBF обязательно размещайте его в нескольких шагах от объектов, на которые влияет загрязнение, например, от сельскохозяйственных угодий. Загрязнение никому не друг!\n\nВо время установки убедитесь, что центр EBF является полым. Иногда предметы могут проникнуть туда незаметно, как световой шар Thaumcraft!\n\nУбедитесь, что глушитель обращен к §lout§r, а не §lin§r. EBF не сможет работать, если не будет распространять эти восхитительные запахи!\n\nПри размещении люков электропитания обязательно сведите к минимуму расстояние между любыми генераторами и EBF. Эти несколько блоков имеют большое значение, особенно в LV! Каждый ампер энергии, проходящей по кабелю, теряет немного — а вам понадобится столько, сколько сможете! Лучше всего разместить два генератора рядом с каждым люком с кабелем на 2 А. Если вы бедны, вы можете использовать 2 аккумуляторных буфера, каждый из которых прикреплен непосредственно к каждому люку. Обязательно заправьте генераторы буферов. Если вы создадите аккумуляторные буферы с 9 слотами, вы можете со временем заполнить их, чтобы продлить время работы, пока не получите стабильное питание.\n\nВыходные люки и автобусы автоматически задвигаются в танки и инвентарь, расположенный рядом с ними, например сундуки или баки БК. Они также опустеют, если будут полны, поэтому следите за ними!\n\nПри строительстве нескольких EBF доменная печь GregTech 1000 может иметь общие стены. Это также поможет вам сэкономить на входных и выходных люках. Не рекомендуется для энергетических и ремонтных люков!"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 8,
          "Damage:2": 2305,
          "OreDict:8": ""
        }
      }
    }
  }
}
