{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 36
    }
  },
  "questIDLow:4": 718,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:blockCrop",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Руководство Морона по плодовитым фермам",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Если вы когда-нибудь хотели узнать, как работает селекция сельскохозяйственных культур, вы попали по адресу! Получите немного урожая - то есть палки - и немного семян, возделывая их мотыгой или мотыгой. Вы также можете разместить некоторые растения и ягоды прямо на палочках. Хорошие растения для начала — цветы, пшеница, кактус и сахарный тростник.\n\nСоздайте с помощью инструмента участок сельскохозяйственной земли и поместите воду в середину. А пока сделайте участки 3x1, разделенные рядом земли или булыжника. Вы хотите иметь возможность видеть центр каждого столбца графиков 3x1 одновременно, например:\nФФФддФФФ\nдддффффддд\nФФФддФФФ\nдддффффддд\nФФФдВдФФФ\nдддффффддд\nФФФддФФФ\nдддффффддд\nФФФддФФФ\nТеперь поместите палочки для урожая в каждый конец участка 3х1. Затем поместите семена на палочки и немного подождите.\n\nКогда они почти полностью вырастут, вы можете поставить двойные палочки для обрезки в центральные места, еще раз используя палочки для обрезки уже размещенных палочек. В этой центральной зоне теперь можно выращивать новые культуры, даже новые виды.\n\nЕсли повезет, вы можете получить новое неизвестное семя, которое можно будет отсканировать позже.\n\nСорняки необходимо удалять совком или лопатой, иначе ваше поле зарастет ими.\n\nИспользовать графики 3x1 легко и не требует особых усилий. Проверяйте их каждые 5–10 минут, чтобы удалить сорняки и собрать новые семена. Если вы забудете, вы потеряете только одно или два семени.\n\nЕсли вы найдете действительно хорошее семя, вы можете сделать участки 3х3 или 5х5, поместив хорошее семя посередине, а другие рядом с ним для скрещивания. Но для этого потребуется больше присмотра за детьми, поскольку сорняки могут уничтожить все поле.\n\nОбратите внимание, что чем больше культур рядом с двойной палкой, тем быстрее появятся новые растения, очевидно, до 4. Это также способ получить новые версии одного и того же растения, вы не можете сделать это только с одним родителем, как Agricraft.\n\nНе оставляйте новые посевы на этих интенсивных полях. Вытащите их и, надеюсь, получите мешочек с семенами. Посадите семена с низкими показателями на производственные поля, которые не требуют присмотра за детьми. Сохраняйте семена с высокими показателями для большего количества скрещиваний.\n\nСкрещивание происходит, когда два или более почти созревших урожая находятся рядом с двойной палочкой. Высока вероятность получить тот же вид, что и родители. Остальное время будет мутацией. Для получения более подробной информации ознакомьтесь с квестом IC2 Cropnalyzer."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "IC2:blockCrop",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "minecraft:wheat_seeds",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "minecraft:reeds",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "minecraft:carrot",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "minecraft:potato",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IC2:blockCrop",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "minecraft:carrot",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "minecraft:dye",
          "Count:3": 16,
          "Damage:2": 3,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 51,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinFarmer",
          "Count:3": 15,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
