{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 70
    }
  },
  "questIDLow:4": 2161,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "chisel:warningSign",
        "Count:3": 1,
        "Damage:2": 7,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§3§lБезопасность превыше всего",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Для новичков в GregTech вот несколько советов и предупреждений об электричестве.\n\nМашины не любят находиться под дождем и могут вызвать пожар поблизости. Пожары рядом с машиной имеют случайный шанс взрыва. Кроме того, подача более высокого напряжения, чем уровень машины, приводит к взрыву. Или несколько, если собирать вещи вместе, как многие люди. Однако отправка большего количества ампер, чем может использовать машина, ничему не повредит.\n\nПодача слишком высокого напряжения или слишком большого количества ампер по кабелю приведет к возгоранию кабеля и возникновению пожара, что может привести к взрыву машины. Убедитесь, что количество ампер, подаваемых в кабель генераторами и буферами, не превышает ток, который он способен выдержать.\n\nГенератор, выдающий ток 1 А, может питать несколько машин, если их рецепты требуют напряжения меньше полного. Например, измельчителям, перерабатывающим руду, требуется всего 2 EU/т, поэтому вы можете запустить несколько из них от одного генератора на 1 А, если провода не слишком длинные. Почему это имеет значение? Потому что потери есть для каждого усилителя для каждого блока, указанного на проводе/кабеле. Обратите внимание, что кабели лучше, чем провода. Но будь осторожен! Иногда для рецепта требуется гораздо больше ЕС, чем вы ожидаете, например, рецепт мацерационного песка -\u003e кварцевой пыли.\n\nБольшинство машин используют только 1А, однако есть исключения, такие как дуговая печь, термическая центрифуга, мировые ускорители и машины УУМ. Обратите внимание, что машины могут принимать больше усилителей, чем они используют (обычно 2), чтобы пополнить запас энергии, особенно если они не получили большую часть усилителя из-за потери (в основном проблема в низковольтном режиме). Формула: (EU/t рецепта * 2) / напряжение уровня 1. Имейте это в виду при выборе кабелей.\n\nНекоторые машины специально предназначены для того, чтобы помочь вам справиться с несколькими усилителями, например, с аккумуляторными буферами, трансформаторами и диодами. Чтобы узнать больше об этом, перейдите на вкладку квестов «Сохранение и преобразование ЕС».\n\nЕсли вы хотите передать больше усилителей, используйте кабель большего размера или сверхпроводник (MV, но ULV и LV имеют свои собственные кабели без потерь). Вы можете использовать лазерные люки гораздо позже, чтобы отправить еще больше. Есть даже беспроводные варианты, но не сейчас.\n\nОдноблочная машина, лишенная ЕС, возобновит прогресс, но не потеряет предметы рецепта. Многоблочная машина потеряет элементы.\n\nОбратите внимание, что любой блок, излучающий EU, при этом имеет потери: 2 ^ (уровень-1) на ампер. Итак, 1 ЭУ на НН, 2 ЭУ на СН и так далее. Таким образом, использование большого количества аккумуляторных буферов подряд приводит к очень расточительному использованию энергии. Вы должны быть осторожны с потерями при создании своего первого EBF позже в LV, может быть, лучше запитать их напрямую? Конечно, если вы хотите, чтобы ваши усилители были заряжены на больших расстояниях, вам придется время от времени размещать BB, чтобы «пополнить» усилители, хотя по мере дальнейшего прохождения игры это становится менее значимым, поскольку потери становятся меньше. есть о чем беспокоиться.\n\nЕсли этой информации вам недостаточно, перейдите по ссылке §1§n[url]https://gtnh.miraheze.org/wiki/Electricity[/url]§r, чтобы узнать больше."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "miscutils:itemHatTinFoil",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
