{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 531
    }
  },
  "questIDLow:4": 767,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 2102,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§5§lАнализ почвы",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Устали искать руду вручную? Хотите найти подземную нефть, которой хватит надолго? Сейсморазведчик расскажет вам о рудах в окружающих кусках в (своего рода) удобной книге, которую вы можете прочитать, а также о подземных жидкостях под вами. Ему не требуется питание.§r\n\nЧтобы определить, какой тип жидкости находится в куске, вам нужно просканировать почву, щелкнув правой кнопкой мыши по усовершенствованному сейсмическому разведчику с 2 бочками с порохом, 4 ячейками глицерилтринитата, 8 iTNT или 16 TNT. Этот не взрывает пользователя при использовании. Функции! Обязательно подождите несколько секунд после размещения старателя, прежде чем применять взрывчатку. В противном случае §4Бум!§r Для OW существует четыре типа нефти или природного газа. См. квест в советах и ​​подсказках, как только вы сделаете нефтяную буровую установку.\n\n1) Щелкните правой кнопкой мыши по взрывчатке.\n2) Используйте Data Stick, чтобы извлечь данные, щелкнув по ним правой кнопкой мыши после завершения анимации.\n3) Затем вам нужно поместить карту данных в сканер GT для ее анализа.\n4) Поместите карту с проанализированными данными в нижний правый слот принтера, добавьте 3 листа бумаги в верхний левый слот и убедитесь, что в нем содержится не менее 144 л чернил кальмара.\n5) Возьмите распечатанные страницы и соедините их с куском кожи в сборочной машине, залитой не менее 20 мб рафинированного клея.\n\nТАДА! Теперь у вас есть книга с подробной информацией о сканированных вами фрагментах.\n\nМестоположение руд указано в центре куска. Руды, которые являются маргинальными в этом куске, могут быть найдены не в центре, а на краю. Посмотрите, где расположены руды, и определите центр жилы. На более высоких уровнях он сканирует больше кусков руды. Если вы просто хотите узнать о жидкостях, используйте версию нижнего уровня, чтобы книга не была такой длинной.\n\nКаждое подземное месторождение жидкости имеет размер 8х8 кусков. Это начинается с 0,0 и продолжается на протяжении 8 кусков на востоке и юге, содержащих 64 куска. Однако не во всех полях что-либо есть. В пределах поля сумма может варьироваться /- 25 процентов. Сумма, указанная в книге, представляет собой минимальную и максимальную сумму для каждого поля по всем фрагментам поля. Изыскатель сообщает о полях 3x3 (например, 9 полей размером 8x8) на всех уровнях, включая центральное поле, где расположен сейсморазведчик. Скорость извлечения жидкости зависит от многих факторов, подробности смотрите в вики. В общем, все, что выше 300, действительно хорошо. Общая сумма в куске сложна."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 2102,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 4,
          "Damage:2": 32708,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockreinforced",
          "Count:3": 64,
          "Damage:2": 5,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
