{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 88
    }
  },
  "questIDLow:4": 2143,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "BiblioCraft:BiblioLamp",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§5§lВыбор, выбор",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Нужна карта выбора топлива? Ну, у нас этого нет, но у нас есть предложения. Вы можете использовать Steam до IV, но за пределами MV это становится довольно болезненно.\n\nВ LV вы можете начать переработку нефти для получения легкого топлива для генератора сгорания или нефтеперерабатывающего газа для газовой турбины. Или вы можете использовать креозот в полужидком генераторе.\n\nКак только вы нажмете MV, вы сможете переключиться с пара на возобновляемый бензол (газ) из своих журналов. Другими возобновляемыми альтернативами являются биодизельное топливо на основе рыбьего жира или растительного масла (сгорание). Масло семян можно получить из арахиса Пэм, рапса IC2 или орехов лесных деревьев.\n\nВ MV вы также можете улучшить свое легкое топливо до тяжелого топлива, чтобы получить дизельное топливо. Когда вы достигнете HV, превратите дизельное или биодизельное топливо в дизельное топливо с повышенным цетановым числом. В EV вы можете сделать HOG, но это сложно, и вам придется перенастроить всю установку для перегонки нефти, поскольку в ней используются другие жидкости, чем в цетане.\n\nEV представляет большую газовую турбину, большую паровую турбину, большую паровую турбину высокого давления и большой двигатель внутреннего сгорания, которые являются более эффективными версиями предыдущих. Первые 3 требуют турбин.\n\nВы также можете создавать ядерное оружие или кинетику ветра и воды.\n\nДля операций с низким энергопотреблением или для преданных игроков, желающих настроить автокрафт, вы можете начать использовать солнечные панели в MV."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
