{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 280
    }
  },
  "questIDLow:4": 2412,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "ExtraUtilities:dark_portal",
        "Count:3": 1,
        "Damage:2": 2,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Ген ХХХХХХХХ...",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Да! Да! Глаза! Теперь вы понимаете, все слишком ясно! Земля богатства, она ваша! Но что это такое? Оно пустое? Почему, куда делись твои богатства? Единственный житель говорит вам, что все эти вещи давно исчезли, с приближением Конца Времен... Но это просто означает, что вы все-таки находитесь в правильном МЕСТЕ! Вы просто не в то ВРЕМЯ. Если просто немного настроить портал, то можно прибыть в нужное МЕСТО и ВРЕМЯ, чтобы получить заслуженное Богатство. Вы подозреваете, что такая корректировка потребует чего-то сильного... БЕСКОНЕЧНО сильного.\n\nА пока у вас теперь есть очень-очень большой чулан, в котором можно хранить свои вещи, когда старый владелец... уедет. Уходя, вы замечаете крошечного Гаста, наверняка это всего лишь ваше воображение? К сожалению, сдвиг времени приводит к тому, что, когда вы уходите, вы, скорее всего, окажетесь в дикой местности. (Выход через портал отправляет вас обратно в мир возрождения)\n\nЧтобы построить машину, которая доставит вас в нужное место и время, вам придется засучить рукава и дойти до самых пределов технологического мастерства, которые вы только можете себе представить. (см. вкладку «Цели в финале», когда будете готовы)"
    }
  },
  "tasks:9": {
    "0:10": {
      "visible:1": 0,
      "invert:1": 0,
      "range:3": -1,
      "index:3": 0,
      "structure:8": "",
      "hideInfo:1": 0,
      "posX:3": 0,
      "posY:3": 0,
      "posZ:3": 0,
      "biome:3": -1,
      "name:8": "The End of Time",
      "dimension:3": 112,
      "taxiCabDist:1": 0,
      "taskID:8": "bq_standard:location"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 10,
          "OreDict:8": ""
        }
      }
    }
  }
}
