{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1148
    }
  },
  "questIDLow:4": 2971,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 17000,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Бесконечное хранилище энергии",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Не стоит переходить по ссылкам от незнакомцев! Хотя это звучит как кликбейт, это правда. С определенной точки зрения.\n\nИспользуйте (потенциальную) силу! И таким образом хранить энергию. Просто постройте плотину и затопите обширные территории водой. Вы можете добавить энергию в свое хранилище, закачав в него больше воды, или просто слить ее обратно в энергию, когда вам нужно. Это особенно хорошо работает с нестабильными источниками энергии, такими как ветер, вода и солнце. Или вы сбрасываете в него лишнюю энергию, чтобы использовать ее в другой раз. Вместимость огромна, и выбор за вами.\n\nЗвучит здорово! Но...? - Действительно. Есть одна загвоздка: насосы и турбины будут иметь потери, коррелирующие с эффективностью. Все еще заинтересован? Приступим к рукоделию!\n\nМультиблок имеет необычную форму: спинка открыта. Озеро будет появляться внутри мультиблока и распространяться блок за блоком настолько, насколько это возможно/позволено. Он заменит растения, как воду (обязательно защитите свои посевы IC2!), но не заменит твердые блоки. Дополнительно можно указать лимиты в любом направлении. Вода НИКОГДА не выйдет за эти пределы. Вы можете установить эти ограничения во втором графическом интерфейсе, щелкнув правой кнопкой мыши по контроллеру с помощью отвертки.\n\nКогда вы вводите предел, он корректируется до ближайшего допустимого значения. Особенно, если вы попытаетесь выйти за пределы сервера. Вы можете уговорить своего администратора повысить эти ограничения (эти ограничения предназначены для ограничения гриферства). Далее, вода не способна распространиться в чужие города.\nВы также найдете 3 волшебные кнопки в правом верхнем углу этого графического интерфейса. Слева направо: первый медленно исчезнет из озерных блоков. Вы можете использовать это, чтобы уменьшить озеро, если оно, например, распространилось за барьер. Мультиблок также будет инициализироваться с этой конфигурацией, чтобы избежать случайного переполнения. Вторая и третья кнопки будут постепенно создавать больше блоков озера. Кроме того, вторая кнопка сделает эти блоки озера розовыми, чтобы вы видели, где они находятся, и могли затыкать дыры и тому подобное. В этом «отладочном» режиме вы можете ходить/дышать/действовать в озере, как в воздухе. Это должно облегчить создание затонувшей деревни для декоративных целей. Третья кнопка предназначена для обычных операций, поэтому вы можете видеть воду и наслаждаться плаванием в своем энергетическом буфере.\n\nКонечно, есть и обычный графический интерфейс (простой щелчок правой кнопкой мыши). Он показывает вам энергию, запасенную в плотине. Чтобы достичь более высокого уровня воды, вам необходимо использовать более мощные насосы. Для этой цели вы можете настроить уровень напряжения графического пользовательского интерфейса с помощью схемы в слоте схемы. Не волнуйтесь: это только оптический сигнал. Вы не сможете аннулировать энергию, если установите уровень низкого напряжения. Это только для информации об игроке. Вы можете попробовать, получив заработанное вознаграждение...\n\nЕсли у вас есть дополнительные вопросы, вы нашли недостающую информацию или у вас есть предложения, не стесняйтесь писать в официальном Discord GT New Horizons. Пожалуйста, добавьте @SinTh0r4s к своему сообщению, чтобы я его увидел.\n\n§4 Предупреждение: было много упоминаний об ошибках и даже искажениях мира, вызванных Гидроплотиной. Используйте на свой риск. Если у вас есть более подробная информация, сообщите об этих проблемах на github GTNH."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 17000,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 51,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 61,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 2,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockconcretes",
          "Count:3": 89,
          "Damage:2": 8,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "3:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 3,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "structurelib:item.structurelib.constructableTrigger",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 16,
          "Damage:2": 5133,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.integrated_circuit",
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 5,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianI",
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
