{
  "questIDHigh:4": 1020064013494797697,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1224
    }
  },
  "questIDLow:4": -7126666155324853443,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15314,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Беспроводное питание!?",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Вам надоело, что вокруг вашей базы проложены кабели? Вы устали от необходимости постоянно обновлять кабели, чтобы выдерживать разную силу тока? Вы поклонник молний, ​​проносящихся вокруг вашей базы?\n\nТогда этот мультиблок для вас: Telsa Tower отличается высокой выходной силой тока и полной поддержкой энергетического люка TecTech с этим мощным мультиблоком.\n\nДля начала вам нужно будет заполнить башню конденсаторами, соответствующими уровню первичных обмоток Тесла в батарее конденсаторов. Обмотка Теслы определяет уровень мощности, на которой башня передает мощность, а количество конденсаторов определяет максимальную силу тока, которая может быть выведена.\n\nВсего в одну батарею конденсаторов можно поместить 16 конденсаторов, поэтому в зависимости от ваших потребностей в мощности вам может понадобиться несколько батарей.\n\nПосле того как башня будет построена, откройте контроллер, чтобы настроить максимальное расстояние передачи башни в соответствии с потребностями вашей базы. Настройка дальности в настоящее время некорректна, что означает, что, по крайней мере, на данный момент вы можете сделать это без необходимости использования плазмы. Эта опция называется «Настройка радиуса перемещения башен Tesla».\n\nТеперь, когда ваша башня настроена, как вы сможете подавать от нее электроэнергию на свои машины? Что ж, я рад, что вы спросили. Чтобы подать питание на машины базы, вам нужно будет использовать крышки катушек Тесла. Размещайте их на своих машинах, энергетических люках и даже трансформаторах, чтобы получать энергию, текущую из башни. Однако энергетические люки немного привередливы, и им нравится быть обращенным вверх, чтобы получать энергию.\n\n§4Внимание! Башня Тесла будет выдавать только один уровень усилителя, такой как EV, IV и т. д. При обновлении первичных обмоток Тесла обязательно проверьте, что все крышки катушек и приемопередатчики в базе могут выдерживать повышенную мощность. Несоблюдение этого требования приведет к взрыву машины.\n\nНевыключение контроллера перед регулировкой также может привести к взрыву."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 15314,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 15452,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "tectech:gt.blockcasingsBA0",
          "Count:3": 12,
          "Damage:2": 8,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "tectech:gt.blockcasingsBA0",
          "Count:3": 128,
          "Damage:2": 7,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "tectech:gt.blockcasingsBA0",
          "Count:3": 17,
          "Damage:2": 6,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 12,
          "Damage:2": 4124,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "tectech:item.tm.teslaCover",
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
