{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2659
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2675
    },
    "2:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2696
    }
  },
  "questIDLow:4": 2679,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "OR",
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemCellMutatedLivingSolder",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Пайка больше не работает",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "После всех этих достижений кажется, что некоторым вещам просто не суждено быть. Каждая машина, созданная на вашей сборочной линии, работает, но самые продвинутые из них кажутся... немного грубоватыми. Дальнейшая проверка показала, что Indalloy недостаточно хорош. Кажется, что нескончаемые вибрации Infinity дестабилизируют соединения, где происходит пайка, ваши живые схемы оказывают сопротивление этому грубому припою, однако это происходит...\n\nВполне вероятно, что новые материалы полностью лишат Indalloy способности спаивать детали. По этой причине пришло время для нового развития этой технологии, и предыдущее отвержение вашими живыми контурами дало вам прекрасную идею. Любой новый материал может иметь какое-то новое поведение, которое испортит вам сборку, но что, если припой сам узнает об этих сложностях и научится приспосабливаться к ним, мутируя под них?\n\nПравильно: §aМутировавший живой припой§r.\n\nТакая химия возможна только на полномасштабном химическом заводе, оснащенном самым современным корпусом: Ботмиум. Вдобавок ко всему, катализатор, который вам нужно использовать, был израсходован настолько тщательно, что вы были вынуждены использовать для него Бесконечность поверх мутирующей Наквадрии. Ваша Бесконечность все равно будет потеряна для крафта, если только вам не удастся разместить на своем химическом заводе §9Оболочки из вольфрамовой стали§1§r и §4Пробужденные дракониевые змеевики§r, которые предотвращают потерю прочности катализатора. Любые более качественные катушки также имеют тот же эффект.\n\nНовый припой — это отдельная история. Технология влажного ПО слишком примитивна для этого, и ваши биоячейки отказались связываться с какой-либо жидкостью, которая могла бы служить носителем для пайки. Когда вы попробовали смесь горячего олова и висмута, это, наконец, сработало, но пайка на самом деле не сработала. Похоже, биоклетки не научились выполнять свою новую работу, которую можно было исправить, добавив в качестве подопытного образец материала, что-нибудь попроще, например, катализатор бесконечности... но казалось невозможным связать клетки с пылью. Вам нужно больше энергии... не просто куча ЕС, а что-то концентрированное, горячее, шипящее энергией!\n\nДа, все живое погибло мгновенно, когда вы решили вместо горячих жидкостей добавить плазму. Ничего удивительного. Однако биоклетки выживали внутри горячих жидкостей, поэтому нам просто нужен некоторый контроль температуры и некоторое разделение между клеткой и плазмой... да, для этого можно использовать Gravi Stars. Нам все еще необходимо охладить плазму, чтобы улучшенные клетки могли смешиваться с ней в жидкой форме, а один ЕС был бы слишком дорогим. Gelid Cryotheum оказался на удивление эффективным, возможно, из-за своего происхождения как компонента живого существа Blizz.\n\nВот и все! Мутировавший живой припой готов. Высокоинтеллектуальные биоячейки питаются энергией концентрированного тепла плазмы, сохраняя при этом расстояние от них из-за влияния Звезд Грави, и они анализируют пыль катализатора бесконечности, чтобы узнать о нестабильности материала. Это очень медленный процесс, но он происходит одновременно с медленным охлаждением плазмы с помощью криотеума и ЕС, пока процесс обучения не завершится и биоклетки не попадут в олово и висмут, теперь в жидкой форме, которая была раньше было показано, что работает. Наконец, вооружившись новыми знаниями, клетки проходят через усиленный Infinity катализатор на основе Naquadria, чтобы они могли мутировать в реальном времени после исследования материала, который они паяют.\n\nЭто должно подойти для любой будущей пайки, независимо от материала. Будем на это надеяться, по крайней мере..."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemCellMutatedLivingSolder",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "index:3": 2,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
