{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2616
    }
  },
  "questIDLow:4": 2648,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "GalaxySpace:item.Tier8Rocket",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Последний рубеж?",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Последний из нормальной ракетной прогрессии. После этого есть только Mothership для системы Т9 и Deep Dark, у которого руды больше.\n\nХотя вы получаете доступ к шести новым планетам, новых жил только две. И не жалуйтесь, что Барнарда должен быть Барнардом, мы этого не исправим.\n\nСистема Барнарды находится на северо-северо-западе, и вы можете посетить Барнаду C, E и F.\nСистема α Центавра находится на северо-востоке, и вы можете увидеть α Центавра Bb (Проксима Центавра недоступна для посещения). §3Не забудьте надеть скафандр!§r\nСистема Тау Кита находится на юго-югом юго-западе, и вы можете посетить обитаемую планету Тау Кита E.\nСистема Вега находится на ЗСЗ, и вы можете посетить планету Вега Б.\n\nНовые жилы — это кадмий и самарий. Руды представлены кадмием, цезием, церием, лантаном, неодимом, самарием и тартаритом.\n\nВы можете получить Пробужденный Драконий из небольших руд на Барнарде E, Барнарде F, Тау Кита E и Веге B.\nВы можете получить бедрокий из небольших руд на Барнарде F.\nВы можете получить Катализатор Бесконечности из небольших руд на Веге Б.\n\nВ дополнение к планетарным рудам и блокам возьмите немного саженцев Барнарды C и грязи, чтобы вы могли вырастить еще немного, если они вам понадобятся для Радокса (смеется). Вы также можете взять еще несколько осколков неизвестного кристалла из лежащих поблизости радужных кристаллов.\n\nЧто еще более важно, вы должны собирать морские водоросли с Тау Кита E. Они нужны вам для создания схем UEV, и хотя вы тоже можете их сделать, для начала вам нужно немного. Однако неизвестная жидкость для их выращивания обнаружена в озерах и под землей на Барнарде C."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
