{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1747
    }
  },
  "questIDLow:4": 1761,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.02",
        "Count:3": 1,
        "Damage:2": 32000,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Привет, мир!",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Перво-наперво, давайте установим OpenOS на компьютер, чтобы вам не всегда нужен был диск в приводе. Введите «install», а затем введите «Y», когда вас спросят, хотите ли вы установить OpenOS.\n\nЗакончив, извлеките диск, бросьте его на стену и перезагрузите компьютер.\n\nВведите «df», чтобы отобразить все существующие файловые системы и точки монтирования, вы заметите одну с именем OpenOS; это имя вашего жесткого диска по умолчанию после установки ОС.\n\nДавайте изменим его с помощью «label -a OpenOS HDD», «-a» проверяет имена, начинающиеся с того, что вы вводите после него с помощью этой команды. §3\u003c-- видимо, что-то из этого неверно? Спасибо за отсутствие билета, объясняющее, какую часть, ребята.§r\n\nА теперь ради интереса, давайте сделаем вашу первую программу! Как насчет чего-нибудь функционального, сделайте «Редактировать запуск», это приведет вас на страницу редактирования новой программы под названием «Запуск». Давайте просто сделаем что-нибудь простое: «print(«Hello World!»)», как будто это никогда не устареет.\n\nТеперь нажмите Ctrl S, чтобы сохранить, и Ctrl W, чтобы выйти из этого экрана. Вернувшись в свой домашний корень, давайте теперь наберем автозапуск, и вы увидите сообщение «Hello World!» аккуратно, да?\n\nДавайте теперь заставим запуск работать при запуске. Введите «edit .shrc». .shrc — это мистический файл, который запускает команды оболочки при загрузке вашего компьютера. Итак, в .shrc введите «startup», сохраните и перезагрузите компьютер. Теперь должно быть написано «Hello World!» при запуске. Вдвойне аккуратно, правда?"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.02",
          "Count:3": 1,
          "Damage:2": 32002,
          "OreDict:8": ""
        }
      }
    }
  }
}
