{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 65
    }
  },
  "questIDLow:4": 3294,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "catwalks:scaffold",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Подиумы",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Мод Catwalks добавляет несколько косметических блоков для украшения вашей фабрики.\n\nЛеса и строительные леса полезны для строительства в воздухе, прежде чем вы получите доступ к полету. По ним можно подниматься, как по лестнице, и они мгновенно ломаются при ударе. Вы также не упадете с них, если отпустите клавиши движения во время лазания. Если вы щелкнете правой кнопкой мыши по Лесу строителя со сплошным блоком, леса будут заменены этим блоком.\n\nПодиумы могут соединяться друг с другом, образуя широкий проход. Вы можете украсить их, прикрепив предупреждающую ленту или веревочные фонари, последние обеспечивают тусклое освещение.\n\nЛестницы с клетками дают вам возможность передвигаться вверх и вниз без риска упасть. Подниматься по ним намного быстрее, чем по ванильным лестницам.\n\nОпорные колонны носят чисто декоративный характер. Они соединяются друг с другом во всех направлениях. Они также работают как лестницы.\n\nПрочные рельсы позволяют пропускать вагонетки через пропасти без опор. Щелкните правой кнопкой мыши по прочному рельсу с электроприводом с помощью паяльной лампы, чтобы обеспечить его постоянное питание; вам не нужен факел из красного камня. Если у вас недостаточно отвлекающих факторов, используйте их, чтобы построить американские горки!\n\nПаяльная лампа позволяет убрать перила или даже пол с подиума, щелкнув правой кнопкой мыши. Используйте его, чтобы открыть проход и выйти на подиум, или если вы не знаете, что такое «нарушение OSHA». Ту же функцию можно выполнить с помощью гаечного ключа, совместимого с GT или Forge, поэтому вам на самом деле это делать не нужно."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "catwalks:blowtorch",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "catwalks:scaffold",
          "Count:3": 4,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "catwalks:catwalk_unlit",
          "Count:3": 6,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "catwalks:cagedLadder_north_unlit",
          "Count:3": 6,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 16,
          "Damage:2": 11305,
          "OreDict:8": ""
        }
      }
    }
  }
}
