{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2477
    }
  },
  "questIDLow:4": 3250,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "ae2fc:fluid_discretizer",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Создание жидкости AE2",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Ну-ну-ну, что у нас тут? Колбы теперь излишни? НИ ЗА ЧТО!\nВ любом случае, хотя вы можете слушать тех, кто клянется, что колбы — это *дерьмо* и *единственный способ* автоматизировать создание жидкостей и AL, вы можете использовать этот мощный аддон, который был портирован для GTNH.\n\nИтак, что вам нужно, чтобы эта интересная штука заработала?\nКаждой ME-системе необходим дискретизатор жидкости. Это позволяет создавать по требованию. Хотя вы можете использовать AE2FC без дискретизатора жидкости для перемещения жидкостей, для автокрафта вам понадобится дискретизатор.\n\nТогда вам также понадобится терминал для жидкости или терминал для обработки жидкости для сборочной линии.\n\nСоздавая узоры, вы заметите, что жидкости размещаются так, как если бы они были предметами.\nГотовые узоры будут выглядеть синеватыми. Размещение их в двойном интерфейсе позволит AE2 перемещать как жидкости, так и предметы. Примечание. Сначала отправляются жидкости, затем предметы.\nВы можете переключить двойной интерфейс в правом верхнем углу, если хотите, чтобы жидкости оставались на складе.\n\nЕсли вы используете синий шаблон (жидкий шаблон) в обычном интерфейсе, AE2 отправит жидкость в виде пакета жидкости. Это просто представление жидкости как предмета. Декодер жидкости может превратить ее обратно в жидкость и сохранить в сетке жидкости.\n\nВы можете использовать буфер ингредиентов (большой или обычный), чтобы ваши предметы и жидкости, отправленные по шаблону, могли храниться внутри в одном блоке. Обычный буфер может содержать 9 элементов и 4 жидкости, тогда как большой — 27 элементов и 7 жидкостей.\nВы можете использовать его для автоматизации мультиблоков, например, с трубопроводами для предметов и жидкостей.\n\nЕсли вы хотите автоматизировать отдельные блоки, это так же просто, как съесть шоколадный торт во время диеты:\nСоздайте шаблон, создайте интерфейс, и готово!\nОн автоматически добавит жидкость в запас жидкости одноблочной машины.\n\nАвтоматизация сборочной линии тоже не так уж и плоха. Он повторяет старые настройки колб, но заменяет резервуары декодерами жидкостей и шиной хранения жидкостей для подачи жидкостей. Кроме того, можно сначала отправить жидкости, а затем предметы, используя кнопку приоритета на терминале обработки жидкостей. Обязательно предоставьте декодерам собственные подсети в ME. Если вам нужна более подробная информация, посетите вики:\n\n§3Мод Extra Cells был удален. Все старые компоненты и элементы были преобразованы в детали AE2 и AE2FC, где это возможно."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "ae2fc:fluid_discretizer",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ae2fc:fluid_interface",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "ae2fc:part_fluid_pattern_terminal",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "ae2fc:ingredient_buffer",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "ae2fc:fluid_storage16",
          "Count:3": 1,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ae2fc:part_fluid_import",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "ae2fc:part_fluid_export",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
