{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 860
    }
  },
  "questIDLow:4": 2548,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "appliedenergistics2:item.ItemViewCell",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Разные предметы AE",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Есть несколько предметов AE, которые не особенно полезны, но, вероятно, заслуживают упоминания, поэтому вот они:\n\nРезервуары Certus: они вмещают 32B, портативны и просты в изготовлении.\n\nПросмотр ячейки: форматирование в Cell Workbench для фильтрации того, что вы видите в терминале (когда они в нем установлены)\n\nКварцевые режущие ножи Цертуса/Нижнего мира: щелкните правой кнопкой мыши, чтобы открыть интерфейс. Поместите железный слиток в слот и выберите имя. Пресс можно использовать в Inscriber для нанесения надписей без использования наковальни. Вы также можете переименовывать p2p-туннели и интерфейсы в мире с помощью ножа.\n\nБлок-контейнер ME: вмещает только один тип элементов, но объёмом 64 КБ. Можно разместить предмет в мире или заменить его в области 1x1 или 3x3. Замененные блоки будут выброшены в мир. Это будет горизонтально или вертикально, в зависимости от того, какую сторону блока вы выберете. Удерживая клавишу Shift, щелкните правой кнопкой мыши по воздуху, чтобы изменить режим, щелкните правой кнопкой мыши по блоку, чтобы активировать режим.\n\nЗаряженный кварцевый светильник: излучает свет того же уровня, что и факел, но более изысканный.\n\nСветочувствительный прибор: излучает сигнал красного камня в зависимости от света. Поскольку он начинается только с 7, он не так полезен, как датчик освещенности.\n\nОбновление ME (уровень 1/2/3): если вы являетесь сотрудником OC, вы можете сделать 3 обновления, чтобы добавить доступ к вашей сети для роботов и дронов.\nT1: 0,5 диапазона точки доступа\nT2: Нормальный диапазон точки доступа\nT3: Неограниченный диапазон, любая яркость\n\nМанипулятор энтропии: превращает траву/землю/сухую землю друг в друга или вызывает пожар. Или растапливает лед. Бесполезный.\n\nПушка материи: стреляет шарами материи, созданными в конденсаторе материи. Поместите его в сундук ME или диск и поместите предметы в терминал для заполнения. Полагаю, прилично? Но он разрушает блоки каждый раз, когда вы его используете, так что... Ну, я думаю, вы могли бы использовать его с пейнтбольными шарами?\n\nАппликатор цвета: используйте красящие предметы или шарики с краской (более эффективно), чтобы покрасить вещи. Вы можете покрасить кабели или что-нибудь совместимое с Forge, например шерсть или стекло. Размещайте внутри предметы, например Материйную Пушку. Вы можете переключать цвета, удерживая клавишу Shift и щелкая правой кнопкой мыши или прокручивая колесо мыши. Если вы используете снежки, вместо этого можно удалить краску. Вы также можете использовать его в дозаторе.\n\nМорж: Это морж, чего ты ожидал?"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
