{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1231
    }
  },
  "questIDLow:4": 940,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 1172,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lЧистое помещение",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Если вы хотите создавать более совершенные (и более дешевые!) схемы, вам понадобится чистое помещение. Чистое помещение представляет собой мультиблок размером от 3х4х3 до 15х15х15 (ШхВхД). Основание не обязательно должно быть квадратным, подойдет прямоугольная форма, если она симметрична относительно центра. Помимо блоков пласкрета для всех краев, вам понадобится контроллер в центре вверху, кожухи машины fFilter для остальной части верха, кроме краев, энергетический люк и люк для обслуживания. Вам также понадобится усиленная дверь или какой-либо другой способ входа и выхода, а также корпуса машин или диоды, если вы хотите автоматизировать это. Дверца, корпуса машин и диоды не являются обязательными. Вы можете использовать корпуса машин для ввода энергии, ввода и вывода предметов. Уровень не влияет на передачу предметов, поэтому используйте для этого самые дешевые.\n\nДавайте построим комнату 5х5х5. Развернуть его по вертикали легко, или вы можете сделать его шире и длиннее, если X и Z совпадают и являются нечетными. Примерно 5% пласкретовых блоков можно заменить армированным стеклом, чтобы можно было видеть чистое помещение и проверять машины. Некоторые другие стекла, такие как боросиликатное стекло или защищенное стекло, могут использоваться в еще более высоких процентных количествах.\n\nВы можете передавать материалы через стены, используя корпуса машин. Вы также можете передать мощность 1 А, используя корпус машины, или использовать диоды для пропускания нескольких усилителей.\n\nПросто будьте очень осторожны при переходе на более высокое напряжение. Обязательно снимите корпуса машины и диоды и замените их новым уровнем мощности, иначе вам будет очень грустно. Вам не нужно делать это для тех, которые вы используете только для передачи предметов.\n\nЕсли в чистой комнате есть проблемы с обслуживанием, у нее будет шанс аннулировать рецепты, требующие чистой комнаты (10% за каждую проблему с обслуживанием!). Контролируйте свое чистое помещение с помощью ручного сканера, промышленной информационной панели или использования крышки, требующей технического обслуживания, а также фонаря с питанием от красного камня или сигнализации Howler.\n\nКроме того, чем дольше открыта дверь или чистое помещение выключено, тем ниже будет эффективность, что напрямую связано с потерей рецептуры. Поэтому открывайте дверь как можно реже и следите за тем, чтобы чистое помещение работало! Однако есть способы обойти дверь. С лифтом или дорожным якорем вам никогда не придется открывать дверь или даже использовать ее в конструкции! Вы даже можете использовать блок лифта или дорожный якорь в качестве напольного блока, чтобы аккуратно интегрировать его.\n\nЭнергопотребление этого мультиблока немного необычно. Она начинается с 40 евро/т, а затем постепенно снижается. Но даже когда он потребляет 40 евро/т (обычно это среднее напряжение), одного энергетического люка низкого напряжения достаточно. Просто имейте в виду, что это делает чистые помещения исключением, а не правилом.\n\n§3Мультиблоки, такие как LCR, LPF или PA, считаются чистыми помещениями, поэтому нет необходимости объединять их в одно. Вы не можете использовать биолабораторию в PA, поэтому чистая комната вам все равно понадобится позже.\n\nДругие полезные советы включают в себя: использование беспроводного разъема для AE или трансвекторного интерфейса для пропуска корпусов машин, а также то, что вы можете использовать энергетические люки более высокого уровня для более быстрого достижения 100% эффективности (не используется больше энергии один раз при 100%).\n\n§4Имейте в виду, что в чистом помещении нельзя использовать ничего, что вызывает загрязнение, иначе оно выйдет из строя."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "minecraft:stone_pressure_plate",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "IC2:itemDoorAlloy",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 90,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 41,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 2,
          "Damage:2": 11,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12635,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 2,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockreinforced",
          "Count:3": 82,
          "Damage:2": 2,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockcasings3",
          "Count:3": 8,
          "Damage:2": 11,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "3:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 3,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1172,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 2,
          "Damage:2": 6,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianII",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
