{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2856
    }
  },
  "questIDLow:4": 3030,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "structurelib:item.structurelib.constructableTrigger",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lЭксперт MB-строительства",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Щелкните правой кнопкой мыши по контроллеру во время подкрадывания, чтобы вызвать действие под названием §osurvival autoplace§r. Будет предпринята попытка построить мультиблок из предметов из вашего инвентаря, при условии, что область, которую занимает этот мультиблок, свободна от препятствий. Опять же, как и при создании голограмм, мультиблоках, которые принимают несколько типов многоуровневых компонентов или имеют переменную длину, количество MSHP, которые вы держите в руках, будет определять, какой уровень блоков будет размещен. Он разместит для вас нужное количество люков, но обычно они будут ориентированы на вас, а не перпендикулярно поверхности. Он просто разместит для вас гильзы, если у вас нет люков в инвентаре, если только это место не требует использования люка (например, верхняя центральная точка EBF).\n\nАвтозаполнение Survival также может брать из ваших альтернативных инвентарей или предметов, которые содержат инвентарь или ссылаются на него. В настоящее время сюда входят:\n- приключенческие рюкзаки, как в ношении, так и в качестве предмета в инвентаре.\n- Портативные элементы AE2\n- Сеть ME, подключенная к любому беспроводному терминалу AE2, поддерживающему доступ к объектам. поддерживает фильтрацию ячеек просмотра, потребляет энергию, требует безопасного доступа и находится в радиусе действия беспроводной сети\n- Лесные рюкзаки\n- инвентарь сундука Эндера, если у вас есть мод Ender Backpack from Backpacks. Примечание: обычные рюкзаки из мода Backpacks на данный момент НЕ поддерживаются."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
