{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2561
    }
  },
  "questIDLow:4": 2564,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:upgradeModule",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lПовышение эффективности чана!",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Глядя на рецепты Чана, вы, вероятно, разочаруетесь из-за небольшого количества жидкости, производимой по рецепту. Не волнуйся! Потребление и производство жидкости, показанные в NEI, являются лишь базовым уровнем для самой низкой эффективности. Эффективность Vat зависит от количества жидкости в выходном люке.\n\nЭффективность постепенно увеличивается по мере заполнения выходного люка и достигает максимальной эффективности, когда он заполнен практически наполовину. Если люк наполнится еще больше, эффективность снова снизится, поэтому старайтесь держать ее близкой к половине! При максимальной эффективности количество потребляемой и производимой жидкости по рецепту умножается на 1001. Предметы и культура не затрагиваются.\n\nСуществуют различные способы поддержания его на половинном уровне, в том числе OC (не SFM, он не любит жидкости BW), контроллер машины для обнаружения жидкости или регулятор жидкости, а также более нестандартные средства, такие как рамки или совместное использование блоков. Если вы выберете маршрут детектора жидкости, помните, что использование выходного люка большего размера облегчит поддержание его заполненным почти наполовину."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
