{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 396
    }
  },
  "questIDLow:4": 397,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "DraconicEvolution:dragonHeart",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Нужен еще больший вызов?",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Вы уже несколько раз прошли большую часть пакета? Может быть, вы даже создали Звездные врата? Или вы просто ищете что-то немного другое? Не волнуйтесь, у нас есть для вас несколько вариантов:\n\n- Играйте в режиме Хардкор. Либо Minecraft Hardcore, либо BetterQuesting Hardcore. Последнее немного более снисходительно. Возможно, это кажется невозможным, но люди действительно достигли UEV в Minecraft Hardcore. Лучше будьте готовы перезапустить несколько раз. Это явно не для всех.\n\n- Никогда не делайте ракету. Так называемый §ono-rocket run§r к настоящему времени частично поддерживается, вы сможете делать практически все, что есть в пакете. Используйте пчел, сельскохозяйственные культуры и метеоры магии крови в качестве основного производства ресурсов. Однако имейте в виду, что такая задача является кропотливой и медленной. Например, вам может потребоваться собрать большое количество алюминиевого гравия, чтобы получить свой первый титан. Или придется начать разведение пчел раньше, без особых технологий.\n\n- Скайблок. Да, действительно. Он также известен как Сад измельчения и является абсолютно жестоким. На самом деле поддерживаемой версии пакета Skyblock не существует, но некоторые игроки выяснили минимальное количество изменений, необходимых для его работы. Спросите или поищите на официальном канале Discord, чтобы узнать все подробности. Но не ждите никаких развлечений на этом пути.\n\n- Скоростной бег. Некоторые игроки разработали некоторые базовые правила и начали записывать скоростные пробежки к целям на ранних стадиях игры, таким как Коксовая печь. Спросите или поищите на официальном канале Discord, чтобы узнать все подробности. Может быть, вы просто хотите посмотреть, как они это делают."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "amount:3": 10,
      "rewardID:8": "bq_standard:xp",
      "isLevels:1": 1,
      "index:3": 0
    }
  }
}
