{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 0
    }
  },
  "questIDLow:4": 2874,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "UNLOCKED",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "dreamcraft:item.CoinChunkloaderTierI",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§1§lЗагрузка кусков",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Minecraft работает частями — столбцами блоков размером 16x16 от скалы до неба. Чанки в радиусе вокруг вас моделируются или, другими словами, загружаются чанками. Если чанк не загружен, в нем ничего не происходит — не растет урожай, не работают машины. Таким образом, вам нужно, чтобы ваша база была загружена частями, когда вы отправляетесь на исследование. Позже вы захотите, чтобы ваша база была загружена частями, чтобы все не взорвалось самопроизвольно, особенно многоблочные машины.\n\nЗагрузить чанк можно несколькими способами:\n\n1) Установите мод FTB Utilities и затребуйте чанки, затем установите для них загрузку чанков. При настройках по умолчанию вы не сможете требовать/загружать достаточно блоков на каждого игрока, поэтому не стесняйтесь увеличивать это число. Для этого вам нужно быть в одиночной игре (SP) или иметь собственный сервер.\n\n2) Используйте четыре типа якорей из Railcraft, хотя их невозможно изготовить до уровня низкого напряжения (LV). В SP или на сервере, который вы используете, обманите административные якоря, чтобы загружать фрагменты навсегда и бесплатно. Они ограничены на серверах, чтобы предотвратить падение TPS из-за того, что люди вечно загружают базу частями, даже когда их там нет. На чиновниках вам нужно использовать фрагменты Эндера, жемчуг Эндера или монеты, чтобы подпитывать их. Посмотрите подсказку на каждом, как долго он будет работать и в каком чанклоадере.\n\n3) Используйте Chunkloader от GT. Для этого вам понадобится ЕС.\n\n4) Используйте один из блоков, который загружается чанками. Если вы сделаете это на сервере, ожидайте, что администраторы, возможно, очень разозлятся на вас, если вам не разрешено это делать. То же самое и с ванильными методами.\n\nНе используйте кусочки курицы, чтобы получить блоки, похожие на якоря. Это глючит."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "minecraft:cookie",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
