{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 160
    }
  },
  "questIDLow:4": 2408,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "StorageDrawers:controller",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§9§lУправление ящиками",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Теперь, когда у вас есть цепи среднего напряжения и нержавеющая сталь, вы можете сделать невероятно удобный контроллер выдвижного ящика. Этот блок создаст любые ящики, к которым он подключается, в радиусе 4 блоков (включая ось Y) и максимум 50 блоков как часть мультиблока, который позволяет хранить (и извлекать при правильной настройке) любой из блоков, которые составляют это вверх. Это позволит вам гораздо проще сбросить содержимое вашей поездки по добыче полезных ископаемых в систему хранения. Просто удерживайте правый щелчок на передней панели контроллера в течение секунды или двух, и все элементы, соответствующие тому, что уже находится в мультиблоке, будут помещены на хранение, а ваши инструменты и тому подобное — нет. Просто не забудьте разместить контроллер последним, чтобы он зарегистрировал все ящики.\n\nВы можете подавать в контроллер (и, следовательно, в остальные ящики) любой трубопровод или эквивалент бункера. Если вы используете его как часть мультифермы или моб-фермы, обязательно установите содержимое ящиков и заприте их на ключ, чтобы все хранилось правильно и организованно. Если содержимое ящиков не задано, оно начнет заполняться, начиная с ближайших. Если вы хотите, чтобы предметами было заполнено более одного ящика, поместите пустое улучшение в ящик дальше от контроллера, и оно заполнит первый, затем второй.\n\nЕсли вы хотите обходить углы, используйте ящики обрезки, чтобы расширить мультиблок. Если вы хотите иметь вторую точку для сброса элементов, используйте подчиненный контроллер (по одному на мультиблок, только для автоматизации). Обратите внимание, что вы можете использовать клавишу на контроллере, чтобы воздействовать на все ящики одновременно.\n\nЕсли у вас есть сеть ME, разместите шину хранения данных на контроллере, и весь инвентарь будет доступен из сети, как для хранения, так и для извлечения. Просто не забудьте установить приоритет выше, чем у ваших накопителей ME. Если вы еще не заперли их, ожидайте, что все ваши ящики заполнятся случайными предметами из вашей сети ME.\n\n§4Использование контроллера ящика с большим количеством входов/выходов приведет к переполнению TPS! Если вы находитесь на сервере, не используйте ящики-кубы, иначе ожидайте, что они будут удалены или вас забанят.\n\nКроме того, ожидайте, что все взаимодействия, не связанные с рюкзаком, будут ОТКЛЮЧЕНЫ на официальных серверах. Поздравляю, ящик-кубисты, вы все испортили."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "StorageDrawers:controller",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 6,
          "OreDict:8": ""
        }
      }
    }
  }
}
