{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2583
    }
  },
  "questIDLow:4": 3248,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemNuggetDragonblood",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Драконья кровь",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Для первой порции гипогена вам понадобится немного драконьей крови. Возможно, у вас уже где-то завалялись кое-какие вещи, оставшиеся от давнего убийства дракона. Однако у вас есть еще 2 варианта. Пчелы и DE Fusion Crafter.\n\nДля пчелиного пути вам придется очень глубоко зайти в дерево размножения, но, возможно, вы уже это сделали? В любом случае проверьте вкладку «Разведение пчел».\n\nВ DE Fusion Crafter у вас есть 2 рецепта. Тот, кто лучше, использует Яйцо Бесконечности из Ведьмака. Без какого-либо колдовства вы также можете просто использовать обычное драконье яйцо по более слабому рецепту.\n\nКак только у вас появится немного гипогена, вы сможете использовать его в качестве отправной точки, чтобы увеличить свой DTPF без использования Dragonblood. Я не знаю, почему это так работает, пожалуйтесь Колену.\n\nОднако в конечном итоге для сверхпроводников UMV вам все равно понадобится больше Dragonblood.\n\n\n§3На самом деле есть еще один способ получить Dragonblood, который похож на рецепты DE Fusion Crafter, но вместо этого используется миксер. Это еще медленнее и менее ресурсоэффективно. В частности, яйцо дракона не выживает в этом процессе. Так что используйте это только в том случае, если вы абсолютно пытаетесь избежать магии и пчел.\n\nНапоминаем: для выполнения задачи с жидкостью просто необходимо, чтобы жидкость была в каком-то контейнере в вашем инвентаре. (ячейка, универсальная ячейка, большая ячейка, объемная ячейка и т. д.)"
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "requiredFluids:9": {
        "0:10": {
          "FluidName:8": "molten.dragonblood",
          "Amount:3": 576
        }
      },
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "taskID:8": "bq_standard:fluid"
    }
  },
  "rewards:9": {}
}
