{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3187
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3191
    }
  },
  "questIDLow:4": 3207,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "appliedenergistics2:tile.BlockDenseEnergyCell",
        "Count:3": 1,
        "tag:10": {
          "internalMaxPower:6": 1.6E7,
          "internalCurrentPower:6": 1.6E7
        },
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Второй реактор?",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "На данный момент, почему бы и нет? У вас должно быть больше возможностей себе это позволить, но есть проблема: слияние t3 открывает более простой рецепт америция, который позволяет вам легче создавать второй t3. Возможно, вы не захотите ждать так долго, возможно, вы выплавляли много слитков или использовали мировые ускорители?\n\nВ любом случае, двух гелиевых плазменных реакторов наверняка будет достаточно для того, что вы делаете. Оловянную плазму, конечно, стоит использовать, но рецепт Молекулярного преобразователя для преобразования серебра в олово больше недоступен в моноблоке, поэтому вам может понадобиться более простой вариант, поскольку вы раскачиваете два реактора и все такое. С двукратным разгоном они по-прежнему производят миллионы EU/t с правильными плазменными турбинами, при условии, что они у вас готовы.\n\nЕсли вы хотите продолжить расширение, вы можете посмотреть на термоядерную цепочку Mk2, которая заканчивается рунитной плазмой. В этом процессе используется силовая плазма из термоядерной цепочки Mk1, поэтому для него нужны эти 5 рецептов синтеза плюс еще 5. Несмотря на то, что это чрезвычайно мощный вариант генерации энергии, вряд ли вам сейчас нужно что-то такого масштаба. Однако имейте в виду, что он может вам понадобиться в UHV или UEV."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
