{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 176
    }
  },
  "questIDLow:4": 3145,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:blockGenerator",
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Основа для всех реакторов",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Ядерная энергия впервые доступна в электромобилях. Однако он бывает самых разных форм и форм, и может быть сложно выбрать один тип установки для использования среди всех доступных. Чтобы начать эту страницу книги квестов, этот первый квест будет представлять собой краткое изложение того, как можно производить ядерную энергию и когда она будет доступна. В других квестах, которые появятся в дальнейшем, будет более подробная информация о каждой конкретной настройке, но это обзор всех из них.\n\nTL;DR: Nuke \u003c Fluid Nuke \u003c Vacuum Nuke \u003c LFTR \u003d THTR \u003d Naq Reactor \u003c Fusion \u003c Compact Fusion для мощности, на реактор. Для размножения Nuke \u003c LFTR \u003d Naq Reactor \u003c HTGR с точки зрения скорости размножения и производительности, при этом для производства некоторых материалов требуется термоядерный синтез.\n\nПервый ядерный источник, к которому у вас есть доступ, — это ядерный реактор Industrialcraft 2, обычно называемый ядерной бомбой. Это небольшой одиночный блок, к которому могут быть прикреплены дополнительные камеры, образуя многоблочную структуру, и количество камер определяет количество места, доступного для компонентов ядерного оружия. Внутри него топливные стержни с радиоактивными материалами генерируют энергию, а все остальные элементы служат для контроля температуры реактора и предотвращения его взрыва. Он генерирует ЭУ напрямую, но его можно модернизировать до жидкостного ядерного оружия, которое вместо этого выдает горячую охлаждающую жидкость для Большого теплообменника, но с большей эффективностью. Наконец, есть еще вакуумная ядерная бомба, которая очень похожа на обычную ядерную бомбу, но охлаждается с помощью ячеек с охлаждающей жидкостью, которые изнашиваются и могут использоваться повторно только при использовании вакуумных морозильников. Обычным топливом для всех них является торий в EV и уран в IV.\n\nМежду IV и LuV есть еще один тип реактора — реактор жидкого фторида тория (LFTR). В этом большом мультиварке торий и уран смешиваются с очень горячими расплавленными солями (которые необходимо приготовить в другом мультиварке), что улучшает выработку электроэнергии за счет дополнительной обработки. Это дорогая установка, но отработанное топливо можно переработать в гораздо больше побочных продуктов, чем обычно, особенно в ЛуВе, где, помимо прочего, можно получить почти все благородные газы, а также огромное количество энергии.\n\nНа тех же уровнях (хотя в основном для LuV и выше) есть еще два более крупных мультимодуля: ториевый высокотемпературный реактор (THTR) и высокотемпературный газоохлаждаемый реактор (HTGR). THTR в основном предназначен для выработки электроэнергии, ему требуется входной ток около 0,5 А и выходная мощность LuV при различной силе тока, тогда как HTGR представляет собой реактор-размножитель, выдающий 1/20 количества горячего теплоносителя, в котором и происходит выработка электроэнергии. происходит из, но с гораздо лучшими соотношениями для разведения на лютеций и другие элементы.\n\nДругой тип ядерного реактора - это реактор «Хорошие генераторы Наквада», в котором по совпадению есть рецепты потребления ториевого жидкого топлива и уранового жидкого топлива, а также нескольких существующих типов топлива Наквады. Благодаря этим двум реактор может перерабатывать эти элементы гораздо быстрее, чем обычные ядерные бомбы, что полезно для получения энергии и размножения, но требует дополнительной обработки, пока это топливо не будет готово к потреблению. Кроме того, существуют топливные стержни для ядерных бомб IC2, в которых используются различные ториевые и урановые виды топлива, более или менее связанные с ними.\n\nС этого момента это сила термоядерного синтеза. Печально известные термоядерные реакторы GregTech работают путем объединения двух элементов в новый, что часто является необходимым шагом для прогресса, но они также превращают необходимую им энергию в экспоненциально большую плазму. Гелиевая и оловянная плазма — одни из наиболее часто используемых источников энергии, и их размещение в плазменных турбинах — отличный источник энергии в поздней игре, от ZPM до UEV и так далее. Обычные термоядерные реакторы состоят из 4 уровней, но есть также компактный термоядерный синтез и некоторые другие особенности термоядерного синтеза, которые вы, возможно, изучите позже.\n\nЭта страница в основном поможет вам сделать выбор между всеми этими возможностями. Практически гарантировано, что вы будете использовать как минимум 2-3 из этих настроек, поэтому постарайтесь освоиться с этими описаниями квестов."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
