{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3157
    }
  },
  "questIDLow:4": 3168,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 2098,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Можем ли мы получить здесь уран?",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Да, ты можешь. На самом деле вы можете получить его гораздо раньше, чем EV, но скорость, с которой вы его получите, может сильно различаться, в зависимости от того, как вы подходите к этой проблеме. Уран — это основной апгрейд Тория в ядерных бомбах, он дает гораздо больше энергии и другой полезный побочный продукт размножения, но вам нужно около 3 стаков урана-238, чтобы создать самую мощную базовую урановую ядерную бомбу IC2.\n\nНо как это получить? Ответ один: вы получите его от Ториума. Глядя на NEI, при переработке ториевой руды есть шанс получить урановую пыль, которую можно использовать в качестве топлива, но это происходит очень медленно, особенно учитывая, что торий - редкая руда в Пустоте, даже если каждый блок руды дает 4 измельченной пыли. Реальность, похоже, такова, что быстрый уран возникает только тогда, когда вы можете добывать его на планетах t2, но это не единственный способ. Есть секрет, и этот секрет касается урожая IC2.\n\nКак это работает? Ну, это просто. Урожай IC2, соответствующий Торию, Богу Грома, может в четыре раза увеличить каждую измельченную ториевую руду до 4 очищенных ториевых руд, но также дает в жидкой форме один урановый слиток! Это означает, что каждая ториевая руда дает вам 4 урановых слитка, а примерно с 42 рудами вы можете выполнить один цикл установки большого реактора. Однако Богу Грома нужна руда, поэтому обязательно сохраните ее для этой цели.\n\nЯдерное оружие EV Uranium — это достижение, предназначенное в основном для пользователей урожая IC2, поэтому этот квест не потребует чего-то подобного. Тем не менее, это полезный секрет, так что вот он. Кроме того, за выполнение квеста по сбору урана в книге вы получите 32 урана, что может оказаться полезным как для увеличения количества урана в четыре раза, так и для получения радия для радона!"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.02",
          "Count:3": 63,
          "Damage:2": 32526,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockores",
          "Count:3": 2,
          "Damage:2": 1096,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 7,
          "Damage:2": 11098,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 2,
          "Damage:2": 2098,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
