{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3186
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3189
    }
  },
  "questIDLow:4": 3203,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 828,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Дюраниум и циклотрон",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "В предыдущем квесте Дюраниум был представлен как материал, используемый для изготовления тританиума. Хотя это становится необходимым по этой причине, это еще не все. Другой рецепт, в котором он используется, — это рецепт Циклотрона, у которого есть шанс создать квантовую аномалию.\n\nПрежде всего, что такое циклотрон? Это мультиблок, который работает как термоядерный синтез, но только с целью создания новых материалов. Он сталкивает отдельные частицы друг с другом или с жидкостями, создавая новые элементы, потребляя при этом энергию. Большинство рецептов, которые он имеет, не будут очень полезны, если вообще будут полезны, но он также может создавать квантовые аномалии. Это случайная поделка, но у Аномалии есть особое свойство: при конвертации одних блоков в другие она не израсходуется. Поэтому для этой цели вам нужно получить только один.\n\nЭто обязательно? Ну да. Когда вы достигнете определенного этапа игры, вам может понадобиться новый вид припоя, называемый Mutated Living Solder. Для его изготовления вам понадобится химический завод, изготовленный из ботмия — сплава, для которого требуется усовершенствованный нитинол. Это, в свою очередь, один из блоков, для преобразования которого необходима Квантовая Аномалия. Учитывая, что Дюраниум — единственный жидкий выбор для создания Аномалии, он также необходим для этого, но всего на пару уровней от ZPM.\n\nКроме того, есть и другие рецепты, такие как Элементальный Дубликатор. Это очень мощный репликатор, который значительно повысит вашу автоматизацию благодаря своей скорости и рецептам репликации, которые он может выполнять, но квантовая аномалия, используемая в этом рецепте, будет израсходована, поэтому будьте осторожны: если у вас есть только один, не Не использую его для этого."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
