{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3164
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3165
    }
  },
  "questIDLow:4": 3206,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15450,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Создание Фьюжн",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Fusion — это поздняя игра. Это не вся поздняя игра, но несколько уровней эффективно полагаются на нее, даже если со временем открываются (разрабатываются) новые способы генерации энергии. Независимо от того, пришли ли вы сюда благодаря сосредоточению внимания на власти или продуктах, вы наверняка почувствовали важность этого пончика на своей базе, не так ли? Будем надеяться, что ваш запас энергии не иссякнет, когда вы начнете полагаться на обработку Mega Blast Furnace.\n\nЕсли вы достаточно изучили NEI, возможно, вы открыли для себя Force Plasma или некоторые этапы ее создания. Эта плазма является завершением первой из трех термоядерных цепочек, посвященных выработке энергии, хотя некоторые из этих особых плазм превращаются в полезные материалы в плазменных турбинах или экстремальных теплообменниках, такие как небесный вольфрам позже. Таких цепочек три, и они строятся друг на друге: одна для реакторов Mk1, другая для Mk2 и последняя для Mk3.\n\nВы можете строить эти цепочки в любое время, и они предлагают больше ЕС/т на термоядерный реактор, чем альтернатива гелиевой плазме, но маловероятно, что они вам понадобятся так рано. По-настоящему полезными они станут лишь позже, на этапе Mk3 с более крупными реакторами и турбинами."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
