{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3171
    }
  },
  "questIDLow:4": 3173,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "GoodGenerator:rodLiquidPlutoniumDepleted4",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Возбужденное жидкостное ядерное оружие",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Этот квест следует за вакуумным ядерным взрывом, потому что топливо, необходимое для создания такой установки, добыть труднее. В то время как предыдущие стержни были изготовлены из сжатого урана, это топливо требует того же материала для дальнейшей обработки в машинах GoodGenerators, а именно в нейтронном активаторе, для получения жидкого топлива из возбужденного урана. Его можно напрямую использовать в реакторе Наквада, где топливная экономичность выше, но, возможно, вы пока не сможете его построить, поскольку он создан после термоядерного синтеза. Вместо этого вы можете использовать указанное топливо здесь.\n\nПрежде чем пытаться это сделать, вам необходимо знать всю механику, связанную с жидкостным ядерным оружием. На самом деле, в этом квесте даже не будет никаких обязательных заданий, учитывая, насколько сложно создать хорошую установку такого рода. На момент написания этого квеста не существовало симулятора ядерного оружия, поддерживающего возбужденные топливные стержни, а это означает, что вам придется сначала протестировать в творческом режиме и собрать все результаты, которые вы оттуда получите.\n\nОснова этой установки проста: возбужденные урановые топливные стержни, единственный вид, который вам следует учитывать для этого, выделяют в 16 раз больше тепла, чем обычные, что намного больше, чем у обычного теплоносителя, если вы можете отправить все это тепло в реактор, чтобы превратиться во власть. Имеет значение только тепло, а это означает, что дополнительные EU/t, основанные на температуре, здесь ничего не сделают. Бросить в эту ядерную бомбу как можно больше стержней, не перегревая, вот в чем задача.\n\nЧто тогда? Вам наверняка понадобится много мультиплексоров, если вы хотите обрабатывать усилители мощности LuV, если только вы не выберете более продвинутые варианты. LHE модернизируется до EHE, экстремального теплообменника, и этот новый мультиплексор может выдавать либо перегретый, либо сверхкритический пар. В первом случае используйте паровые турбины XL для обработки смехотворного количества пара, которое вы получите. Для последнего нужны специальные турбины."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "GoodGenerator:rodLiquidUranium4",
          "Count:3": 10,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "GoodGenerator:rodLiquidPlutonium4",
          "Count:3": 10,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "GoodGenerator:rodLiquidUranium4",
          "Count:3": 1,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
