{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3196
    }
  },
  "questIDLow:4": 3183,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "bartworks:gt.bwMetaGeneratedcell",
        "Count:3": 1,
        "Damage:2": 10003,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Захватывающая жидкая ядерная бомба",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Когда реактор построен, пришло время автоматизировать топливо и присадки, поскольку на этот раз присадки есть. Они не являются обязательными, поэтому давайте начнем с необходимых входных данных.\n\nLiquid Air легко автоматизировать: это работа в вакуумной морозильной камере. Вводите энергию и Воздух и выводите Жидкий Воздух, для этого есть квесты. Сами виды топлива более сложны, но все три из них имеют одинаковый набор рецептов. Сначала вы берете большое количество радиоактивного элемента (тория, урана или плутония), заворачиваете его в специальную фольгу, а затем помещаете в имплозивный компрессор, чтобы получить очень плотные самородки. Это нужные вам предметы высокой плотности, которые затем смешиваются с определенной пылью для создания базовой топливной жидкости.\n\nОднако именно здесь все становится сложнее. Чтобы получить энергию из этой радиоактивной жидкости, нужно ее активировать. Торий производится путем смешивания с гелиевой плазмой (термоядерный синтез t1), а два других производятся непосредственно в термоядерном реакторе (термоядерный синтез t2). Активированное топливо можно забрасывать прямо в реактор для производства ЕС, причем очень медленно. Вашим узким местом должен быть основной радиоактивный элемент, поэтому убедитесь, что вы можете получить его достаточно быстро.\n\nНаходясь здесь, вы должны иметь готовый к работе Большой реактор Наквада. Однако это правда, что это возбужденное топливо можно использовать для изготовления топливных стержней для ядерного оружия IC2, с гораздо большей тепловой мощностью, предназначенной для жидкостного ядерного оружия. Вы можете попытаться использовать их там, но для этих удилищ не существует каких-либо смоделированных настроек, так что это будет очень экспериментальная установка, если вы когда-нибудь решите ее сделать."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "bartworks:gt.bwMetaGeneratedcell",
          "Count:3": 1,
          "Damage:2": 10007,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "bartworks:gt.bwMetaGeneratedcell",
          "Count:3": 1,
          "Damage:2": 10011,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "bartworks:gt.bwMetaGeneratedcell",
          "Count:3": 1,
          "Damage:2": 10003,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
