{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2610
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3179
    },
    "2:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3183
    }
  },
  "questIDLow:4": 3180,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 2078,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Ускоренное возбуждение лютеция",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Этот квест поздний, LuV.\n\nВозможно, вы уже читали, что лютеций необходим в качестве сырья для создания термоядерных материалов. В термоядерном реакторе 2-го уровня лютеций-хром \u003d америций, необходимый материал для многих необходимых ремесел. Лютеций — это материал, который получают исключительно путем селекции, поэтому вы находитесь в нужном месте, чтобы найти способы его получения.\n\nСамый первый метод — ториевые ядерные бомбы IC2 от EV — самый дешевый, но и самый медленный. Для истощения каждого топливного стержня требуется 50 000 секунд, то есть почти 14 часов, при этом на один обедненный стержень приходится половина лютециевой пыли. Конструкции с возможностью штабелирования, такие как двухкамерная модель с 11 четырьмя стержнями, дадут вам 22 пыли за цикл. После постройки 10 из них скорость по-прежнему составит 16 пыли в час. Такая скорость обработки недостаточна для того, чтобы продолжать прогресс вечно, и нет необходимости создавать больше башен ядерных размножителей. Вместо этого сделайте жидкое топливо.\n\nКак и раньше, вы хотите его истощить. Самый медленный этап процесса занимает 2500 секунд на ведро, но за одно ведро обедненного жидкого топлива на основе тория можно получить в среднем 96 лютециевой пыли. Это 138 в час при самом медленном темпе! Один нейтронный активатор соответствует скорости 86 ядерных бомб IC2, упомянутых выше, и этот нейтронный активатор является одной из двух дорогих частей этого мульти. Другой — термоядерный реактор первого уровня, предназначенный для создания гелиевой плазмы и активации ториевого жидкого топлива.\n\nИтак, для слияния нужен лютеций, а для этого лютеция нужно слияние? Да, гелиевая плазма — это синтез t1, тогда как рецепт америция — только t2, поэтому у вас есть время накопить лютеций быстрее, если вы еще этого не сделали. Для этого вам понадобится точный ассемблер, чтобы сделать нейтронный активатор, а также термоядерный реактор MkI, а также часть линии Наквада в середине.\n\n§4§4Получение лютеция с помощью нейтронного активатора уже невозможно. Пожалуйста, подождите, пока авторы книги квестов разберутся с этим. Я думаю, что HTGR — это новый метод, но на данном этапе вы можете просто заняться пчелами."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1193,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 32013,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "bartworks:gt.bwMetaGeneratedcell",
          "Count:3": 1,
          "Damage:2": 10007,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
