{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3176
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3146
    }
  },
  "questIDLow:4": 3160,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemCellThoriumBerylliumDepletedMoltenSaltTBSalt",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Первая половина разведения LFTR",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Технологическая цепочка LFTR состоит из двух частей: первая находится в середине-конце IV, а вторая требует сборочной линии и большего количества материалов для завершения. Помимо силы, обе эти половины имеют особые результаты, которые могут быть полезны для прогресса, но вторая половина, скорее всего, имеет наибольшую ценность. Несмотря на это, полная технологическая цепочка вокруг реактора и его топлива будет продолжать выдавать все, поэтому стоит посмотреть, что это дает.\n\nНачнем с выходов LFTR Fuel 1 после того, как топливо израсходовано в реакторе. U233 и UF6 используются для производства большего количества топлива. U233 будет использоваться до тех пор, пока у вас не появятся барботажные башни для улучшения производства топлива, а UF6 является частью хорошего рецепта топлива, которое вы всегда хотите использовать. Соль Т перерабатывается в реакторной технологической установке с получением проактиния, который распадается на еще большее количество U233, а затем в холодной ловушке с получением большего количества U233 и UF6.\n\nПомните: U233 — это первоначальный источник топлива, а UF6 — это тот, на который вы переключитесь по мере продвижения.\n\nМежду тем, U Salt также перерабатывается в большее количество топлива, но с бонусом в виде автоматизированной фосфорной пыли. К сожалению, много его вы не получите, но это все же продукт ядерного деления, который необходим для GT-сплавов и других целей.\n\nСоль ТБ очень похожа на соль Т, но с более высоким количеством того же выхода, а также фторида бериллия, выход которого становится больше, чем вы использовали, когда достигаете более поздних частей цепочки. Бесплатный бериллий!"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31031,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31033,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemDustUranium233",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
