{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3177
    }
  },
  "questIDLow:4": 3178,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 31034,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Первые шаги в переработке",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Теперь у вас есть 4 разных выхода жидкости, отходящих от вашего LFTR. Каждый из них требует особого внимания, и все они полезны.\n\nС чего начать поиск? Лучше всего начать с конца, то есть с Топливного завода. Вы хотите как можно скорее перейти на лучшее топливо, и у каждого из них есть 2 рецепта: один с 4 входами, аналогичный рецепту, который вы уже сделали, и один с 2 входами, ориентированный на топливную базу LFTR. Рецепты с двумя входами производят в 10 раз больше топлива, поэтому они намного лучше, но вы не можете использовать этот рецепт отдельно. Топливную базу можно создать только путем переработки отработанного топлива, и вы не получите его в достаточном количестве, чтобы произвести такое же количество израсходованного топлива. Если вы идеально переработаете любое из первых двух видов топлива, чтобы получить Топливную базу, у вас не хватит топлива, и у вас закончится топливо.\n\nУчитывая это, ваша стратегия будет заключаться в том, чтобы использовать два завода по очистке топлива, по одному для каждого рецепта топлива 2, а затем заменить их на топливо 3 после того, как вы построите сборочную линию, которая необходима для создания последних мультиблоков в этой линии. Для Топлива 2 возьмите как можно больше Топливной базы из этой цепочки — EBF \u003c- DT \u003c- RPU \u003c- LFTR и поместите ее на один из нефтеперерабатывающих заводов, используя второй для дозаправки оставшегося топлива, которое вам нужно. продолжайте работу LFTR. Вы можете ограничить UF4 на втором нефтеперерабатывающем заводе, чтобы там не производилось слишком много топлива, или просто включать и выключать его и использовать как можно больше лучшего рецепта. Вы сможете использовать лучший рецепт в 100% случаев, но только после постройки Очистительной башни.\n\nДополнительную информацию о других продуктах, которые можно получить в результате переработки, можно найти в разделе разведения этой ветки квестов."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 835,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemCellLFTRFuel2",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
