{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3150
    }
  },
  "questIDLow:4": 3158,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "tag:10": {
          "GT.ItemCharge:4": 100000000
        },
        "Damage:2": 32597,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Сосредоточьтесь на производстве электроэнергии",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Каждая сторона этой ветви будет сосредоточена на одной из двух половин результатов ядерного деления. Эта сторона сосредоточится на выработке энергии из имеющихся здесь реакторов, и, вероятно, именно поэтому вы здесь в первую очередь.\n\nЭти установки имеют одну цель: когда они были созданы, они предназначались для преодоления разрыва между ядерным оружием IC2 и термоядерным синтезом, потому что на самом деле не было ничего другого, что стоило бы использовать, кроме жидкостного ядерного оружия, если не было резервных копий, или автоматизация красного камня была слишком ненадежной для вакуума. ядерное оружие. Мало того, что до термоядерного синтеза существует полный двухуровневый разрыв в одном энергогенераторе, но также есть необходимая потребляемая мощность, чтобы вообще начать реакцию термоядерного синтеза. Это и скучно, и сложно, особенно когда в центре находится сборочный конвейер, так что мы здесь.\n\nПервая установка, которую вы можете собрать, — это цепочка LFTR, хотя в IV доступна только половина ее. Таким образом, именно с этого мы и начнем."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
