{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3155
    }
  },
  "questIDLow:4": 3157,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 32032,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Автоматизация подачи топлива",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Реакторные покрытия. Они очень важны для автоматизации, хотя их предполагаемое использование не в этом. Они служат для увеличения максимальной температуры реактора, но для вас это бесполезно, поскольку вы будете использовать теплонейтральные установки. Напротив, это просто самый дешевый способ заполнить все ячейки вашего ядерного оружия, за исключением тех, куда нужны топливные стержни.\n\nКак вы знаете, размещение каждого компонента имеет решающее значение для обеспечения безопасности реактора. Автоматизация подачи топлива — это так же просто, как просто засунуть топливные стержни в реактор, но вам нужно сделать так, чтобы открытые пазы были единственными безопасными местами для стержней. Оттуда вы можете извлечь с помощью фильтра, установленного на обедненную версию стержней, которые вы используете. и обмен произойдет без проблем.\n\nОттуда вы можете превратить истощенные стержни в годные к использованию, поместив их в термическую центрифугу, добавив обратно топливо, которое не было переработано (каждый тип стержней перерабатывает разное количество топлива) и пустые топливные/стальные стержни."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
