{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3167
    }
  },
  "questIDLow:4": 3170,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:particleBase",
        "Count:3": 1,
        "Damage:2": 24,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Дальнейший потенциал ядерного оружия IC2",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Наблюдательный ученый-ядерщик мог бы увидеть гораздо больше вариантов ядерного оружия IC2, чем те, которые упоминались в квестах до этого момента. Торий, Уран, Торий, Уран... а как насчет всех остальных вещей, что они делают?\n\nК сожалению, на этом копирование билдов заканчивается. Проведенные ядерные исследования почти полностью касаются топливных стержней, существовавших на базе IC2, а именно ториевых, урановых и МОХ-топливов. Почти все остальные были добавлены вместе с GTNH и в той или иной степени игнорируются большинством игроков. Однако не все они бесполезны! Чтобы понять почему, продолжайте читать.\n\nGoodGenerators добавила две новые пары стержней из урана и плутония: высокой плотности и возбуждения. Оба из них используют гораздо больше элемента на стержень, до такой степени, что вам понадобятся стопки и стопки каждого для запуска одной ядерной бомбы, а это означает, что это топливо для более позднего прогресса, когда вы накопите много У238. Основное отличие состоит в том, что стержни High Density выделяют намного больше EU/t при той же тепловой мощности, тогда как стержни Excited выделяют намного больше тепла, чем обычно. Это означает, что первые хороши для вакуумного ядерного оружия, а вторые — для жидкостного. Это правда, потому что вакуумное ядерное оружие требует большего количества EU/t от стержней с меньшим количеством тепла, чтобы продлить срок службы ячеек с охлаждающей жидкостью, в то время как жидкостное ядерное оружие производит горячую охлаждающую жидкость непосредственно из количества тепла, рассеянного в реакторе. Плутониевые версии также имеют поведение, подобное МОКС-топливу, а урановые — нет.\n\nОднако это не конец мощного ядерного оружия. Существует специальный, единственный в своем роде топливный стержень под названием The Core, и в вики есть одна вакуумная ядерная установка, использующая эти штуки, которая выдает 7.906.206 EU/t, или около 3 ампер сверхвысокого напряжения. Поистине смехотворная цифра, соответствующая поистине смехотворной стоимости производства самого топлива. Это установка для того времени, когда вам больше не следует использовать ядерное оружие IC2, настоящий вызов для безумного ученого-ядерщика.\n\nЧто еще там? К сожалению, не так много. Любой второй топливный стержень практически бесполезен. Тибериевые стержни могут порождать цирконий и ксенон, если они вам нужны, литий порождает тритий, а стержни Наквады невероятно плохи в выработке энергии, в чем многие другие лучшие реакторы могут использовать Накваду. С точки зрения мощности, больше ничего использовать не стоит."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
