{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3153
    }
  },
  "questIDLow:4": 3162,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:particleIon",
        "Count:3": 1,
        "tag:10": {
          "Ion:10": {
            "Charge:4": 0
          }
        },
        "Damage:2": 62,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Сплав европия",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Есть химические элементы, которые очень важны в качестве строительных материалов для машин высокого уровня. К сожалению, некоторые из этих элементов очень трудно найти в природе, и их необходимо создавать вручную. Это не сплавы и не смесь материалов, но они могут представлять собой смесь атомов...\n\nЕвропий — это первая стена, которую можно решить слиянием, и обычно только слиянием. Его можно найти в рудах, но гораздо проще построить термоядерный реактор и произвести его самостоятельно, потому что для вашего прогресса он понадобится в больших количествах. Это медленный корабль, но не дорогой, если у вас уже построен реактор, поскольку в качестве сырья он использует дешевые материалы: водород и неодим. Оба они широко использовались для прогрессирования, поэтому у вас не должно возникнуть проблем с захватом нескольких сотен каждого, чтобы начать эту реакцию.\n\nВажно собрать как можно больше информации. Каждый раз, когда термоядерный реактор меняет рецепт, у него есть период запуска, когда ему требуется большое количество энергии, чтобы начать работу. В случае с европием вам понадобится 150 миллионов евро, чтобы начать его производство, а затем 7 077 888 евро за каждый слиток созданного европия. Это не плазма, поэтому вы не сможете получить из нее энергию! Кроме того, изготовление каждого слитка занимает 14,4 секунды, поэтому вы можете относительно быстро получить несколько стопок европия. В течение этого времени вы не можете производить плазму для получения энергии, поэтому хорошей идеей будет иметь достаточное количество ЕС или другие установки для генерации энергии, работающие в фоновом режиме, пока вы создаете этот материал.\n\nС Европием вы сможете создавать новые виды були, вафель и многое другое! Проверьте NEI, чтобы увидеть, что вы разблокировали."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 48,
          "Damage:2": 30001,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.metaitem.99",
          "Count:3": 16,
          "Damage:2": 67,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "Damage:2": 17070,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
