{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3164
    }
  },
  "questIDLow:4": 3189,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:particleIon",
        "Count:3": 1,
        "tag:10": {
          "Ion:10": {
            "Charge:4": 0
          }
        },
        "Damage:2": 94,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Слияние америция и тритания",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Термоядерный реактор t2 открывает больше термоядерных материалов, некоторые из которых снова понадобятся для перехода на следующие уровни. Один из них — америций, который до сих пор является причиной всех беспокойств лютеция: оба необходимы, потому что один создает другой. Для рецепта также требуется хром в качестве входных данных, но его должно быть намного проще получить, чем лютеций или энергию, необходимую для ведра расплавленного америция, что составляет почти 300 миллионов ЕС.\n\nДля вашего будущего прогресса вам понадобится много стопок этого материала, но вашей первой целью должно быть изготовление 141 слитка (подробности см. в квесте ZPM «Изготовление америция»). Однако, если у вас есть избыток лютеция, вам следует производить больше америция, вы не пожалеете об этом, когда позже вам понадобится еще больше.\n\nЕще один полезный материал, который вы разблокируете на этапе 2, — это тританиум, который отличается от триниума. Источником этого материала является термоядерный синтез, а исходными материалами для его производства являются дюраниум и титан. Если вы раньше не производили Дюраниум, вы увидите, что для него требуется много радона, почти в 8 раз больше тританиума, который вы получите в итоге. Для этого у вас уже должен быть автоматизирован контур Радона, этот шаг очень важен для этого.\n\nДля прогресса вам понадобится тританий, так же, как вам нужен америций, поэтому рекомендуется изготовить оба из них в пакетном режиме в вашем новом термоядерном реакторе t2, чтобы вам не пришлось в ближайшее время возвращаться к этим рецептам."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.99",
          "Count:3": 32,
          "Damage:2": 30,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.metaitem.99",
          "Count:3": 32,
          "Damage:2": 78,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "Damage:2": 17103,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
