{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3145
    }
  },
  "questIDLow:4": 3150,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 835,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Улучшенное деление",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Эта ветвь начинается в середине IV. В этом направлении вы найдете несколько установок, связанных с ядерным делением, тем же процессом, что и ядерное оружие IC2, но более сложными и полезными способами. Отсюда вы можете получить энергию и побочные продукты размножения, как если бы вы использовали ядерное оружие, но быстрее и с большим разнообразием вариантов и целей.\n\nЭто верно. Если вы использовали ядерное оружие IC2, вы, возможно, более или менее узнали, как оно работает, но вся система кажется немного устаревшей. Это неудивительно, учитывая, что это базовый контент IC2, созданный 10 или более лет назад. Какие бы дополнения GTNH ни вносил в эти установки, они были минимальными по сравнению с общей реализацией этих ядерных боеголовок. Фактически, часть нового контента для них была результатом нового контента о ядерном делении, который был как бы перенесен в ядерное оружие.\n\nОднако у нас здесь хорошие стандарты прогресса. Достигнув IV, LuV и так далее, вы сможете использовать более продвинутые способы работы с Торием и Ураном! Это топливо почти всегда находится в центре внимания, время от времени поступает плутоний, но каждый новый реактор требует, чтобы его поставляли по-разному, чтобы все работало должным образом. Здесь представлены реакторы LFTR, THTR/HTGR и реакторы, связанные с Naq.\n\nНаконец, в этой цепочке квестов представлено множество различных мультиплееров и настроек, которые часто не связаны друг с другом. Например, вместо того, чтобы заставлять вас создавать полную настройку LFTR перед получением доступа к THTR, в этих квестах будут простые обязательные задачи и простые награды. Дополнительные задания будут включать в себя основные дорогостоящие крафты, которые помогут вам в создании этих установок, если вы в них заинтересованы."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
