{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3158
    }
  },
  "questIDLow:4": 3159,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 751,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Реактор жидкого фтора и тория",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Какое это сложное имя. Что это значит?\n\nНу, это так называемый реактор на расплаве соли. Часть «Жидкий фторид» означает, что ядерное топливо на самом деле представляет собой жидкость, смешанную с солями фторида. Это механизм, который затрудняет подготовку топлива к делению, но также делает процесс более эффективным, выделяет больше побочных продуктов, а также устраняет опасность взрыва. Правильно, ядерные катастрофы остались в прошлом! Расплавленная соль предназначена для стекания вниз в отверстие, где она затвердевает, в случае возникновения проблем с реактором, поэтому процесс деления не может продолжаться до взрывного беспорядка.\n\nОднако есть три недостатка. Один из них был упомянут чуть выше: топливо требует дополнительной обработки, чтобы быть готовым к LFTR, и большего количества исходных материалов для достижения правильной смеси. После того, как он проходит через реактор, он выходит обедненным, и эта часть также требует большего количества этапов обработки, хотя он выделяет гораздо больше полезных химикатов, чем один лютеций / плутоний, который дал процесс истощения ядерного оружия IC2. Наконец, расплавленная соль очень горячая и очень агрессивная, а это означает, что она разрушит материалы, используемые для создания ядерного оружия IC2. Для постройки реактора вам потребуются более новые, прочные и дорогие материалы, не говоря уже о его гораздо больших размерах.\n\nСтруктура этого мульти действительно другая. У него есть не один, а целых четыре необходимых динамо-люка, все из которых должны быть буферного типа: EV, IV или LuV, в зависимости от топлива, подаваемого в реактор, причем более качественные виды топлива открываются на более поздних стадиях развития. Это означает, что один LFTR во время работы вырабатывает либо 1 усилитель LuV, 1 усилитель ZPM или 1 УФ-усилитель. Ему также требуются 2 люка для обслуживания и 4 люка глушителя, если у него нет проблем с обслуживанием или загрязнений! Загадочна работа этого реактора.\n\nКроме этого, все входы и выходы являются текучими. Минимальное количество, которое вам понадобится, — 2 входа и 4 выхода, хотя один из выходов выходит со временем, а не по завершении рецепта. Этим продуктом является уран-233, очень редкий изотоп, который может помочь вам глубже изучить топливо LFTR и получить больше энергии, которую вряд ли можно получить из какого-либо другого источника."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 751,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "miscutils:miscutils.blockcasings",
          "Count:3": 35,
          "Damage:2": 12,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "miscutils:miscutils.blockcasings",
          "Count:3": 48,
          "Damage:2": 13,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:miscutils.blockcasings",
          "Count:3": 1,
          "Damage:2": 13,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
