{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3195
    }
  },
  "questIDLow:4": 3197,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:miscutils.blockcasings",
        "Count:3": 1,
        "Damage:2": 13,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Максимальный LFTR",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "LuV LFTR, работающий на топливе 3, выдает 4 ампера ZPM за такт, или 524 288 EU/t. Каждое ведро стоит 1 048 576 000 000 евро, более триллиона евро! Конечно, это самое энергоемкое топливо, которое вы когда-либо держали в руках, и теперь, когда вы добрались до него, вам гораздо легче дойти до термоядерного синтеза и далее. Но подождите, это еще не все!\n\nВозможно, вы заметили, что ограничивающим фактором в использовании лучшего рецепта топлива 1 и топлива 2 была соль U, которая в конечном итоге составляет топливную основу LFTR. Вам просто не хватит его, чтобы отказаться от этого неэффективного рецепта с четырьмя входами. Однако увеличение производства соли U из Топлива 3, а также удвоение, которое вы можете получить при обработке пропаренной гелием соли U вместо обычной, означает, что с этого момента вы можете использовать рецепт с двумя входами для производства всего вашего топлива! Если вы еще не установили гелиевые башни, сделайте это сейчас.\n\nКогда вы это сделаете, вы сможете взять два топливных завода, которые у вас должны быть, и установить для них обоих рецепт с двумя входами. На изготовление каждого ведра топлива 3 уходит 9000 секунд, но оно расходуется за 4000 секунд, поэтому хорошо иметь более одного нефтеперерабатывающего завода на каждый LFTR. Благодаря этому вы будете производить топливо намного быстрее и генерировать гораздо больше ЕС, чем раньше. Если вы продолжите расширяться, вполне возможно достичь первых уровней термоядерной мощности из чего-то вроде этого."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
