{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3159
    }
  },
  "questIDLow:4": 3176,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemDustLFTRFuel1",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Переработка ядерного топлива",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "К сожалению, предыдущий реактор сам по себе бесполезен. Даже если вы построили его полностью, невозможно получить топливо, которое он примет, не создав еще один мультимодуль, который смешивает и перерабатывает несколько химических смесей в одну, расплавленную соль, которая генерирует всю эту ядерную энергию в LFTR.\n\nКомбинат называется Завод по переработке реакторного топлива (ЗПТ), хотя проще его называть Топливным заводом. Это мультиблок IV среднего уровня, такой как LFTR, особенно из-за необходимости двух цепей ZPM для компьютерного куба, используемого в рецепте контроллера. Остальные корпуса аналогичны тем, что вы делали раньше, а подсказка дает хорошее описание того, что именно необходимо для строительства нефтеперерабатывающего завода.\n\nКуда положить каждую оболочку? Два нижних слоя имеют размер 3x3 и содержат структурные блоки. Поверх второго слоя, в среднем блоке, сделайте башню из 5 блоков сдерживания жидкости, а затем покройте их блоками герметика, как если бы вы делали это в мультиблочном майнере. Однако второй слой из 5, снизу, использует блоки защиты реактора, 4 из них вместо блоков герметика. Если у вас возникнут проблемы, воспользуйтесь голограммным проектором.\n\nКогда он будет полностью построен, вы сможете сосредоточиться на рецептах. Из 5 доступных на данный момент вы можете выполнить только один — рецепт «Топливо 1». Чтобы сделать это топливо, вам понадобится расплавленный U235, а также фторид лития, фторид бериллия и тетрафторид циркония. Каждый из этих элементов можно получить относительно легко, каждый по-своему, но основной частью всего этого является фтор, основной компонент расплавленной соли, поэтому неплохо иметь его достойный источник. Однако топливо LFTR также очень и очень энергоемкое, поэтому каждое ведро фтора может принести вам долгий путь.\n\nЕсли вы просматриваете NEI, ваш первый ответ может быть: «Нет других рецептов получения этих фторидов, кроме переработки обедненного топлива! Как мне их производить?». Ответ кроется в пыли: вам нужно создать пыль, а затем извлечь ее в жидкости. Существует электронная таблица, в которой описаны все этапы создания и повторной обработки (§1§n[url]https://docs.google.com/spreadsheets/d/1_1JGSt5-ELdra6emngUc7XvKSJc-_-RO0yreRIbOrx0/edit?usp\u003dsharing[/ url]§r), чтобы понять, насколько сложна эта цепочка.\n\nТолько помните: каждое ведро топлива стоит многие миллионы, а может быть, даже миллиарды ЕС! Не позволяйте 207-миллионной стоимости ведра топлива 1 обескуражить вас: в LFTR оно превращается в гораздо больше энергии. Кроме того, это первое топливо — всего лишь ступенька, так что пока не беспокойтесь о полной автоматизации всего, окончательная настройка отличается от этой."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 835,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.2",
          "Count:3": 10,
          "Damage:2": 2,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.2",
          "Count:3": 5,
          "Damage:2": 3,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "miscutils:miscutils.blockcasings",
          "Count:3": 4,
          "Damage:2": 13,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.2",
          "Count:3": 17,
          "Damage:2": 1,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.2",
          "Count:3": 1,
          "Damage:2": 3,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
