{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3189
    }
  },
  "questIDLow:4": 3191,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "dreamcraft:item.MedalWarp",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Дополнительный уровень 2 Fusion",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Уран – из золота, алюминия или магния, ртути. Вам следовало уже отказаться от ядерного деления, но если вам когда-нибудь понадобится уран, вы сможете использовать его? У вас уже должно быть много этого.\n\nПлутоний - из гелия-урана. Быстрое преобразование 1:1 из U238 в P239, но у вас уже есть доступ к плутониевой руде, так что это, вероятно, бессмысленно.\n\nКалифорний – из бериллия-плутония. В основном используется для Оганессона, не очень полезен для чего-либо еще, и вам не понадобится много этого, если копирование Оганессона является вариантом.\n\n(Эти 3 рецепта образуют возможную цепочку с Оганессоном, который можно приготовить в t3 fusion. Не то чтобы они обязательно были лучшим вариантом для его получения.)\n\nВозбужденное урановое топливо – из водорода и уранового жидкого топлива. Это для генератора Naquadah, который является поздней версией ZPM, или, возможно, для использования в ядерных бомбах IC2, хотя это худший вариант. По сути, это ускоренное деление ядер, если вас это интересует.\n\nВозбужденное плутониевое топливо - из водорода и жидкого плутониевого топлива. То же, что и выше, но из плутония. Это означает, что он более дорогой, но и более мощный и может обеспечить большую мощность генератора Наквада при использовании правильных добавок."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
