{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3190
    }
  },
  "questIDLow:4": 3193,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "dreamcraft:item.MedalGTExplosion",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Дополнительный слияние уровня 3",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Индий – из лития-серебра. Это один из наиболее важных дополнительных рецептов синтеза, учитывая, насколько сложно получить Индий. Ваши варианты: либо скопировать его, сделать его с помощью синтеза, получить его с линии наквадрии или получить его при переработке сфалеритовой руды.\n\n(Конечно, вы можете получить индий и другими способами, но это относительно популярный рецепт ненасильственного синтеза.)\n\nОганессон – из кальция калифорнийского. Это лучший благородный газ из всех, и его рецепт очень энергоемкий по сравнению с большинством других. Тем не менее, Оганессон сэкономит вам энергию при использовании рецептов EBF, сократив время рецепта больше, чем любая другая жидкость, а также разгонит шахтеров Бездны до максимальной скорости. Воспроизвести его, если это возможно, проще, чем произвести больше посредством синтеза.\n\nАмериций - из водорода плутония 241. Это более дешевый рецепт америция, который вам обещали в т2, и для него больше не нужен лютеций. Вы сможете очень легко получить оба входа, так что наслаждайтесь более дешевым америцием!\n\nНейтроний – из Naquadria Americium. Нейтрониевый синтез? Вам, вероятно, не понадобится это использовать, но это другой источник, помимо руд, который вы можете попробовать."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
