{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3169
    }
  },
  "questIDLow:4": 3172,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 2100,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Плутоний 239",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Красный, как слиток, белый, как капля. Это один и тот же элемент и один и тот же изотоп, даже если они не кажутся таковыми.\n\nПлутоний является основной частью реакции ядерного деления, в основном как продукт уранового делящегося топлива, когда атом в смеси захватывает нейтрон, а затем испускает электрон и антинейтрино. После нескольких часов пребывания в реакторе топливо считается истощенным, и в нем достаточно плутония, чтобы разделить его с помощью термического центрифугирования — основного и неэффективного способа ядерной переработки. В дальнейшем можно улучшить методы обращения с отработавшим ядерным топливом, но это первый способ получить этот ядерный побочный продукт.\n\nЕсли вы создали квантовые глаза, возможно, вы знаете одно из основных применений плутония: получение радия. Имея его в достаточном количестве, чтобы служить катализатором реакции, вы можете превращать уран в радий в небольших количествах, не теряя при этом плутония. Поскольку вам нужно 6 слитков, вам придется выполнить 3 цикла установки, показанной в квесте перед этим, или больше, если вы используете урановое ядерное оружие меньшего размера. Однако есть еще одна полезная вещь, для которой вы можете использовать это сейчас: больше ядерного топлива.\n\nНе просто больше ядерного топлива, а другое, более сложное, но и более мощное ядерное топливо. Оно известно как МОКС-топливо и по сути представляет собой смесь урана и плутония. Загвоздка в том, что весь плутоний, потраченный на создание топлива, возвращается вам при переработке обедненных стержней вместе с тем дополнительным, который вы обычно получаете, но не возвращается уран. Чтобы добыть ядерное оружие такого типа, вам понадобится более 6 слитков."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 1,
          "Damage:2": 11100,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
