{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3156
    }
  },
  "questIDLow:4": 3166,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:blockReactorFluidPort",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Усиление жидкостного ядерного оружия",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Возможно, EU/t предыдущей настройки вас не впечатлил. У вас достаточно материалов, чтобы собрать конструкцию жидкого ядерного оружия, но вы хотите чего-то большего, чем то, что вы видели раньше. Какая установка достаточно мощная, чтобы выдавать несколько усилителей IV и самостоятельно поддерживать развитую базу IV? Такая установка показана в этом квесте, но она требует больше мультиблоков и, следовательно, больше затрат, чем цепочка предыдущего квеста. Топливо то же самое, Уран, так что на данный момент это уж точно меньше всего вас беспокоит, по крайней мере, до тех пор, пока вы не попытаетесь автоматизировать подачу топлива.\n\nКомпоненты внутри ядерной бомбы становятся все более и более сложными, поэтому на этом этапе я попрошу вас заглянуть в вики на страницу «Ядерные реакторы» §1§n([url] https://gtnh.miraheze.org /wiki/Nuclear_Reactors [/url]) §1§r,§r и прокрутите вниз до установок жидкостного ядерного оружия, в частности, 1352 HU, 2 Quad Uranium и 1408, 3 Quad Uranium, 1 Dual Uranium. Основное различие между этими двумя установками заключается в том, что для первой требуются иридиевые отражатели нейтронов, которые довольно дороги, если вы еще не выполнили платлайн, а вторая их не использует, но ее сложнее автоматизировать из-за наличия более одного типа. из стержня.\n\nКакова конечная производительность ЕС/т при КПД турбины 170%? 36288 и 38016 ЕС/т соответственно.\n\nОднако после автоматизации самого ядерного оружия предстоит еще многое сделать. Как обычно, требуется ПТО, но эти установки вызывают нечто новое: ПТО начинает выдавать перегретый пар из-за большого потока горячего теплоносителя, который он получает, а это означает, что вам нужны два комплекта турбин вместо одного. Этот тип пара должен поступать в паровые турбины большой мощности, в которых используется большое количество вольфрамовой стали для контроллера и стопки титана для корпусов. После этого он попадает в обычные Большие Паровые Турбины, и процесс завершается.\n\nЕсть еще одна новая вещь, о которой стоит беспокоиться, если всего этого будет недостаточно: расход пара очень высок, выше, чем раньше, а это означает, что, вероятно, вам понадобится 3 или более турбин каждого типа, дальнейшее усугубление расходы, которые у вас будут здесь.\n\nЛучший вариант турбины IV уровня — HSS-E с КПД турбины 170%.\n\nОднако есть еще одна турбина с КПД 180% с HSS-S; для этой турбины требуется завершенная надежная платиновая линия, чтобы сэкономить ресурсы для нее."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.Quad_Thoriumcell",
          "Count:3": 8,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.reactorUraniumQuad",
          "Count:3": 3,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.reactorUraniumDual",
          "Count:3": 1,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "index:3": 2,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
