{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3161
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3197
    }
  },
  "questIDLow:4": 3179,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemCellPlasmaXenon",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Вторая половина разведения LFTR",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "В барботажную башню подаются два газа: гелий и фтор. Каждый из них воздействует на различные обедненные соли (соль U, соль T, соль TB) определенным образом. Гелий работает с солью урана для получения наиболее ценных побочных продуктов, а фтор работает с двумя другими солями для производства других побочных продуктов и TF4, который необходим для производства топлива LFTR 3. Здесь мы сосредоточимся на гелии и соли урана, а также на TF4. Остальные рецепты будут рассмотрены в разделе, посвященном силовым агрегатам.\n\nВся соль U, которую вы получаете из LFTR, из любого топлива, может быть пропущена через барботажную башню. Это дополнительный шаг, медленный, но полезный. Рецепт относится к HV-уровню, но рекомендуется разогнать его и, возможно, даже построить несколько башен для его ускорения. Вся имеющаяся у вас соль U должна пройти через них, потому что при барботаже выделяется почти весь благородный газ! Со временем будут вырабатываться ксенон, неон, аргон, криптон и радон, драгоценные газы для ускорения рецептов EBF и экономии большого количества энергии, а также для шахтера Бездны. С другой стороны, радон необходим для изготовления квантовых глаз, квантовых звезд и многих других важных предметов.\n\nНесмотря на то, что вы получаете много газов, скорость, с которой вы их получаете, невелика, поскольку она зависит от скорости, с которой расходуется топливо LFTR. Это не должен быть ваш единственный источник этих газов, но это совершенно бесплатный способ их получения, учитывая количество энергии, которое производит LFTR."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 2,
          "Damage:2": 31035,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31032,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31034,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemCellXenon",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
