{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3192
    }
  },
  "questIDLow:4": 3194,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 32023,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Меньший Fusion больше",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Он не меньше, он компактнее!\n\nКомпактный фьюжн. Если вы искали большой мультиблок, который можно было бы собрать, вы пришли к очень интересной вещи. Вряд ли найдется что-нибудь, что могло бы превзойти его по размеру, за исключением Мега Дистилляционной Башни максимальной высоты, но это скорее широкий мульти, а не высокий. Фактически, он настолько широк, что не может поместиться в один фрагмент и вместо этого занимает пространство фрагмента 3х3! Убедитесь, что вы правильно следуете инструкциям и голограмме, и прыгайте от радости, когда построите одну из них.\n\nВы можете выбрать один из четырех уровней для этого реактора, так же, как и для обычных термоядерных реакторов. Для компактного контроллера потребуется 48 обычных контроллеров того же уровня, плюс некоторые другие материалы и более 2 тысяч блоков в конструкции, которые удобно подробно описаны во всплывающей подсказке. Он гораздо больше предыдущих реакторов, но и имеет огромное количество параллелей, начиная с 64x с t1 и заканчивая максимум 256x с t4!\n\nЭто то, что нужно делать, когда вы глубоко погрузились в слияние t3, возможно, даже t4, и вам не хватает энергии. Вместо того, чтобы строить башню из реакторов, почему бы не построить одну из них? Единственная проблема с питанием, которая у вас возникнет после завершения работы, — это количество турбин, которые вам понадобятся, чтобы съесть всю плазму. Вы, вероятно, знаете о плазменной турбине XL, но вы также должны знать, что она налагает огромные штрафы на большинство видов плазмы, включая гелий и олово, если вы используете хорошие турбинные материалы, такие как Infinity. Помните те цепи слияния, упомянутые в предыдущих квестах? Это время для них. Посетите вкладку GT для получения более подробной информации."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 32021,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "GoodGenerator:compactFusionCoil",
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
