{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3193
    }
  },
  "questIDLow:4": 3204,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings5",
        "Count:3": 1,
        "Damage:2": 12,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Конец термоядерных материалов",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Существует не так много необходимых термоядерных материалов, которые вы уже прошли на данный момент. Есть еще много рецептов, многие из которых уже перечислены в квестах, но есть и такие, которые еще предстоит освоить.\n\nОднако это финал. Если вы посмотрите на NEI, то увидите несколько рецептов с EU/T и стартовыми значениями EU, которые выше, чем может предложить t3 fusion, что предполагает наличие еще одного уровня. Реальность такова, что термоядерный синтез t4 действительно существует, но он больше предназначен для хвастовства, чем для реальной пользы, к тому же он намного дороже и сложнее в изготовлении, чем любой другой реактор. Для этого есть квест на странице «Цели в финале», если вы его разблокировали.\n\nСреди последних материалов вы найдете Флеровий, Ругнор и, наконец, Гипоген. У них не так много возможных применений для большей части пакета, но Гипоген становится незаменимым в эндшпиле, где он становится частью прогресса блока катушек, а также используется в некоторых рецептах в качестве проводов. Если вы действительно хотите идти к звездным вратам, вам нужно будет создать много стопок этого."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockcasings5",
          "Count:3": 1,
          "Damage:2": 12,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
