{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3185
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3198
    }
  },
  "questIDLow:4": 3184,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:gtplusplus.blockcasings.4",
        "Count:3": 1,
        "Damage:2": 2,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Финал деления",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Вот мы и подошли к концу деления.\n\nНа данный момент вы уже более чем вошли в уровни слияния. Фактически, последние установки термоядерного синтеза идут так же глубоко, как и термоядерный синтез t2, поэтому вы можете одновременно запускать и деление, и термоядерный синтез, хотя последний, как правило, проще и эффективнее после того, как структура построена.\n\nОдной из конечных целей деления является заполненный HTGR или его младший брат, THTR, два очень дорогих мультимодуля, которые могут дать вам практически бесконечную мощность или продукты размножения. Однако генератор Наквада, в котором есть это возбужденное ядерное топливо, может сделать гораздо больше! Топливопровод Наквада является причиной его создания, и он может заменить термоядерный синтез Т3 и далее за счет конденсации энергии даже больше, чем это сделал термоядерный синтез, и заменить турбинный спам.\n\nЭто топливо не является ни ядерным делением, ни термоядерным синтезом, а скорее химическим, поэтому оно не было включено сюда. Если интересно, посмотрите NEI, чтобы узнать, что они могут предложить."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
