{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3187
    }
  },
  "questIDLow:4": 3188,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "GoodGenerator:compactFusionCoil",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Разгон веков",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Оловянная плазма более энергоемкая, но это не обязательное обновление. По мере масштабирования всегда стоит оглянуться на гелиевую плазму и понять, насколько она возобновляема, чего, к сожалению, оловянная плазма немного утратила. Его можно сделать возобновляемым, но одна из его сильных сторон заключалась в рецепте молекулярного трансформатора, который превращал выходное олово в серебро, одно из входных ресурсов. Этот рецепт теперь находится в новом мультиблоке «Молекулярный трансформатор» и масштабируется не так хорошо, как раньше. Поэтому, возможно, было бы проще использовать пустотные шахтеры для добычи серебра или придерживаться гелиевой плазмы.\n\nКак обычно, выполнение рецепта более низкого уровня дает вам разгон. Однако, в отличие от других машин GT, разгон Fusion Reactor удваивает как скорость, так и энергопотребление, что сохраняет энергопотребление на рецепт, но дает лишь половину прироста скорости, который мог бы обеспечить идеальный разгон (например, Большой химический реактор). Это означает, что реактор t2 может производить ровно в два раза больше энергии, чем реактор t1, в виде плазмы, но модернизация будет больше, если принять во внимание более совершенные турбины.\n\nЧто же будет дальше? Уровень 3 – это то, что будет дальше. Здесь нет нового топлива, вы можете выбрать либо 4-кратную скорость на гелии, либо 2-кратную скорость на олове. После получения более дешевого рецепта америция, доступного на этапе 3, вы сможете производить больше реакторов по более низкой цене, но отсутствие улучшения топлива по-прежнему будет проблематичным в вашем прогрессе. Вам придется найти другие способы повысить свою силу, которые откроются после этого."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
