{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3149
    }
  },
  "questIDLow:4": 3152,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings5",
        "Count:3": 1,
        "Damage:2": 13,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Путь слияния",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Самая передовая ядерная технология, которую можно использовать в пакете, — это ядерный синтез. Это событие, когда два атома сталкиваются друг с другом и сливаются в другой атом, одновременно генерируя энергию из плазмы при ее обработке. В реальной жизни это невозможно реализовать в реакторе, потому что требования к температуре слишком высоки, чтобы поддерживать какой-либо твердый реактор с достойной эффективностью. Однако в GTNH есть материалы получше.\n\nПервый термоядерный реактор можно построить в конце LuV, и каждый уровень открывает некоторый материал, который важен для перехода на более поздние уровни. На этом этапе становится важным создание термоядерного синтеза для таких материалов, как европий, америций, нейтроний и оганессон, поэтому позже вам захочется посвятить реакторы конкретным вещам. Что еще более важно, эти материалы представляют собой плазму, которую необходимо охладить, чтобы превратить в слитки и пластины. Вдобавок ко всему, этот процесс охлаждения позволяет получить много энергии!\n\nОбычный процесс производства электроэнергии здесь заключается в закачке ЭУ в термоядерный реактор. Ему нужно достаточно энергии, чтобы начать реакцию, которая затем будет протекать быстро и выделять большое количество плазмы. Эта плазма поступает в плазменные турбины, которые производят огромное количество EU/t и охлажденного материала, готового к использованию в дальнейшем производстве. Установка новичка может выдавать 640 000 EU/t от одного реактора до разгона, и со временем эта цифра быстро растет. Мощность термоядерного синтеза доминирует в игре на нескольких уровнях из-за своей простоты, уступая установкам энергогенераторов, которые становились все более и более сложными с каждым уровнем. Два материала сливаются в один, выходит плазма, попадает в турбину и грохот, много энергии! Это похоже на паровой электрогенератор, но с большими цифрами.\n\nПодводя итог, можно сказать, что синтез необходим для прогресса из-за материалов, которые он производит. В то же время он очень мощный источник ЕС."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
