{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3169
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3166
    }
  },
  "questIDLow:4": 3201,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "IC2:itemUran",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
"name:8": "Торий против Урана",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Торий и Уран имеют много различий, но и много общего.\n\nВ целом уран является лучшим топливом, но жидкостное ядерное оружие не подчиняется этому общему правилу. Поскольку они не производят EU/t, а просто преобразуют тепло в горячую охлаждающую жидкость, разница между двумя видами топлива становится минимальной, а торий выделяется тем, что его гораздо легче получить и превратить в топливные стержни. Максимальное количество тепла, которое вы можете безопасно перемещать в реакторе, ограничивает количество урановых топливных стержней, которые вы можете использовать, а это означает, что ваше значение HU не будет таким высоким, как вам хотелось бы.\n\nОднако для обычного и вакуумного ядерного оружия IC2 уран имеет большое преимущество. Особенно в вакуумных ядерных бомбах, которые являются самыми мощными, эффективное охлаждение ячеек позволяет перерабатывать большое количество урана одновременно, что возвращает невероятные количества EU/t. Различное преобразование топлива в энергию между жидкостью и вакуумом означает, что торий очень хорош для жидкостного ядерного оружия, тогда как уран очень хорош для вакуумного ядерного оружия."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
