{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3166
    }
  },
  "questIDLow:4": 3167,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 1002,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Вакуумное ядерное оружие",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Каков следующий шаг — запуск ядерных реакторов в идеальном вакууме? Это было бы очень забавно, я бы хотел это увидеть.\n\nОтказ от ответственности: этот последний шаг не очень стабилен. Очень рискованно делать это на серверах без резервных копий, поскольку для предотвращения взрыва реактора используются схемы красного камня. Используйте несколько отказоустойчивых устройств, чтобы гарантировать безопасность. Никогда не создавайте вакуумную ядерную бомбу на сервере-термосе!\n\nВакуумное ядерное оружие представляет собой интересную установку, специфичную для GTNH. В них используются всего три компонента: топливные стержни, обшивки для заполнения пустых слотов в целях автоматизации и ячейки с теплоносителем. Например, те ячейки, которые вы использовали для создания энергетических люков, используются здесь для предотвращения перегрева и взрыва реактора. Основное отличие этой установки заключается в том, что эти элементы являются расходными и со временем изнашиваются. Вам нужно будет добавлять в реактор свежие клетки, чтобы он продолжал работать безопасно, но суть шоу в том, что вам не нужно создавать новые — вам просто нужно снова их охладить.\n\nВакуумная морозильная камера! Вот почему это называется вакуумной ядерной бомбой! Элементарно, мой дорогой Стив. Установка такого типа основана на использовании EU для пополнения ячеек теплоносителя, так сказать, и получения гораздо большего количества EU из реактора, чем вы тратите на поддержание его работы. Однако автоматизация этого процесса с помощью красного камня довольно сложна. Если вы просто попробуете это вслепую, вам может потребоваться много времени, чтобы понять это, и это может привести к взрывным результатам. Посетите страницу «Вакуумные реакторы» в вики (§1§n[url]https://gtnh.miraheze.org/wiki/Vacuum_Reactors[/url]§r), если вам нужно подробное руководство, выходящее далеко за рамки того, что я мог бы написать. в этом описании квеста.\n\nЭто квестовое задание предназначено для последней установки, показанной в вики, а именно для установки 8720-43600 EU, 40 Quad Uranium. Как следует из названия, он может производить до 43600 ЕС/т, но для его безопасной работы потребуется несколько фильтров и отказоустойчивых устройств. Преимущество по сравнению с жидкостным ядерным оружием заключается в том, что для таких высоких показателей мощности не требуется установка турбины LHE."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.60k_Helium_Coolantcell",
          "Count:3": 14,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.reactorUraniumQuad",
          "Count:3": 40,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1002,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockcasings2",
          "Count:3": 16,
          "Damage:2": 1,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 2,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.60k_Helium_Coolantcell",
          "Count:3": 1,
          "tag:10": {},
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
