{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1148
    }
  },
  "questIDLow:4": 2141,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 30686,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§6§lДобро пожаловать в Церковь Бензола",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Если вы добрались до MV с помощью Steam, вы, вероятно, задаетесь вопросом, как выжить, продвигаясь дальше. Одним из вариантов является переход на легкое топливо, обсуждаемое в LV. Другой вариант — использовать бензол. Бензол производится из древесной смолы. Для этого есть несколько путей. Оба начинаются с бревен деревьев.\n\nОдин из путей — использовать коксовые печи или усовершенствованные коксовые печи для производства древесного угля и жидкой экстракции из него древесной смолы (для максимальной эффективности ЕС используйте жидкостные экстракторы низкого давления). Затем перегоните древесную смолу, чтобы получить бензол. Этот метод производит меньше загрязнения, но также дает меньше бензола.\n\nВторой путь — использовать мультиблок пиролизной печи и газообразный азот для извлечения древесной смолы и древесного угля. Жидкостная экстракция древесного угля для получения дополнительной древесной смолы. Затем действуйте, как указано выше. Этот метод приведет к загрязнению от пиролиза, но обеспечит больше бензола на бревно.\n\nИзбыток древесной смолы также можно превратить в толуол, ключевой ингредиент взрывчатки, который вам понадобится позже для изготовления ракет.\n\nЕсли вы используете рецепт «Побочные продукты древесного угля», вы также можете получить множество полезных побочных продуктов, но вам понадобится 4 DT."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.01",
          "Count:3": 64,
          "Damage:2": 30686,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 5,
          "OreDict:8": ""
        }
      }
    }
  }
}
