{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3287
    }
  },
  "questIDLow:4": 3289,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "Avaritia:Resource",
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Катализация чудес",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "QFT использует тот же катализатор, что и химический завод. Однако, как и растения, у которых есть катушки Пробужденного Дракония или выше, он не расходует долговечность катализатора при завершении рецепта, ведя себя больше как реальный катализатор, который регенерируется после использования. Это делает используемые здесь катализаторы более дорогими в изготовлении, как это было в случае с катализатором бесконечной мутации для мутировавшего живого припоя, который предназначен для использования только с теми катушками, которые делают его долговечным.\n\nУчитывая отсутствие потери прочности, кажется, что нужно создать только один катализатор. Однако есть две причины, по которым это не так: во-первых, в каждом рецепте QFT используется другой катализатор; во-вторых, QFT проверяет наличие параллелей, подсчитывая количество катализаторов на входных шинах для рассматриваемого рецепта (максимум 64 параллели для стека правильного катализатора). Эта система делает так, что для разблокировки рецепта требуется создание одного катализатора правильного типа, но создание большего количества совершенно необязательно и изменяет только скорость, с которой создается несколько катализаторов, при условии, что он получает достаточный вклад ЕС.\n\nКаждому катализатору нужны некоторые материалы, которые он открывает в QFT, то есть для изготовления катализатора придется использовать исходную технологическую линию, которая позволит игроку пропустить его в QFT. Это относится к каждому рецепту и, в свою очередь, к каждой строке, которую можно пропустить.\n\nЧтобы улучшить общую скорость обработки, ваш единственный вариант — получить больше параллелей с катализаторами. Другой, более сложный способ — повысить шансы на успешный результат, добавив больше энергии в систему, но особым образом: вместо использования прямого ЭУ, его использование для создания мощной плазменной работы для улучшения обработки КТП.\n\nЕсли добавлена ​​правильная плазма, усиление будет работать, но также можно обновить саму структуру, чтобы выполнять химические пропуски, которые невозможны с базовым QFT. Эти обновления основаны на более совершенных и мощных материалах, в основном в улучшении материалов рецептов DTPF. Однако этих существующих материалов недостаточно, поскольку с этими «чужими» веществами невозможно поддерживать квантовую стабилизацию. К счастью, QFT сам может производить элементы, необходимые для создания модернизированных оболочек, и эти элементы являются результатом некоторых пропусков, выполняемых в мульти. Он начинается с того, что позволяет гораздо проще производить уже имеющиеся материалы, но в ходе этого процесса открывает совершенно новые материалы, которые полезны для улучшения самой конструкции.\n\nВ структуре три новых предмета и четыре уровня. Первый уровень можно построить и без них, но для каждого нового уровня требуется новый предмет, созданный на предыдущем уровне. Эти результаты связаны с рецептом, по которому их можно получить, и обладают уникальными характеристиками, которые в реальной жизни являются лишь теоретическими.\n\nПервый предмет, который вам понадобится изготовить, — это сверхстабильный самовосстанавливающийся клей. Чтобы изготовить этот материал, следуйте рецепту клея/припоя, используя катализатор усилителя адгезии. Кроме того, сделайте эти другие катализаторы, чтобы доказать, что вы хорошо подготовлены к своему пути QFT."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:item.BasicGenericChemItem",
          "Count:3": 1,
          "tag:10": {
            "catalyst:10": {
              "MaxDamage:4": 50,
              "Damage:4": 0
            }
          },
          "Damage:2": 16,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "miscutils:item.BasicGenericChemItem",
          "Count:3": 1,
          "tag:10": {
            "catalyst:10": {
              "MaxDamage:4": 50,
              "Damage:4": 0
            }
          },
          "Damage:2": 17,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "miscutils:item.BasicGenericChemItem",
          "Count:3": 1,
          "tag:10": {
            "catalyst:10": {
              "MaxDamage:4": 50,
              "Damage:4": 0
            }
          },
          "Damage:2": 19,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
