{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2588
    }
  },
  "questIDLow:4": 3287,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 31151,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Химические псевдоссоры",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Узнать больше о мире и его путях — признак мудрости. Однако по-настоящему мудры те, кто знает то, что неважно и что можно пропустить. Для настоящего нарушителя технологий ограничения физики и химии не существенны. Чтобы обойти эти технические детали, в игру вступает преобразователь квантовой силы.\n\nЭтот мультиплекс предназначен для воспроизведения наиболее популярных и важных технологических линий в развитии упаковки, в основном тех, которые связаны с химией. Из-за рекурсии в рецептах, когда для изготовления эквивалентов более высокого уровня требуются материалы более раннего уровня, существует множество ранних технологических линий, которые остаются в силе на протяжении всего прогресса. Хуже того, им часто требуется все больше и больше машин, чтобы соответствовать растущим требованиям скорости. Чтобы сэкономить на задержках, этот мультиплексор будет выполнять эти технологические линии за один этап и без большинства дополнительных химикатов, которые добавляются для очистки входных данных и выходных продуктов.\n\nТрансформатор квантовой силы (QFT) разблокируется в UEV после создания биомэйнфреймов и с добавлением одной Вечной сингулярности и других материалов. Это высокий мультиблок размером 15x15 со множеством различных корпусов, в том числе два, которые можно модернизировать и которые определяют два уровня мультиблока. Хотя он доступен в UEV, модернизированные оболочки требуют все более дорогих материалов, а также открывают пропускные способности для более совершенных технологических линий. Например, пропуск платформ можно выполнить на более раннем уровне QFT, тогда как пропуск кевлара можно выполнить только на последнем уровне.\n\nКаждый рецепт, имеющийся в QFT, представляет собой одну технологическую линию или большую часть линии. Например, исходными данными для раннего производства пластика являются основные компоненты пластика на молекулярном уровне (углерод, водород, кислород и т. д.), а не многоэтапные химические вещества, которые использовались полдюжины уровней ранее. Все рецепты имеют 3 и более выхода, и у каждого выхода есть шанс появиться: шанс для каждого равен 100%, делённому на количество выходов. Для его увеличения можно использовать дополнительную механику.\n\nПроще говоря, QFT использует огромное количество энергии и стабилизацию квантового поля, чтобы разобрать простые молекулы и собрать их в более сложные без необходимости использования добавок или ограниченных процессов. Единственное дополнение к базовым входам, которое требуется мультиплексору, — это специальный катализатор, который интеллектуальные схемы используют для преобразования материалов в то, во что они в конечном итоге преобразуются, но они никогда не расходуются и не теряются каким-либо образом.\n\nЭтот прямой процесс упрощает длинные цепочки обработки до одного шага, но имеет два последствия: он делает процесс дорогим, учитывая экстремальные условия, необходимые для трансформации (аналогично синтезу), но он также генерирует множество различных результатов одновременно. , ни одно из которых не гарантировано, и невозможно выбрать между ними, не добавив в настройку что-то еще, чтобы каким-то образом изменить условия внутри QFT. Добавление большего количества энергии в мульти ничего не даст, а более качественные материалы, похоже, не работают, так каков же следующий шаг? Именно это и ответят следующие два квеста."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.2",
          "Count:3": 80,
          "Damage:2": 12,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.4",
          "Count:3": 177,
          "Damage:2": 4,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.5",
          "Count:3": 224,
          "Damage:2": 15,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.5",
          "Count:3": 233,
          "Damage:2": 7,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "miscutils:gtplusplus.blockcasings.5",
          "Count:3": 142,
          "Damage:2": 11,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 31151,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
