{
  "questIDHigh:4": -5395117840349313082,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": -703325969313020818,
      "questIDLow:4": -6653872471765810391
    },
    "1:10": {
      "questIDHigh:4": 5617954830618019035,
      "questIDLow:4": -6752762253121630907
    }
  },
  "questIDLow:4": -5166715817697893279,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "miscutils:itemCellPlasmaForce",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Force Plasma — концовка Mk1",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Как только у вас будут две прежние плазмы, соедините их вместе в новую, неоновую плазму. Если бы вы использовали это напрямую, вы могли бы получить Neon! Есть и другие, более полезные материалы, которые можно получить позже в этом процессе, так что следите за ними.\n\nОднако это не последняя плазма в рецептах мк1. Чтобы получить его, вам необходимо выполнить последний шаг активации, который существует во всех трех цепочках и включает в себя добавление не связанного с плазмой материала соответствующего уровня GT для получения плазмы энергогенератора. Материал, который вам понадобится, — это бедрокий, который вы, вероятно, уже использовали раньше. В ранней игре метод получения сжатого булыжника является огромным бременем, поэтому переключитесь на t8 Шахтеры Бездны или Космический Лифт, чтобы автоматизировать это.\n\nЕсли вы посмотрите на последний рецепт, вы увидите, что входная мощность неоновой плазмы составляет 144 л, а выходная мощность — 1000 л принудительной плазмы. В результате умножения этот шаг и все заключительные шаги будут самыми медленными. Вам понадобится 0,144 неоновых плазменных реактора на каждый силовой плазменный реактор, а это значит, что 1 неоновый реактор питает почти 7 силовых реакторов (6,9444... реакторов, точнее).\n\nКак только вы получите Force Plasma, это будет конец цепочки слияния mk1. Force Plasma — это плазма с топливной ценностью 220M, что означает, что она не имеет штрафа к плазме Infinity Catalyst XL, тогда как гелиевая плазма имеет штраф 86,1% EU/t. Вероятно, вам это не понадобится в ZPM, но это станет ступенькой для вашего будущего развития."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemCellPlasmaNeon",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "miscutils:itemCellPlasmaForce",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}
