{
  "questIDHigh:4": 7843197398684813402,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1212
    }
  },
  "questIDLow:4": -5758255961960012806,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 30584,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Добро пожаловать в сеть Plasma",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Привет! Если вы разблокировали термоядерный синтез, вы можете начать эту цепочку квестов, но имейте в виду, что он разделен на три сегмента (три термоядерные цепочки): по одному для каждого уровня термоядерного реактора, от Mk1 до Mk3.\n\nДля всех этих цепочек существует электронная таблица, хотя в ней есть неверные цифры количества реакторов. Чтобы увидеть это, проверьте электронную таблицу Excel, в которой установлены эти числа, по следующей ссылке Github: §§§§§[§1§n[url]https://github.com/GTNewHorizons/GTplusplus/pull/669[/url] ]§р\n\nЭти квесты следуют за процессом создания действительно мощной плазмы, которая будет полезна для выработки энергии в начале финальной игры, когда вы увеличите свою установку до компактного термоядерного реактора и плазменных турбин XL. Как вы, возможно, видели раньше, эти огромные турбины могут работать очень быстро с хорошими материалами, такими как Триниум или Инфинити, но они будут применять штрафы EU/t в зависимости от топливной ценности используемой плазмы. Это означает, что гелий и оловянная плазма там намного слабее, чем в больших плазменных турбинах.\n\nКонечным продуктом всего этого процесса является небесная вольфрамовая плазма, которая не имеет штрафов даже в пространстве-времени и может в некоторой степени соответствовать тому, что произвела бы гелиевая плазма на компактный реактор. Последний шаг самый медленный, но, если нет других узких мест, вы можете ожидать около §2§любителя в 8 миллиардов ЕС/т§р, предполагая, что один компакт сделает последний шаг с огромными бесконечными турбинами в плазме XL.\n\nОднако добраться туда будет непросто. Весь этот процесс использует в общей сложности 15 рецептов сварки и гораздо больше автоматизации материалов, чем любая из простых установок сварки. Эта цепочка заданий поможет объяснить, что является простым, а что непростым и, возможно, узким местом. Если вы выполните это, ваш генератор энергии будет поддерживаться до тех пор, пока не появится Рой Дайсона или любая другая опция, которая появится позже, и она будет продолжать приносить пользу в дальнейшем!"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "IC2:itemCellEmpty",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
