{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 127
    }
  },
  "questIDLow:4": 737,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "ProjRed|Core:projectred.core.drawplate",
        "Count:3": 1,
        "Damage:2": 44,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Ты можешь их съесть?",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Нет, вы не можете их съесть, но вы можете добавить их в свои маршрутизируемые трубы. Без чипов маршрутизируемые каналы ничего не могут делать сами по себе, у чипов также есть графический интерфейс для их настройки, который можно открыть, щелкнув правой кнопкой мыши.\nСуществует 8 типов чипов:\n\n-Чип экстрактора предметов можно использовать для отправки предметов из его инвентаря в чипы ответчика, динамического ответчика, терминатора и ответчика переполнения в трубопроводной сети.\n\n-Чип-ответчик предметов будет запрашивать предметы из чипов-экстракторов в вашей сети, которые соответствуют фильтру, настроенному для инвентаря, подключенного к чипу-ответчику. Фишки с более высоким приоритетом сначала будут получать предметы, пока инвентарь не заполнится, а затем будут отправлены в другие инвентари с действительными фильтрами и оставшимся местом.\n\n-Чип-ответчик динамических предметов будет запрашивать предметы из чипов-экстракторов в вашей сети, которые соответствуют предметам внутри инвентаря, подключенного к ответчику динамических предметов. Для работы этот чип должен находиться в том же интерфейсном канале, что и чип ответчика элемента. Здесь также действуют правила приоритета.\n\n-Ответчик переполнения элемента работает точно так же, как и чип ответчика элемента, однако он принимает только те элементы, которые не могут быть отправлены на чип ответчика элемента, чип ответчика динамического элемента или чип терминатора элемента.\n\n-Чип терминатора предмета работает как резервная копия для чипов ответчика.\n\n-Чип транслятора предметов покажет вам инвентарь, подключенный к маршрутизируемому каналу запросов в сети каналов, и может использоваться для извлечения предметов из него. Их также можно извлечь со стороны, которую вы настраиваете.\n\n-Чип хранителя запасов предметов будет постоянно проверять сеть на наличие предметов и подтягивать их к своей трубе. Если чип настроен на извлечение, когда он пуст, он будет тянуть только в том случае, если инвентарь рядом с ним пуст, в противном случае он будет тянуть, когда в инвентаре меньше предметов, чем настроено в чипе.\n\n- Фишки для крафта предметов.\n\n- Чипы расширения для создания предметов размещаются внутри чипов для создания предметов. Убедитесь, что вы рандомизировали идентификатор."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "ProjRed|Core:projectred.core.part",
          "Count:3": 4,
          "Damage:2": 44,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IC2:itemPartCircuit",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ProjRed|Core:projectred.core.part",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 15,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
