{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 717
    }
  },
  "questIDLow:4": 127,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "ProjRed|Transportation:projectred.transportation.routingchip",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "Красное начало проекта",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Добро пожаловать в Проект Красный!\n\nЭтот квест научит вас основам Projectred и покажет, как настроить систему Ghetto AE.\n\nСистема Ghetto AE будет очень полезна для сортировки всех ваших первых предметов.\n\nПрежде всего, существуют разные типы труб:\n\nТранспортные каналы элемента — это самые простые каналы, классифицируемые как нуль-логика. Они ничего не делают, кроме как соединяют другие трубы вместе.\nТрубы транспортировки предметов могут принимать только те предметы, которые входят в нее, и передавать их в другую подключенную трубу. Они вообще НЕ будут подключаться к инвентарям. На перекрестке, где существует более одного возможного направления, полезная нагрузка предметов будет перемещаться в случайно выбранном направлении.\n \nМаршрутизированные трубы являются наиболее совершенными. Эти трубы «общаются» друг с другом, образуя трубопроводные сети, что позволяет создавать невероятно сложные системы, управляемые спросом, абсолютно без необходимости использования схем из красного камня.\n \nТрубы под давлением — это трубы, в которых используется система маршрутизации на основе давления, при которой полезная нагрузка перемещается к ближайшему складу, который может ее принять. На поиск ближайшего инвентаря влияет как расстояние, так и трубы сопротивления давлению (которые для поиска пути имеют длину 1000 блоков), но на фактический путь, по которому идут предметы, влияет только расстояние.\n\nОднако для управления логикой проложенных трубок вам потребуются специальные микросхемы.\n\n§4Примечание: я понятия не имею, как работает PR, или эта цепочка квестов является полностью дубликатом, и у меня нет силы воли, чтобы прочитать весь скучный текст и выяснить это, поэтому я просто показал их, так как никто не предоставил никакой информации после того, как я спросил. Если его надо снять или с ним, оформите тикет."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "ProjRed|Transportation:projectred.transportation.pipe",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.02",
          "Count:3": 16,
          "Damage:2": 22032,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 15,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
