{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 15
    }
  },
  "questIDLow:4": 2737,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "SpiceOfLife:bookfoodjournal",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§2§lБольше еды, больше сердец",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Итак, еда отличная, правда? Но что еще важнее, это есть его тоннами! Скажете, слишком скучно и бессмысленно? А что, если я скажу вам, что вы можете получить дополнительные сердечки, просто расширив свой вкус? Вы получаете 1 очко за каждую половину голяшки голода от съеденной еды, а после 50 очков вы получаете 1 дополнительное сердце! Теперь у вас есть причина готовить еду для Пэм. Каждый продукт вносит свой вклад в ценность голяшки один раз. Если вы съели что-то из ланч-бокса, это считается так, как если бы вы достали это и съели вручную.\n\nЕсли вы хотите узнать, какие продукты вы ели, вы можете использовать «Журнал питания», но он неуклюжий. На самом деле вы хотите использовать NEI, чтобы видеть съеденные и не съеденные продукты. Вы можете выполнить поиск по запросу «еще не съедено», чтобы увидеть оставшиеся продукты, и «помощь», чтобы увидеть съеденные продукты. Чтобы увидеть это, вам нужно сначала начать снижать доходность.\n\nЕсли это не работает, перейдите к параметрам NEI в левом нижнем углу, когда инвентарь открыт, затем нажмите «Инвентарь» и измените режим поиска на «Регулярное выражение». Затем перезапустите клиент и повторите поиск.§r\n\nТакже есть две команды:\n\n/ размер списка продуктов\nСообщает вам общий прогресс и прогресс до следующего сердца.\n\n/foodlist sync \u003cИмяИгрока\u003e\nСинхронизируйте прогресс в еде с сервером, если он не синхронизирован."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}
