{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1008
    }
  },
  "questIDLow:4": 2026,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "BiblioCraft:item.StockroomCatalog",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "§3§lЛучший способ поиска предметов",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "NEI имеет встроенную функцию поиска для поиска предмета, хранящегося в инвентаре поблизости. Каталог склада может дать вам список всего, что хранится в ваших запасах.\n \nПодкрадитесь правой кнопкой мыши к блоку с инвентарем (сундук, книжный шкаф, бочка, все, что имеет инвентарь), чтобы добавить этот инвентарь в список инвентарей для отслеживания в каталоге.\n\nСнова щелкните правой кнопкой мыши по тому же блоку, чтобы удалить его из списка.\n\nЭффект небольших частиц будет отображаться на любом блоке, который был выбран в каталоге при удержании каталога склада, чтобы вы знали, что этот блок отслеживается.\n\nЩелкните правой кнопкой мыши, чтобы открыть графический интерфейс и просмотреть список. Вы можете отсортировать список по возрастанию или убыванию количества (Count) или в алфавитном порядке.\n\nВы также можете просмотреть список всех запасов, в которых есть определенный товар, и легко добавить местоположение одного из этих запасов в каталог склада, чтобы вы могли легко найти свои вещи.\n\nКаталог склада также можно копировать с помощью наборного стола и печатной машины.\n\nНажмите на заголовок, чтобы изменить его на что угодно, чтобы вы могли пометить свой складской каталог по индивидуальному заказу.\n\nНажмите на маленькие значки сундуков в правой части каждого списка, чтобы открыть список инвентаря.\n\nЕсли хотите, вы можете создать компас с путевой точкой и использовать его, чтобы указать вам на сундук. Поскольку у нас есть JourneyMaps и NEI, в этом нет особой необходимости.\n\n§4Каталог, похоже, немного некорректен и не очень хорошо работает с предметами GT."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "BiblioCraft:item.StockroomCatalog",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "minecraft:chest",
          "Count:3": 16,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}
