{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2614
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2089
    }
  },
  "questIDLow:4": 3284,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 14202,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
"name:8": "ИААДДС",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
"desc:8": "Она же Мега Пасека.\n\nОн имеет три основных режима (изменение с помощью отвертки) и два режима работы (изменение с помощью отвертки):\n\nРЕЖИМ ВХОДА: Не потребляет энергию. Поместите своих ферзей на входную шину, чтобы поместить их во внутренний буфер.\n\nРЕЖИМ ВЫХОДА: Не потребляет мощность. Вернет ваших пчел на выходную шину.\n\nРЕЖИМ РАБОТЫ – НОРМАЛЬНЫЙ: Время обработки составляет 5 секунд. Использует 1 А LuV на королеву. На всех пчел действует 64-кратное ускорение и 8 производственных улучшений, а также обновление генетического стабилизатора. IAADDS также моделирует идеальную среду для всех пчел.\n\nВы можете предоставить маточное молочко, чтобы увеличить производительность. 1 маточное молочко дает бонус 5% за пчелу. Они будут потребляться при каждом запуске операции и применяться только к этой операции. Максимальный бонус составляет 200%. Обычные характеристики пчел, конечно, все еще применимы, хотя IADDS может обеспечить идеальную среду для любой пчелы.\n\nРЕЖИМ РАБОТЫ - РОЙ: В этом режиме вы можете вставить только 1 королеву. Затем IADDS будет медленно производить неблагородных принцесс за 100 маточного молочка за операцию. Базовое время обработки составляет 1 минуту, но вы можете ускорить этот процесс. Базовое потребление составляет 1 А IV.\n\n§3Да, вам нужны тысячи королев, а не принцесс."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 14202,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "kubatech:kubaitems",
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": ""
        }
      }
    }
  }
}
